bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/**
  ******************************************************************************
  * @file    rf_reg.h
  * @version V1.2
  * @date    2020-04-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __RF_REG_H__
#define __RF_REG_H__

#include "bl702.h"

/* 0x0 : Silicon revision */
#define RF_REV_OFFSET  (0x0)
#define RF_REV         RF_REV
#define RF_REV_POS     (0U)
#define RF_REV_LEN     (8U)
#define RF_REV_MSK     (((1U << RF_REV_LEN) - 1) << RF_REV_POS)
#define RF_REV_UMSK    (~(((1U << RF_REV_LEN) - 1) << RF_REV_POS))
#define RF_FW_REV      RF_FW_REV
#define RF_FW_REV_POS  (8U)
#define RF_FW_REV_LEN  (8U)
#define RF_FW_REV_MSK  (((1U << RF_FW_REV_LEN) - 1) << RF_FW_REV_POS)
#define RF_FW_REV_UMSK (~(((1U << RF_FW_REV_LEN) - 1) << RF_FW_REV_POS))
#define RF_HW_REV      RF_HW_REV
#define RF_HW_REV_POS  (16U)
#define RF_HW_REV_LEN  (8U)
#define RF_HW_REV_MSK  (((1U << RF_HW_REV_LEN) - 1) << RF_HW_REV_POS)
#define RF_HW_REV_UMSK (~(((1U << RF_HW_REV_LEN) - 1) << RF_HW_REV_POS))

/* 0x4 : dsp_readback */
#define RF_DSP_READBACK_OFFSET     (0x4)
#define RF_CH_IND_HW               RF_CH_IND_HW
#define RF_CH_IND_HW_POS           (2U)
#define RF_CH_IND_HW_LEN           (7U)
#define RF_CH_IND_HW_MSK           (((1U << RF_CH_IND_HW_LEN) - 1) << RF_CH_IND_HW_POS)
#define RF_CH_IND_HW_UMSK          (~(((1U << RF_CH_IND_HW_LEN) - 1) << RF_CH_IND_HW_POS))
#define RF_RBB_IND_HW              RF_RBB_IND_HW
#define RF_RBB_IND_HW_POS          (9U)
#define RF_RBB_IND_HW_LEN          (5U)
#define RF_RBB_IND_HW_MSK          (((1U << RF_RBB_IND_HW_LEN) - 1) << RF_RBB_IND_HW_POS)
#define RF_RBB_IND_HW_UMSK         (~(((1U << RF_RBB_IND_HW_LEN) - 1) << RF_RBB_IND_HW_POS))
#define RF_RBB_BW_IND_HW           RF_RBB_BW_IND_HW
#define RF_RBB_BW_IND_HW_POS       (14U)
#define RF_RBB_BW_IND_HW_LEN       (1U)
#define RF_RBB_BW_IND_HW_MSK       (((1U << RF_RBB_BW_IND_HW_LEN) - 1) << RF_RBB_BW_IND_HW_POS)
#define RF_RBB_BW_IND_HW_UMSK      (~(((1U << RF_RBB_BW_IND_HW_LEN) - 1) << RF_RBB_BW_IND_HW_POS))
#define RF_CH_IND                  RF_CH_IND
#define RF_CH_IND_POS              (16U)
#define RF_CH_IND_LEN              (7U)
#define RF_CH_IND_MSK              (((1U << RF_CH_IND_LEN) - 1) << RF_CH_IND_POS)
#define RF_CH_IND_UMSK             (~(((1U << RF_CH_IND_LEN) - 1) << RF_CH_IND_POS))
#define RF_CH_IND_CTRL_HW          RF_CH_IND_CTRL_HW
#define RF_CH_IND_CTRL_HW_POS      (23U)
#define RF_CH_IND_CTRL_HW_LEN      (1U)
#define RF_CH_IND_CTRL_HW_MSK      (((1U << RF_CH_IND_CTRL_HW_LEN) - 1) << RF_CH_IND_CTRL_HW_POS)
#define RF_CH_IND_CTRL_HW_UMSK     (~(((1U << RF_CH_IND_CTRL_HW_LEN) - 1) << RF_CH_IND_CTRL_HW_POS))
#define RF_RBB_IND                 RF_RBB_IND
#define RF_RBB_IND_POS             (24U)
#define RF_RBB_IND_LEN             (5U)
#define RF_RBB_IND_MSK             (((1U << RF_RBB_IND_LEN) - 1) << RF_RBB_IND_POS)
#define RF_RBB_IND_UMSK            (~(((1U << RF_RBB_IND_LEN) - 1) << RF_RBB_IND_POS))
#define RF_RBB_IND_CTRL_HW         RF_RBB_IND_CTRL_HW
#define RF_RBB_IND_CTRL_HW_POS     (29U)
#define RF_RBB_IND_CTRL_HW_LEN     (1U)
#define RF_RBB_IND_CTRL_HW_MSK     (((1U << RF_RBB_IND_CTRL_HW_LEN) - 1) << RF_RBB_IND_CTRL_HW_POS)
#define RF_RBB_IND_CTRL_HW_UMSK    (~(((1U << RF_RBB_IND_CTRL_HW_LEN) - 1) << RF_RBB_IND_CTRL_HW_POS))
#define RF_RBB_BW_IND              RF_RBB_BW_IND
#define RF_RBB_BW_IND_POS          (30U)
#define RF_RBB_BW_IND_LEN          (1U)
#define RF_RBB_BW_IND_MSK          (((1U << RF_RBB_BW_IND_LEN) - 1) << RF_RBB_BW_IND_POS)
#define RF_RBB_BW_IND_UMSK         (~(((1U << RF_RBB_BW_IND_LEN) - 1) << RF_RBB_BW_IND_POS))
#define RF_RBB_BW_IND_CTRL_HW      RF_RBB_BW_IND_CTRL_HW
#define RF_RBB_BW_IND_CTRL_HW_POS  (31U)
#define RF_RBB_BW_IND_CTRL_HW_LEN  (1U)
#define RF_RBB_BW_IND_CTRL_HW_MSK  (((1U << RF_RBB_BW_IND_CTRL_HW_LEN) - 1) << RF_RBB_BW_IND_CTRL_HW_POS)
#define RF_RBB_BW_IND_CTRL_HW_UMSK (~(((1U << RF_RBB_BW_IND_CTRL_HW_LEN) - 1) << RF_RBB_BW_IND_CTRL_HW_POS))

/* 0x8 : Control logic switch */
#define RF_CTRL_SOURCE_OFFSET       (0x8)
#define RF_PU_CTRL_HW               RF_PU_CTRL_HW
#define RF_PU_CTRL_HW_POS           (0U)
#define RF_PU_CTRL_HW_LEN           (1U)
#define RF_PU_CTRL_HW_MSK           (((1U << RF_PU_CTRL_HW_LEN) - 1) << RF_PU_CTRL_HW_POS)
#define RF_PU_CTRL_HW_UMSK          (~(((1U << RF_PU_CTRL_HW_LEN) - 1) << RF_PU_CTRL_HW_POS))
#define RF_GAIN_CTRL_TX_HW          RF_GAIN_CTRL_TX_HW
#define RF_GAIN_CTRL_TX_HW_POS      (3U)
#define RF_GAIN_CTRL_TX_HW_LEN      (1U)
#define RF_GAIN_CTRL_TX_HW_MSK      (((1U << RF_GAIN_CTRL_TX_HW_LEN) - 1) << RF_GAIN_CTRL_TX_HW_POS)
#define RF_GAIN_CTRL_TX_HW_UMSK     (~(((1U << RF_GAIN_CTRL_TX_HW_LEN) - 1) << RF_GAIN_CTRL_TX_HW_POS))
#define RF_GAIN_CTRL_RX_HW          RF_GAIN_CTRL_RX_HW
#define RF_GAIN_CTRL_RX_HW_POS      (4U)
#define RF_GAIN_CTRL_RX_HW_LEN      (1U)
#define RF_GAIN_CTRL_RX_HW_MSK      (((1U << RF_GAIN_CTRL_RX_HW_LEN) - 1) << RF_GAIN_CTRL_RX_HW_POS)
#define RF_GAIN_CTRL_RX_HW_UMSK     (~(((1U << RF_GAIN_CTRL_RX_HW_LEN) - 1) << RF_GAIN_CTRL_RX_HW_POS))
#define RF_ROSDAC_CTRL_HW           RF_ROSDAC_CTRL_HW
#define RF_ROSDAC_CTRL_HW_POS       (8U)
#define RF_ROSDAC_CTRL_HW_LEN       (1U)
#define RF_ROSDAC_CTRL_HW_MSK       (((1U << RF_ROSDAC_CTRL_HW_LEN) - 1) << RF_ROSDAC_CTRL_HW_POS)
#define RF_ROSDAC_CTRL_HW_UMSK      (~(((1U << RF_ROSDAC_CTRL_HW_LEN) - 1) << RF_ROSDAC_CTRL_HW_POS))
#define RF_ROSDAC_CTRL_RCCAL        RF_ROSDAC_CTRL_RCCAL
#define RF_ROSDAC_CTRL_RCCAL_POS    (9U)
#define RF_ROSDAC_CTRL_RCCAL_LEN    (1U)
#define RF_ROSDAC_CTRL_RCCAL_MSK    (((1U << RF_ROSDAC_CTRL_RCCAL_LEN) - 1) << RF_ROSDAC_CTRL_RCCAL_POS)
#define RF_ROSDAC_CTRL_RCCAL_UMSK   (~(((1U << RF_ROSDAC_CTRL_RCCAL_LEN) - 1) << RF_ROSDAC_CTRL_RCCAL_POS))
#define RF_KCAL_RATIO_CTRL_HW       RF_KCAL_RATIO_CTRL_HW
#define RF_KCAL_RATIO_CTRL_HW_POS   (12U)
#define RF_KCAL_RATIO_CTRL_HW_LEN   (1U)
#define RF_KCAL_RATIO_CTRL_HW_MSK   (((1U << RF_KCAL_RATIO_CTRL_HW_LEN) - 1) << RF_KCAL_RATIO_CTRL_HW_POS)
#define RF_KCAL_RATIO_CTRL_HW_UMSK  (~(((1U << RF_KCAL_RATIO_CTRL_HW_LEN) - 1) << RF_KCAL_RATIO_CTRL_HW_POS))
#define RF_RBB_BW_CTRL_HW           RF_RBB_BW_CTRL_HW
#define RF_RBB_BW_CTRL_HW_POS       (16U)
#define RF_RBB_BW_CTRL_HW_LEN       (1U)
#define RF_RBB_BW_CTRL_HW_MSK       (((1U << RF_RBB_BW_CTRL_HW_LEN) - 1) << RF_RBB_BW_CTRL_HW_POS)
#define RF_RBB_BW_CTRL_HW_UMSK      (~(((1U << RF_RBB_BW_CTRL_HW_LEN) - 1) << RF_RBB_BW_CTRL_HW_POS))
#define RF_LO_FCW_CTRL_HW           RF_LO_FCW_CTRL_HW
#define RF_LO_FCW_CTRL_HW_POS       (20U)
#define RF_LO_FCW_CTRL_HW_LEN       (1U)
#define RF_LO_FCW_CTRL_HW_MSK       (((1U << RF_LO_FCW_CTRL_HW_LEN) - 1) << RF_LO_FCW_CTRL_HW_POS)
#define RF_LO_FCW_CTRL_HW_UMSK      (~(((1U << RF_LO_FCW_CTRL_HW_LEN) - 1) << RF_LO_FCW_CTRL_HW_POS))
#define RF_INC_FCAL_EN_CTRL_HW      RF_INC_FCAL_EN_CTRL_HW
#define RF_INC_FCAL_EN_CTRL_HW_POS  (24U)
#define RF_INC_FCAL_EN_CTRL_HW_LEN  (1U)
#define RF_INC_FCAL_EN_CTRL_HW_MSK  (((1U << RF_INC_FCAL_EN_CTRL_HW_LEN) - 1) << RF_INC_FCAL_EN_CTRL_HW_POS)
#define RF_INC_FCAL_EN_CTRL_HW_UMSK (~(((1U << RF_INC_FCAL_EN_CTRL_HW_LEN) - 1) << RF_INC_FCAL_EN_CTRL_HW_POS))
#define RF_VCO_IDAC_CTRL_HW         RF_VCO_IDAC_CTRL_HW
#define RF_VCO_IDAC_CTRL_HW_POS     (28U)
#define RF_VCO_IDAC_CTRL_HW_LEN     (1U)
#define RF_VCO_IDAC_CTRL_HW_MSK     (((1U << RF_VCO_IDAC_CTRL_HW_LEN) - 1) << RF_VCO_IDAC_CTRL_HW_POS)
#define RF_VCO_IDAC_CTRL_HW_UMSK    (~(((1U << RF_VCO_IDAC_CTRL_HW_LEN) - 1) << RF_VCO_IDAC_CTRL_HW_POS))

/* 0xC : rf calibration state enable in full cal list */
#define RF_CAL_STATE_CTRL_OFFSET    (0xC)
#define RF_FCAL_STATE_EN            RF_FCAL_STATE_EN
#define RF_FCAL_STATE_EN_POS        (0U)
#define RF_FCAL_STATE_EN_LEN        (1U)
#define RF_FCAL_STATE_EN_MSK        (((1U << RF_FCAL_STATE_EN_LEN) - 1) << RF_FCAL_STATE_EN_POS)
#define RF_FCAL_STATE_EN_UMSK       (~(((1U << RF_FCAL_STATE_EN_LEN) - 1) << RF_FCAL_STATE_EN_POS))
#define RF_ACAL_STATE_EN            RF_ACAL_STATE_EN
#define RF_ACAL_STATE_EN_POS        (1U)
#define RF_ACAL_STATE_EN_LEN        (1U)
#define RF_ACAL_STATE_EN_MSK        (((1U << RF_ACAL_STATE_EN_LEN) - 1) << RF_ACAL_STATE_EN_POS)
#define RF_ACAL_STATE_EN_UMSK       (~(((1U << RF_ACAL_STATE_EN_LEN) - 1) << RF_ACAL_STATE_EN_POS))
#define RF_KCAL_STATE_EN            RF_KCAL_STATE_EN
#define RF_KCAL_STATE_EN_POS        (2U)
#define RF_KCAL_STATE_EN_LEN        (1U)
#define RF_KCAL_STATE_EN_MSK        (((1U << RF_KCAL_STATE_EN_LEN) - 1) << RF_KCAL_STATE_EN_POS)
#define RF_KCAL_STATE_EN_UMSK       (~(((1U << RF_KCAL_STATE_EN_LEN) - 1) << RF_KCAL_STATE_EN_POS))
#define RF_ROSCAL_STATE_EN          RF_ROSCAL_STATE_EN
#define RF_ROSCAL_STATE_EN_POS      (3U)
#define RF_ROSCAL_STATE_EN_LEN      (1U)
#define RF_ROSCAL_STATE_EN_MSK      (((1U << RF_ROSCAL_STATE_EN_LEN) - 1) << RF_ROSCAL_STATE_EN_POS)
#define RF_ROSCAL_STATE_EN_UMSK     (~(((1U << RF_ROSCAL_STATE_EN_LEN) - 1) << RF_ROSCAL_STATE_EN_POS))
#define RF_RCCAL_STATE_EN           RF_RCCAL_STATE_EN
#define RF_RCCAL_STATE_EN_POS       (4U)
#define RF_RCCAL_STATE_EN_LEN       (1U)
#define RF_RCCAL_STATE_EN_MSK       (((1U << RF_RCCAL_STATE_EN_LEN) - 1) << RF_RCCAL_STATE_EN_POS)
#define RF_RCCAL_STATE_EN_UMSK      (~(((1U << RF_RCCAL_STATE_EN_LEN) - 1) << RF_RCCAL_STATE_EN_POS))
#define RF_INC_FCAL_STATE_EN        RF_INC_FCAL_STATE_EN
#define RF_INC_FCAL_STATE_EN_POS    (5U)
#define RF_INC_FCAL_STATE_EN_LEN    (1U)
#define RF_INC_FCAL_STATE_EN_MSK    (((1U << RF_INC_FCAL_STATE_EN_LEN) - 1) << RF_INC_FCAL_STATE_EN_POS)
#define RF_INC_FCAL_STATE_EN_UMSK   (~(((1U << RF_INC_FCAL_STATE_EN_LEN) - 1) << RF_INC_FCAL_STATE_EN_POS))
#define RF_INC_ACAL_STATE_EN        RF_INC_ACAL_STATE_EN
#define RF_INC_ACAL_STATE_EN_POS    (6U)
#define RF_INC_ACAL_STATE_EN_LEN    (1U)
#define RF_INC_ACAL_STATE_EN_MSK    (((1U << RF_INC_ACAL_STATE_EN_LEN) - 1) << RF_INC_ACAL_STATE_EN_POS)
#define RF_INC_ACAL_STATE_EN_UMSK   (~(((1U << RF_INC_ACAL_STATE_EN_LEN) - 1) << RF_INC_ACAL_STATE_EN_POS))
#define RF_INC_ROSCAL_STATE_EN      RF_INC_ROSCAL_STATE_EN
#define RF_INC_ROSCAL_STATE_EN_POS  (7U)
#define RF_INC_ROSCAL_STATE_EN_LEN  (1U)
#define RF_INC_ROSCAL_STATE_EN_MSK  (((1U << RF_INC_ROSCAL_STATE_EN_LEN) - 1) << RF_INC_ROSCAL_STATE_EN_POS)
#define RF_INC_ROSCAL_STATE_EN_UMSK (~(((1U << RF_INC_ROSCAL_STATE_EN_LEN) - 1) << RF_INC_ROSCAL_STATE_EN_POS))

/* 0x10 : Calibration mode register */
#define RF_CAL_SWITCH_CTRL_OFFSET (0x10)
#define RF_ACAL_EN                RF_ACAL_EN
#define RF_ACAL_EN_POS            (0U)
#define RF_ACAL_EN_LEN            (1U)
#define RF_ACAL_EN_MSK            (((1U << RF_ACAL_EN_LEN) - 1) << RF_ACAL_EN_POS)
#define RF_ACAL_EN_UMSK           (~(((1U << RF_ACAL_EN_LEN) - 1) << RF_ACAL_EN_POS))
#define RF_KCAL_EN                RF_KCAL_EN
#define RF_KCAL_EN_POS            (4U)
#define RF_KCAL_EN_LEN            (1U)
#define RF_KCAL_EN_MSK            (((1U << RF_KCAL_EN_LEN) - 1) << RF_KCAL_EN_POS)
#define RF_KCAL_EN_UMSK           (~(((1U << RF_KCAL_EN_LEN) - 1) << RF_KCAL_EN_POS))
#define RF_RCCAL_EN               RF_RCCAL_EN
#define RF_RCCAL_EN_POS           (8U)
#define RF_RCCAL_EN_LEN           (1U)
#define RF_RCCAL_EN_MSK           (((1U << RF_RCCAL_EN_LEN) - 1) << RF_RCCAL_EN_POS)
#define RF_RCCAL_EN_UMSK          (~(((1U << RF_RCCAL_EN_LEN) - 1) << RF_RCCAL_EN_POS))
#define RF_INC_ACAL_EN            RF_INC_ACAL_EN
#define RF_INC_ACAL_EN_POS        (12U)
#define RF_INC_ACAL_EN_LEN        (1U)
#define RF_INC_ACAL_EN_MSK        (((1U << RF_INC_ACAL_EN_LEN) - 1) << RF_INC_ACAL_EN_POS)
#define RF_INC_ACAL_EN_UMSK       (~(((1U << RF_INC_ACAL_EN_LEN) - 1) << RF_INC_ACAL_EN_POS))
#define RF_INC_FCAL_EN            RF_INC_FCAL_EN
#define RF_INC_FCAL_EN_POS        (16U)
#define RF_INC_FCAL_EN_LEN        (1U)
#define RF_INC_FCAL_EN_MSK        (((1U << RF_INC_FCAL_EN_LEN) - 1) << RF_INC_FCAL_EN_POS)
#define RF_INC_FCAL_EN_UMSK       (~(((1U << RF_INC_FCAL_EN_LEN) - 1) << RF_INC_FCAL_EN_POS))
#define RF_INC_FCAL_EN_HW         RF_INC_FCAL_EN_HW
#define RF_INC_FCAL_EN_HW_POS     (17U)
#define RF_INC_FCAL_EN_HW_LEN     (1U)
#define RF_INC_FCAL_EN_HW_MSK     (((1U << RF_INC_FCAL_EN_HW_LEN) - 1) << RF_INC_FCAL_EN_HW_POS)
#define RF_INC_FCAL_EN_HW_UMSK    (~(((1U << RF_INC_FCAL_EN_HW_LEN) - 1) << RF_INC_FCAL_EN_HW_POS))

/* 0x14 : rf_cal_status */
#define RF_CAL_STATUS_OFFSET          (0x14)
#define RF_ACAL_STATUS                RF_ACAL_STATUS
#define RF_ACAL_STATUS_POS            (2U)
#define RF_ACAL_STATUS_LEN            (2U)
#define RF_ACAL_STATUS_MSK            (((1U << RF_ACAL_STATUS_LEN) - 1) << RF_ACAL_STATUS_POS)
#define RF_ACAL_STATUS_UMSK           (~(((1U << RF_ACAL_STATUS_LEN) - 1) << RF_ACAL_STATUS_POS))
#define RF_KCAL_STATUS                RF_KCAL_STATUS
#define RF_KCAL_STATUS_POS            (4U)
#define RF_KCAL_STATUS_LEN            (2U)
#define RF_KCAL_STATUS_MSK            (((1U << RF_KCAL_STATUS_LEN) - 1) << RF_KCAL_STATUS_POS)
#define RF_KCAL_STATUS_UMSK           (~(((1U << RF_KCAL_STATUS_LEN) - 1) << RF_KCAL_STATUS_POS))
#define RF_ROSCAL_STATUS              RF_ROSCAL_STATUS
#define RF_ROSCAL_STATUS_POS          (6U)
#define RF_ROSCAL_STATUS_LEN          (2U)
#define RF_ROSCAL_STATUS_MSK          (((1U << RF_ROSCAL_STATUS_LEN) - 1) << RF_ROSCAL_STATUS_POS)
#define RF_ROSCAL_STATUS_UMSK         (~(((1U << RF_ROSCAL_STATUS_LEN) - 1) << RF_ROSCAL_STATUS_POS))
#define RF_RCCAL_STATUS               RF_RCCAL_STATUS
#define RF_RCCAL_STATUS_POS           (8U)
#define RF_RCCAL_STATUS_LEN           (2U)
#define RF_RCCAL_STATUS_MSK           (((1U << RF_RCCAL_STATUS_LEN) - 1) << RF_RCCAL_STATUS_POS)
#define RF_RCCAL_STATUS_UMSK          (~(((1U << RF_RCCAL_STATUS_LEN) - 1) << RF_RCCAL_STATUS_POS))
#define RF_DL_RFCAL_TABLE_STATUS      RF_DL_RFCAL_TABLE_STATUS
#define RF_DL_RFCAL_TABLE_STATUS_POS  (30U)
#define RF_DL_RFCAL_TABLE_STATUS_LEN  (2U)
#define RF_DL_RFCAL_TABLE_STATUS_MSK  (((1U << RF_DL_RFCAL_TABLE_STATUS_LEN) - 1) << RF_DL_RFCAL_TABLE_STATUS_POS)
#define RF_DL_RFCAL_TABLE_STATUS_UMSK (~(((1U << RF_DL_RFCAL_TABLE_STATUS_LEN) - 1) << RF_DL_RFCAL_TABLE_STATUS_POS))

/* 0x18 : pu_delay_confg */
#define RF_PU_DELAY_CONFG_OFFSET  (0x18)
#define RF_PPU_LEAD               RF_PPU_LEAD
#define RF_PPU_LEAD_POS           (0U)
#define RF_PPU_LEAD_LEN           (2U)
#define RF_PPU_LEAD_MSK           (((1U << RF_PPU_LEAD_LEN) - 1) << RF_PPU_LEAD_POS)
#define RF_PPU_LEAD_UMSK          (~(((1U << RF_PPU_LEAD_LEN) - 1) << RF_PPU_LEAD_POS))
#define RF_PUD_DELAY              RF_PUD_DELAY
#define RF_PUD_DELAY_POS          (4U)
#define RF_PUD_DELAY_LEN          (2U)
#define RF_PUD_DELAY_MSK          (((1U << RF_PUD_DELAY_LEN) - 1) << RF_PUD_DELAY_POS)
#define RF_PUD_DELAY_UMSK         (~(((1U << RF_PUD_DELAY_LEN) - 1) << RF_PUD_DELAY_POS))
#define RF_LO_RESET_DELAY         RF_LO_RESET_DELAY
#define RF_LO_RESET_DELAY_POS     (12U)
#define RF_LO_RESET_DELAY_LEN     (2U)
#define RF_LO_RESET_DELAY_MSK     (((1U << RF_LO_RESET_DELAY_LEN) - 1) << RF_LO_RESET_DELAY_POS)
#define RF_LO_RESET_DELAY_UMSK    (~(((1U << RF_LO_RESET_DELAY_LEN) - 1) << RF_LO_RESET_DELAY_POS))
#define RF_LO_RESET_WIDTH         RF_LO_RESET_WIDTH
#define RF_LO_RESET_WIDTH_POS     (16U)
#define RF_LO_RESET_WIDTH_LEN     (2U)
#define RF_LO_RESET_WIDTH_MSK     (((1U << RF_LO_RESET_WIDTH_LEN) - 1) << RF_LO_RESET_WIDTH_POS)
#define RF_LO_RESET_WIDTH_UMSK    (~(((1U << RF_LO_RESET_WIDTH_LEN) - 1) << RF_LO_RESET_WIDTH_POS))
#define RF_ADPLL_RESET_WIDTH      RF_ADPLL_RESET_WIDTH
#define RF_ADPLL_RESET_WIDTH_POS  (20U)
#define RF_ADPLL_RESET_WIDTH_LEN  (2U)
#define RF_ADPLL_RESET_WIDTH_MSK  (((1U << RF_ADPLL_RESET_WIDTH_LEN) - 1) << RF_ADPLL_RESET_WIDTH_POS)
#define RF_ADPLL_RESET_WIDTH_UMSK (~(((1U << RF_ADPLL_RESET_WIDTH_LEN) - 1) << RF_ADPLL_RESET_WIDTH_POS))

