bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x100 : Register control of power up signals */
#define RF_PUCR_REG_OFFSET          (0x100)
#define RF_LODIST_TX_EN             RF_LODIST_TX_EN
#define RF_LODIST_TX_EN_POS         (0U)
#define RF_LODIST_TX_EN_LEN         (1U)
#define RF_LODIST_TX_EN_MSK         (((1U << RF_LODIST_TX_EN_LEN) - 1) << RF_LODIST_TX_EN_POS)
#define RF_LODIST_TX_EN_UMSK        (~(((1U << RF_LODIST_TX_EN_LEN) - 1) << RF_LODIST_TX_EN_POS))
#define RF_PU_TXBUF                 RF_PU_TXBUF
#define RF_PU_TXBUF_POS             (1U)
#define RF_PU_TXBUF_LEN             (1U)
#define RF_PU_TXBUF_MSK             (((1U << RF_PU_TXBUF_LEN) - 1) << RF_PU_TXBUF_POS)
#define RF_PU_TXBUF_UMSK            (~(((1U << RF_PU_TXBUF_LEN) - 1) << RF_PU_TXBUF_POS))
#define RF_PU_RXBUF                 RF_PU_RXBUF
#define RF_PU_RXBUF_POS             (2U)
#define RF_PU_RXBUF_LEN             (1U)
#define RF_PU_RXBUF_MSK             (((1U << RF_PU_RXBUF_LEN) - 1) << RF_PU_RXBUF_POS)
#define RF_PU_RXBUF_UMSK            (~(((1U << RF_PU_RXBUF_LEN) - 1) << RF_PU_RXBUF_POS))
#define RF_PU_DTC                   RF_PU_DTC
#define RF_PU_DTC_POS               (3U)
#define RF_PU_DTC_LEN               (1U)
#define RF_PU_DTC_MSK               (((1U << RF_PU_DTC_LEN) - 1) << RF_PU_DTC_POS)
#define RF_PU_DTC_UMSK              (~(((1U << RF_PU_DTC_LEN) - 1) << RF_PU_DTC_POS))
#define RF_PU_ADPLL_SFREG           RF_PU_ADPLL_SFREG
#define RF_PU_ADPLL_SFREG_POS       (4U)
#define RF_PU_ADPLL_SFREG_LEN       (1U)
#define RF_PU_ADPLL_SFREG_MSK       (((1U << RF_PU_ADPLL_SFREG_LEN) - 1) << RF_PU_ADPLL_SFREG_POS)
#define RF_PU_ADPLL_SFREG_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_LEN) - 1) << RF_PU_ADPLL_SFREG_POS))
#define RF_PU_ADPLL_ADC             RF_PU_ADPLL_ADC
#define RF_PU_ADPLL_ADC_POS         (5U)
#define RF_PU_ADPLL_ADC_LEN         (1U)
#define RF_PU_ADPLL_ADC_MSK         (((1U << RF_PU_ADPLL_ADC_LEN) - 1) << RF_PU_ADPLL_ADC_POS)
#define RF_PU_ADPLL_ADC_UMSK        (~(((1U << RF_PU_ADPLL_ADC_LEN) - 1) << RF_PU_ADPLL_ADC_POS))
#define RF_ADPLL_CLK_EN             RF_ADPLL_CLK_EN
#define RF_ADPLL_CLK_EN_POS         (6U)
#define RF_ADPLL_CLK_EN_LEN         (1U)
#define RF_ADPLL_CLK_EN_MSK         (((1U << RF_ADPLL_CLK_EN_LEN) - 1) << RF_ADPLL_CLK_EN_POS)
#define RF_ADPLL_CLK_EN_UMSK        (~(((1U << RF_ADPLL_CLK_EN_LEN) - 1) << RF_ADPLL_CLK_EN_POS))
#define RF_LOTPM_HFP_BYPASS         RF_LOTPM_HFP_BYPASS
#define RF_LOTPM_HFP_BYPASS_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_MSK     (((1U << RF_LOTPM_HFP_BYPASS_LEN) - 1) << RF_LOTPM_HFP_BYPASS_POS)
#define RF_LOTPM_HFP_BYPASS_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_LEN) - 1) << RF_LOTPM_HFP_BYPASS_POS))
#define RF_LOTPM_LFP_BYPASS         RF_LOTPM_LFP_BYPASS
#define RF_LOTPM_LFP_BYPASS_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_MSK     (((1U << RF_LOTPM_LFP_BYPASS_LEN) - 1) << RF_LOTPM_LFP_BYPASS_POS)
#define RF_LOTPM_LFP_BYPASS_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_LEN) - 1) << RF_LOTPM_LFP_BYPASS_POS))
#define RF_LOTPM_HFP_CLK_EN         RF_LOTPM_HFP_CLK_EN
#define RF_LOTPM_HFP_CLK_EN_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_POS)
#define RF_LOTPM_HFP_CLK_EN_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_POS))
#define RF_PU_FBDV_BUF              RF_PU_FBDV_BUF
#define RF_PU_FBDV_BUF_POS          (10U)
#define RF_PU_FBDV_BUF_LEN          (1U)
#define RF_PU_FBDV_BUF_MSK          (((1U << RF_PU_FBDV_BUF_LEN) - 1) << RF_PU_FBDV_BUF_POS)
#define RF_PU_FBDV_BUF_UMSK         (~(((1U << RF_PU_FBDV_BUF_LEN) - 1) << RF_PU_FBDV_BUF_POS))
#define RF_PU_FBDV                  RF_PU_FBDV
#define RF_PU_FBDV_POS              (11U)
#define RF_PU_FBDV_LEN              (1U)
#define RF_PU_FBDV_MSK              (((1U << RF_PU_FBDV_LEN) - 1) << RF_PU_FBDV_POS)
#define RF_PU_FBDV_UMSK             (~(((1U << RF_PU_FBDV_LEN) - 1) << RF_PU_FBDV_POS))
#define RF_PU_VCO                   RF_PU_VCO
#define RF_PU_VCO_POS               (12U)
#define RF_PU_VCO_LEN               (1U)
#define RF_PU_VCO_MSK               (((1U << RF_PU_VCO_LEN) - 1) << RF_PU_VCO_POS)
#define RF_PU_VCO_UMSK              (~(((1U << RF_PU_VCO_LEN) - 1) << RF_PU_VCO_POS))
#define RF_PU_VCO_LDO               RF_PU_VCO_LDO
#define RF_PU_VCO_LDO_POS           (13U)
#define RF_PU_VCO_LDO_LEN           (1U)
#define RF_PU_VCO_LDO_MSK           (((1U << RF_PU_VCO_LDO_LEN) - 1) << RF_PU_VCO_LDO_POS)
#define RF_PU_VCO_LDO_UMSK          (~(((1U << RF_PU_VCO_LDO_LEN) - 1) << RF_PU_VCO_LDO_POS))
#define RF_PU_LODIST_BODY_BIAS      RF_PU_LODIST_BODY_BIAS
#define RF_PU_LODIST_BODY_BIAS_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_POS)
#define RF_PU_LODIST_BODY_BIAS_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_POS))
#define RF_RXADC_CLK_EN             RF_RXADC_CLK_EN
#define RF_RXADC_CLK_EN_POS         (15U)
#define RF_RXADC_CLK_EN_LEN         (1U)
#define RF_RXADC_CLK_EN_MSK         (((1U << RF_RXADC_CLK_EN_LEN) - 1) << RF_RXADC_CLK_EN_POS)
#define RF_RXADC_CLK_EN_UMSK        (~(((1U << RF_RXADC_CLK_EN_LEN) - 1) << RF_RXADC_CLK_EN_POS))
#define RF_PU_RXADC                 RF_PU_RXADC
#define RF_PU_RXADC_POS             (16U)
#define RF_PU_RXADC_LEN             (1U)
#define RF_PU_RXADC_MSK             (((1U << RF_PU_RXADC_LEN) - 1) << RF_PU_RXADC_POS)
#define RF_PU_RXADC_UMSK            (~(((1U << RF_PU_RXADC_LEN) - 1) << RF_PU_RXADC_POS))
#define RF_PU_ROSDAC                RF_PU_ROSDAC
#define RF_PU_ROSDAC_POS            (17U)
#define RF_PU_ROSDAC_LEN            (1U)
#define RF_PU_ROSDAC_MSK            (((1U << RF_PU_ROSDAC_LEN) - 1) << RF_PU_ROSDAC_POS)
#define RF_PU_ROSDAC_UMSK           (~(((1U << RF_PU_ROSDAC_LEN) - 1) << RF_PU_ROSDAC_POS))
#define RF_PU_RBB_PKDET             RF_PU_RBB_PKDET
#define RF_PU_RBB_PKDET_POS         (18U)
#define RF_PU_RBB_PKDET_LEN         (1U)
#define RF_PU_RBB_PKDET_MSK         (((1U << RF_PU_RBB_PKDET_LEN) - 1) << RF_PU_RBB_PKDET_POS)
#define RF_PU_RBB_PKDET_UMSK        (~(((1U << RF_PU_RBB_PKDET_LEN) - 1) << RF_PU_RBB_PKDET_POS))
#define RF_PU_RBB                   RF_PU_RBB
#define RF_PU_RBB_POS               (19U)
#define RF_PU_RBB_LEN               (1U)
#define RF_PU_RBB_MSK               (((1U << RF_PU_RBB_LEN) - 1) << RF_PU_RBB_POS)
#define RF_PU_RBB_UMSK              (~(((1U << RF_PU_RBB_LEN) - 1) << RF_PU_RBB_POS))
#define RF_PU_RMX                   RF_PU_RMX
#define RF_PU_RMX_POS               (20U)
#define RF_PU_RMX_LEN               (1U)
#define RF_PU_RMX_MSK               (((1U << RF_PU_RMX_LEN) - 1) << RF_PU_RMX_POS)
#define RF_PU_RMX_UMSK              (~(((1U << RF_PU_RMX_LEN) - 1) << RF_PU_RMX_POS))
#define RF_PU_LNA                   RF_PU_LNA
#define RF_PU_LNA_POS               (21U)
#define RF_PU_LNA_LEN               (1U)
#define RF_PU_LNA_MSK               (((1U << RF_PU_LNA_LEN) - 1) << RF_PU_LNA_POS)
#define RF_PU_LNA_UMSK              (~(((1U << RF_PU_LNA_LEN) - 1) << RF_PU_LNA_POS))
#define RF_PU_PA                    RF_PU_PA
#define RF_PU_PA_POS                (22U)
#define RF_PU_PA_LEN                (1U)
#define RF_PU_PA_MSK                (((1U << RF_PU_PA_LEN) - 1) << RF_PU_PA_POS)
#define RF_PU_PA_UMSK               (~(((1U << RF_PU_PA_LEN) - 1) << RF_PU_PA_POS))
#define RF_RX_BYPASS_EN             RF_RX_BYPASS_EN
#define RF_RX_BYPASS_EN_POS         (23U)
#define RF_RX_BYPASS_EN_LEN         (1U)
#define RF_RX_BYPASS_EN_MSK         (((1U << RF_RX_BYPASS_EN_LEN) - 1) << RF_RX_BYPASS_EN_POS)
#define RF_RX_BYPASS_EN_UMSK        (~(((1U << RF_RX_BYPASS_EN_LEN) - 1) << RF_RX_BYPASS_EN_POS))
#define RF_PA_SERI_CAP_EN           RF_PA_SERI_CAP_EN
#define RF_PA_SERI_CAP_EN_POS       (24U)
#define RF_PA_SERI_CAP_EN_LEN       (1U)
#define RF_PA_SERI_CAP_EN_MSK       (((1U << RF_PA_SERI_CAP_EN_LEN) - 1) << RF_PA_SERI_CAP_EN_POS)
#define RF_PA_SERI_CAP_EN_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_LEN) - 1) << RF_PA_SERI_CAP_EN_POS))
#define RF_RST_ADPLL                RF_RST_ADPLL
#define RF_RST_ADPLL_POS            (25U)
#define RF_RST_ADPLL_LEN            (1U)
#define RF_RST_ADPLL_MSK            (((1U << RF_RST_ADPLL_LEN) - 1) << RF_RST_ADPLL_POS)
#define RF_RST_ADPLL_UMSK           (~(((1U << RF_RST_ADPLL_LEN) - 1) << RF_RST_ADPLL_POS))
#define RF_RST_LOTPM_HFP            RF_RST_LOTPM_HFP
#define RF_RST_LOTPM_HFP_POS        (26U)
#define RF_RST_LOTPM_HFP_LEN        (1U)
#define RF_RST_LOTPM_HFP_MSK        (((1U << RF_RST_LOTPM_HFP_LEN) - 1) << RF_RST_LOTPM_HFP_POS)
#define RF_RST_LOTPM_HFP_UMSK       (~(((1U << RF_RST_LOTPM_HFP_LEN) - 1) << RF_RST_LOTPM_HFP_POS))
#define RF_RST_FBDV                 RF_RST_FBDV
#define RF_RST_FBDV_POS             (27U)
#define RF_RST_FBDV_LEN             (1U)
#define RF_RST_FBDV_MSK             (((1U << RF_RST_FBDV_LEN) - 1) << RF_RST_FBDV_POS)
#define RF_RST_FBDV_UMSK            (~(((1U << RF_RST_FBDV_LEN) - 1) << RF_RST_FBDV_POS))

/* 0x104 : Power up setting in SB state */
#define RF_PUCR_SB_OFFSET              (0x104)
#define RF_LODIST_TX_EN_SB             RF_LODIST_TX_EN_SB
#define RF_LODIST_TX_EN_SB_POS         (0U)
#define RF_LODIST_TX_EN_SB_LEN         (1U)
#define RF_LODIST_TX_EN_SB_MSK         (((1U << RF_LODIST_TX_EN_SB_LEN) - 1) << RF_LODIST_TX_EN_SB_POS)
#define RF_LODIST_TX_EN_SB_UMSK        (~(((1U << RF_LODIST_TX_EN_SB_LEN) - 1) << RF_LODIST_TX_EN_SB_POS))
#define RF_PU_TXBUF_SB                 RF_PU_TXBUF_SB
#define RF_PU_TXBUF_SB_POS             (1U)
#define RF_PU_TXBUF_SB_LEN             (1U)
#define RF_PU_TXBUF_SB_MSK             (((1U << RF_PU_TXBUF_SB_LEN) - 1) << RF_PU_TXBUF_SB_POS)
#define RF_PU_TXBUF_SB_UMSK            (~(((1U << RF_PU_TXBUF_SB_LEN) - 1) << RF_PU_TXBUF_SB_POS))
#define RF_PU_RXBUF_SB                 RF_PU_RXBUF_SB
#define RF_PU_RXBUF_SB_POS             (2U)
#define RF_PU_RXBUF_SB_LEN             (1U)
#define RF_PU_RXBUF_SB_MSK             (((1U << RF_PU_RXBUF_SB_LEN) - 1) << RF_PU_RXBUF_SB_POS)
#define RF_PU_RXBUF_SB_UMSK            (~(((1U << RF_PU_RXBUF_SB_LEN) - 1) << RF_PU_RXBUF_SB_POS))
#define RF_PU_DTC_SB                   RF_PU_DTC_SB
#define RF_PU_DTC_SB_POS               (3U)
#define RF_PU_DTC_SB_LEN               (1U)
#define RF_PU_DTC_SB_MSK               (((1U << RF_PU_DTC_SB_LEN) - 1) << RF_PU_DTC_SB_POS)
#define RF_PU_DTC_SB_UMSK              (~(((1U << RF_PU_DTC_SB_LEN) - 1) << RF_PU_DTC_SB_POS))
#define RF_PU_ADPLL_SFREG_SB           RF_PU_ADPLL_SFREG_SB
#define RF_PU_ADPLL_SFREG_SB_POS       (4U)
#define RF_PU_ADPLL_SFREG_SB_LEN       (1U)
#define RF_PU_ADPLL_SFREG_SB_MSK       (((1U << RF_PU_ADPLL_SFREG_SB_LEN) - 1) << RF_PU_ADPLL_SFREG_SB_POS)
#define RF_PU_ADPLL_SFREG_SB_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_SB_LEN) - 1) << RF_PU_ADPLL_SFREG_SB_POS))
#define RF_PU_ADPLL_ADC_SB             RF_PU_ADPLL_ADC_SB
#define RF_PU_ADPLL_ADC_SB_POS         (5U)
#define RF_PU_ADPLL_ADC_SB_LEN         (1U)
#define RF_PU_ADPLL_ADC_SB_MSK         (((1U << RF_PU_ADPLL_ADC_SB_LEN) - 1) << RF_PU_ADPLL_ADC_SB_POS)
#define RF_PU_ADPLL_ADC_SB_UMSK        (~(((1U << RF_PU_ADPLL_ADC_SB_LEN) - 1) << RF_PU_ADPLL_ADC_SB_POS))
#define RF_ADPLL_CLK_EN_SB             RF_ADPLL_CLK_EN_SB
#define RF_ADPLL_CLK_EN_SB_POS         (6U)
#define RF_ADPLL_CLK_EN_SB_LEN         (1U)
#define RF_ADPLL_CLK_EN_SB_MSK         (((1U << RF_ADPLL_CLK_EN_SB_LEN) - 1) << RF_ADPLL_CLK_EN_SB_POS)
#define RF_ADPLL_CLK_EN_SB_UMSK        (~(((1U << RF_ADPLL_CLK_EN_SB_LEN) - 1) << RF_ADPLL_CLK_EN_SB_POS))
#define RF_LOTPM_HFP_BYPASS_SB         RF_LOTPM_HFP_BYPASS_SB
#define RF_LOTPM_HFP_BYPASS_SB_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_SB_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_SB_MSK     (((1U << RF_LOTPM_HFP_BYPASS_SB_LEN) - 1) << RF_LOTPM_HFP_BYPASS_SB_POS)
#define RF_LOTPM_HFP_BYPASS_SB_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_SB_LEN) - 1) << RF_LOTPM_HFP_BYPASS_SB_POS))
#define RF_LOTPM_LFP_BYPASS_SB         RF_LOTPM_LFP_BYPASS_SB
#define RF_LOTPM_LFP_BYPASS_SB_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_SB_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_SB_MSK     (((1U << RF_LOTPM_LFP_BYPASS_SB_LEN) - 1) << RF_LOTPM_LFP_BYPASS_SB_POS)
#define RF_LOTPM_LFP_BYPASS_SB_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_SB_LEN) - 1) << RF_LOTPM_LFP_BYPASS_SB_POS))
#define RF_LOTPM_HFP_CLK_EN_SB         RF_LOTPM_HFP_CLK_EN_SB
#define RF_LOTPM_HFP_CLK_EN_SB_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_SB_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_SB_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_SB_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_SB_POS)
#define RF_LOTPM_HFP_CLK_EN_SB_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_SB_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_SB_POS))
#define RF_PU_FBDV_BUF_SB              RF_PU_FBDV_BUF_SB
#define RF_PU_FBDV_BUF_SB_POS          (10U)
#define RF_PU_FBDV_BUF_SB_LEN          (1U)
#define RF_PU_FBDV_BUF_SB_MSK          (((1U << RF_PU_FBDV_BUF_SB_LEN) - 1) << RF_PU_FBDV_BUF_SB_POS)
#define RF_PU_FBDV_BUF_SB_UMSK         (~(((1U << RF_PU_FBDV_BUF_SB_LEN) - 1) << RF_PU_FBDV_BUF_SB_POS))
#define RF_PU_FBDV_SB                  RF_PU_FBDV_SB
#define RF_PU_FBDV_SB_POS              (11U)
#define RF_PU_FBDV_SB_LEN              (1U)
#define RF_PU_FBDV_SB_MSK              (((1U << RF_PU_FBDV_SB_LEN) - 1) << RF_PU_FBDV_SB_POS)
#define RF_PU_FBDV_SB_UMSK             (~(((1U << RF_PU_FBDV_SB_LEN) - 1) << RF_PU_FBDV_SB_POS))
#define RF_PU_VCO_SB                   RF_PU_VCO_SB
#define RF_PU_VCO_SB_POS               (12U)
#define RF_PU_VCO_SB_LEN               (1U)
#define RF_PU_VCO_SB_MSK               (((1U << RF_PU_VCO_SB_LEN) - 1) << RF_PU_VCO_SB_POS)
#define RF_PU_VCO_SB_UMSK              (~(((1U << RF_PU_VCO_SB_LEN) - 1) << RF_PU_VCO_SB_POS))
#define RF_PU_VCO_LDO_SB               RF_PU_VCO_LDO_SB
#define RF_PU_VCO_LDO_SB_POS           (13U)
#define RF_PU_VCO_LDO_SB_LEN           (1U)
#define RF_PU_VCO_LDO_SB_MSK           (((1U << RF_PU_VCO_LDO_SB_LEN) - 1) << RF_PU_VCO_LDO_SB_POS)
#define RF_PU_VCO_LDO_SB_UMSK          (~(((1U << RF_PU_VCO_LDO_SB_LEN) - 1) << RF_PU_VCO_LDO_SB_POS))
#define RF_PU_LODIST_BODY_BIAS_SB      RF_PU_LODIST_BODY_BIAS_SB
#define RF_PU_LODIST_BODY_BIAS_SB_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_SB_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_SB_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_SB_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_SB_POS)
#define RF_PU_LODIST_BODY_BIAS_SB_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_SB_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_SB_POS))
#define RF_RXADC_CLK_EN_SB             RF_RXADC_CLK_EN_SB
#define RF_RXADC_CLK_EN_SB_POS         (15U)
#define RF_RXADC_CLK_EN_SB_LEN         (1U)
#define RF_RXADC_CLK_EN_SB_MSK         (((1U << RF_RXADC_CLK_EN_SB_LEN) - 1) << RF_RXADC_CLK_EN_SB_POS)
#define RF_RXADC_CLK_EN_SB_UMSK        (~(((1U << RF_RXADC_CLK_EN_SB_LEN) - 1) << RF_RXADC_CLK_EN_SB_POS))
#define RF_PU_RXADC_SB                 RF_PU_RXADC_SB
#define RF_PU_RXADC_SB_POS             (16U)
#define RF_PU_RXADC_SB_LEN             (1U)
#define RF_PU_RXADC_SB_MSK             (((1U << RF_PU_RXADC_SB_LEN) - 1) << RF_PU_RXADC_SB_POS)
#define RF_PU_RXADC_SB_UMSK            (~(((1U << RF_PU_RXADC_SB_LEN) - 1) << RF_PU_RXADC_SB_POS))
#define RF_PU_ROSDAC_SB                RF_PU_ROSDAC_SB
#define RF_PU_ROSDAC_SB_POS            (17U)
#define RF_PU_ROSDAC_SB_LEN            (1U)
#define RF_PU_ROSDAC_SB_MSK            (((1U << RF_PU_ROSDAC_SB_LEN) - 1) << RF_PU_ROSDAC_SB_POS)
#define RF_PU_ROSDAC_SB_UMSK           (~(((1U << RF_PU_ROSDAC_SB_LEN) - 1) << RF_PU_ROSDAC_SB_POS))
#define RF_PU_RBB_PKDET_SB             RF_PU_RBB_PKDET_SB
#define RF_PU_RBB_PKDET_SB_POS         (18U)
#define RF_PU_RBB_PKDET_SB_LEN         (1U)
#define RF_PU_RBB_PKDET_SB_MSK         (((1U << RF_PU_RBB_PKDET_SB_LEN) - 1) << RF_PU_RBB_PKDET_SB_POS)
#define RF_PU_RBB_PKDET_SB_UMSK        (~(((1U << RF_PU_RBB_PKDET_SB_LEN) - 1) << RF_PU_RBB_PKDET_SB_POS))
#define RF_PU_RBB_SB                   RF_PU_RBB_SB
#define RF_PU_RBB_SB_POS               (19U)
#define RF_PU_RBB_SB_LEN               (1U)
#define RF_PU_RBB_SB_MSK               (((1U << RF_PU_RBB_SB_LEN) - 1) << RF_PU_RBB_SB_POS)
#define RF_PU_RBB_SB_UMSK              (~(((1U << RF_PU_RBB_SB_LEN) - 1) << RF_PU_RBB_SB_POS))
#define RF_PU_RMX_SB                   RF_PU_RMX_SB
#define RF_PU_RMX_SB_POS               (20U)
#define RF_PU_RMX_SB_LEN               (1U)
#define RF_PU_RMX_SB_MSK               (((1U << RF_PU_RMX_SB_LEN) - 1) << RF_PU_RMX_SB_POS)
#define RF_PU_RMX_SB_UMSK              (~(((1U << RF_PU_RMX_SB_LEN) - 1) << RF_PU_RMX_SB_POS))
#define RF_PU_LNA_SB                   RF_PU_LNA_SB
#define RF_PU_LNA_SB_POS               (21U)
#define RF_PU_LNA_SB_LEN               (1U)
#define RF_PU_LNA_SB_MSK               (((1U << RF_PU_LNA_SB_LEN) - 1) << RF_PU_LNA_SB_POS)
#define RF_PU_LNA_SB_UMSK              (~(((1U << RF_PU_LNA_SB_LEN) - 1) << RF_PU_LNA_SB_POS))
#define RF_PU_PA_SB                    RF_PU_PA_SB
#define RF_PU_PA_SB_POS                (22U)
#define RF_PU_PA_SB_LEN                (1U)
#define RF_PU_PA_SB_MSK                (((1U << RF_PU_PA_SB_LEN) - 1) << RF_PU_PA_SB_POS)
#define RF_PU_PA_SB_UMSK               (~(((1U << RF_PU_PA_SB_LEN) - 1) << RF_PU_PA_SB_POS))
#define RF_RX_BYPASS_EN_SB             RF_RX_BYPASS_EN_SB
#define RF_RX_BYPASS_EN_SB_POS         (23U)
#define RF_RX_BYPASS_EN_SB_LEN         (1U)
#define RF_RX_BYPASS_EN_SB_MSK         (((1U << RF_RX_BYPASS_EN_SB_LEN) - 1) << RF_RX_BYPASS_EN_SB_POS)
#define RF_RX_BYPASS_EN_SB_UMSK        (~(((1U << RF_RX_BYPASS_EN_SB_LEN) - 1) << RF_RX_BYPASS_EN_SB_POS))
#define RF_PA_SERI_CAP_EN_SB           RF_PA_SERI_CAP_EN_SB
#define RF_PA_SERI_CAP_EN_SB_POS       (24U)
#define RF_PA_SERI_CAP_EN_SB_LEN       (1U)
#define RF_PA_SERI_CAP_EN_SB_MSK       (((1U << RF_PA_SERI_CAP_EN_SB_LEN) - 1) << RF_PA_SERI_CAP_EN_SB_POS)
#define RF_PA_SERI_CAP_EN_SB_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_SB_LEN) - 1) << RF_PA_SERI_CAP_EN_SB_POS))

