bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x108 : Power up in LOTX state */
#define RF_PUCR_LOTX_OFFSET              (0x108)
#define RF_LODIST_TX_EN_LOTX             RF_LODIST_TX_EN_LOTX
#define RF_LODIST_TX_EN_LOTX_POS         (0U)
#define RF_LODIST_TX_EN_LOTX_LEN         (1U)
#define RF_LODIST_TX_EN_LOTX_MSK         (((1U << RF_LODIST_TX_EN_LOTX_LEN) - 1) << RF_LODIST_TX_EN_LOTX_POS)
#define RF_LODIST_TX_EN_LOTX_UMSK        (~(((1U << RF_LODIST_TX_EN_LOTX_LEN) - 1) << RF_LODIST_TX_EN_LOTX_POS))
#define RF_PU_TXBUF_LOTX                 RF_PU_TXBUF_LOTX
#define RF_PU_TXBUF_LOTX_POS             (1U)
#define RF_PU_TXBUF_LOTX_LEN             (1U)
#define RF_PU_TXBUF_LOTX_MSK             (((1U << RF_PU_TXBUF_LOTX_LEN) - 1) << RF_PU_TXBUF_LOTX_POS)
#define RF_PU_TXBUF_LOTX_UMSK            (~(((1U << RF_PU_TXBUF_LOTX_LEN) - 1) << RF_PU_TXBUF_LOTX_POS))
#define RF_PU_RXBUF_LOTX                 RF_PU_RXBUF_LOTX
#define RF_PU_RXBUF_LOTX_POS             (2U)
#define RF_PU_RXBUF_LOTX_LEN             (1U)
#define RF_PU_RXBUF_LOTX_MSK             (((1U << RF_PU_RXBUF_LOTX_LEN) - 1) << RF_PU_RXBUF_LOTX_POS)
#define RF_PU_RXBUF_LOTX_UMSK            (~(((1U << RF_PU_RXBUF_LOTX_LEN) - 1) << RF_PU_RXBUF_LOTX_POS))
#define RF_PU_DTC_LOTX                   RF_PU_DTC_LOTX
#define RF_PU_DTC_LOTX_POS               (3U)
#define RF_PU_DTC_LOTX_LEN               (1U)
#define RF_PU_DTC_LOTX_MSK               (((1U << RF_PU_DTC_LOTX_LEN) - 1) << RF_PU_DTC_LOTX_POS)
#define RF_PU_DTC_LOTX_UMSK              (~(((1U << RF_PU_DTC_LOTX_LEN) - 1) << RF_PU_DTC_LOTX_POS))
#define RF_PU_ADPLL_SFREG_LOTX           RF_PU_ADPLL_SFREG_LOTX
#define RF_PU_ADPLL_SFREG_LOTX_POS       (4U)
#define RF_PU_ADPLL_SFREG_LOTX_LEN       (1U)
#define RF_PU_ADPLL_SFREG_LOTX_MSK       (((1U << RF_PU_ADPLL_SFREG_LOTX_LEN) - 1) << RF_PU_ADPLL_SFREG_LOTX_POS)
#define RF_PU_ADPLL_SFREG_LOTX_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_LOTX_LEN) - 1) << RF_PU_ADPLL_SFREG_LOTX_POS))
#define RF_PU_ADPLL_ADC_LOTX             RF_PU_ADPLL_ADC_LOTX
#define RF_PU_ADPLL_ADC_LOTX_POS         (5U)
#define RF_PU_ADPLL_ADC_LOTX_LEN         (1U)
#define RF_PU_ADPLL_ADC_LOTX_MSK         (((1U << RF_PU_ADPLL_ADC_LOTX_LEN) - 1) << RF_PU_ADPLL_ADC_LOTX_POS)
#define RF_PU_ADPLL_ADC_LOTX_UMSK        (~(((1U << RF_PU_ADPLL_ADC_LOTX_LEN) - 1) << RF_PU_ADPLL_ADC_LOTX_POS))
#define RF_ADPLL_CLK_EN_LOTX             RF_ADPLL_CLK_EN_LOTX
#define RF_ADPLL_CLK_EN_LOTX_POS         (6U)
#define RF_ADPLL_CLK_EN_LOTX_LEN         (1U)
#define RF_ADPLL_CLK_EN_LOTX_MSK         (((1U << RF_ADPLL_CLK_EN_LOTX_LEN) - 1) << RF_ADPLL_CLK_EN_LOTX_POS)
#define RF_ADPLL_CLK_EN_LOTX_UMSK        (~(((1U << RF_ADPLL_CLK_EN_LOTX_LEN) - 1) << RF_ADPLL_CLK_EN_LOTX_POS))
#define RF_LOTPM_HFP_BYPASS_LOTX         RF_LOTPM_HFP_BYPASS_LOTX
#define RF_LOTPM_HFP_BYPASS_LOTX_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_LOTX_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_LOTX_MSK     (((1U << RF_LOTPM_HFP_BYPASS_LOTX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_LOTX_POS)
#define RF_LOTPM_HFP_BYPASS_LOTX_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_LOTX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_LOTX_POS))
#define RF_LOTPM_LFP_BYPASS_LOTX         RF_LOTPM_LFP_BYPASS_LOTX
#define RF_LOTPM_LFP_BYPASS_LOTX_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_LOTX_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_LOTX_MSK     (((1U << RF_LOTPM_LFP_BYPASS_LOTX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_LOTX_POS)
#define RF_LOTPM_LFP_BYPASS_LOTX_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_LOTX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_LOTX_POS))
#define RF_LOTPM_HFP_CLK_EN_LOTX         RF_LOTPM_HFP_CLK_EN_LOTX
#define RF_LOTPM_HFP_CLK_EN_LOTX_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_LOTX_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_LOTX_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_LOTX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_LOTX_POS)
#define RF_LOTPM_HFP_CLK_EN_LOTX_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_LOTX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_LOTX_POS))
#define RF_PU_FBDV_BUF_LOTX              RF_PU_FBDV_BUF_LOTX
#define RF_PU_FBDV_BUF_LOTX_POS          (10U)
#define RF_PU_FBDV_BUF_LOTX_LEN          (1U)
#define RF_PU_FBDV_BUF_LOTX_MSK          (((1U << RF_PU_FBDV_BUF_LOTX_LEN) - 1) << RF_PU_FBDV_BUF_LOTX_POS)
#define RF_PU_FBDV_BUF_LOTX_UMSK         (~(((1U << RF_PU_FBDV_BUF_LOTX_LEN) - 1) << RF_PU_FBDV_BUF_LOTX_POS))
#define RF_PU_FBDV_LOTX                  RF_PU_FBDV_LOTX
#define RF_PU_FBDV_LOTX_POS              (11U)
#define RF_PU_FBDV_LOTX_LEN              (1U)
#define RF_PU_FBDV_LOTX_MSK              (((1U << RF_PU_FBDV_LOTX_LEN) - 1) << RF_PU_FBDV_LOTX_POS)
#define RF_PU_FBDV_LOTX_UMSK             (~(((1U << RF_PU_FBDV_LOTX_LEN) - 1) << RF_PU_FBDV_LOTX_POS))
#define RF_PU_VCO_LOTX                   RF_PU_VCO_LOTX
#define RF_PU_VCO_LOTX_POS               (12U)
#define RF_PU_VCO_LOTX_LEN               (1U)
#define RF_PU_VCO_LOTX_MSK               (((1U << RF_PU_VCO_LOTX_LEN) - 1) << RF_PU_VCO_LOTX_POS)
#define RF_PU_VCO_LOTX_UMSK              (~(((1U << RF_PU_VCO_LOTX_LEN) - 1) << RF_PU_VCO_LOTX_POS))
#define RF_PU_VCO_LDO_LOTX               RF_PU_VCO_LDO_LOTX
#define RF_PU_VCO_LDO_LOTX_POS           (13U)
#define RF_PU_VCO_LDO_LOTX_LEN           (1U)
#define RF_PU_VCO_LDO_LOTX_MSK           (((1U << RF_PU_VCO_LDO_LOTX_LEN) - 1) << RF_PU_VCO_LDO_LOTX_POS)
#define RF_PU_VCO_LDO_LOTX_UMSK          (~(((1U << RF_PU_VCO_LDO_LOTX_LEN) - 1) << RF_PU_VCO_LDO_LOTX_POS))
#define RF_PU_LODIST_BODY_BIAS_LOTX      RF_PU_LODIST_BODY_BIAS_LOTX
#define RF_PU_LODIST_BODY_BIAS_LOTX_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_LOTX_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_LOTX_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_LOTX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_LOTX_POS)
#define RF_PU_LODIST_BODY_BIAS_LOTX_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_LOTX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_LOTX_POS))
#define RF_RXADC_CLK_EN_LOTX             RF_RXADC_CLK_EN_LOTX
#define RF_RXADC_CLK_EN_LOTX_POS         (15U)
#define RF_RXADC_CLK_EN_LOTX_LEN         (1U)
#define RF_RXADC_CLK_EN_LOTX_MSK         (((1U << RF_RXADC_CLK_EN_LOTX_LEN) - 1) << RF_RXADC_CLK_EN_LOTX_POS)
#define RF_RXADC_CLK_EN_LOTX_UMSK        (~(((1U << RF_RXADC_CLK_EN_LOTX_LEN) - 1) << RF_RXADC_CLK_EN_LOTX_POS))
#define RF_PU_RXADC_LOTX                 RF_PU_RXADC_LOTX
#define RF_PU_RXADC_LOTX_POS             (16U)
#define RF_PU_RXADC_LOTX_LEN             (1U)
#define RF_PU_RXADC_LOTX_MSK             (((1U << RF_PU_RXADC_LOTX_LEN) - 1) << RF_PU_RXADC_LOTX_POS)
#define RF_PU_RXADC_LOTX_UMSK            (~(((1U << RF_PU_RXADC_LOTX_LEN) - 1) << RF_PU_RXADC_LOTX_POS))
#define RF_PU_ROSDAC_LOTX                RF_PU_ROSDAC_LOTX
#define RF_PU_ROSDAC_LOTX_POS            (17U)
#define RF_PU_ROSDAC_LOTX_LEN            (1U)
#define RF_PU_ROSDAC_LOTX_MSK            (((1U << RF_PU_ROSDAC_LOTX_LEN) - 1) << RF_PU_ROSDAC_LOTX_POS)
#define RF_PU_ROSDAC_LOTX_UMSK           (~(((1U << RF_PU_ROSDAC_LOTX_LEN) - 1) << RF_PU_ROSDAC_LOTX_POS))
#define RF_PU_RBB_PKDET_LOTX             RF_PU_RBB_PKDET_LOTX
#define RF_PU_RBB_PKDET_LOTX_POS         (18U)
#define RF_PU_RBB_PKDET_LOTX_LEN         (1U)
#define RF_PU_RBB_PKDET_LOTX_MSK         (((1U << RF_PU_RBB_PKDET_LOTX_LEN) - 1) << RF_PU_RBB_PKDET_LOTX_POS)
#define RF_PU_RBB_PKDET_LOTX_UMSK        (~(((1U << RF_PU_RBB_PKDET_LOTX_LEN) - 1) << RF_PU_RBB_PKDET_LOTX_POS))
#define RF_PU_RBB_LOTX                   RF_PU_RBB_LOTX
#define RF_PU_RBB_LOTX_POS               (19U)
#define RF_PU_RBB_LOTX_LEN               (1U)
#define RF_PU_RBB_LOTX_MSK               (((1U << RF_PU_RBB_LOTX_LEN) - 1) << RF_PU_RBB_LOTX_POS)
#define RF_PU_RBB_LOTX_UMSK              (~(((1U << RF_PU_RBB_LOTX_LEN) - 1) << RF_PU_RBB_LOTX_POS))
#define RF_PU_RMX_LOTX                   RF_PU_RMX_LOTX
#define RF_PU_RMX_LOTX_POS               (20U)
#define RF_PU_RMX_LOTX_LEN               (1U)
#define RF_PU_RMX_LOTX_MSK               (((1U << RF_PU_RMX_LOTX_LEN) - 1) << RF_PU_RMX_LOTX_POS)
#define RF_PU_RMX_LOTX_UMSK              (~(((1U << RF_PU_RMX_LOTX_LEN) - 1) << RF_PU_RMX_LOTX_POS))
#define RF_PU_LNA_LOTX                   RF_PU_LNA_LOTX
#define RF_PU_LNA_LOTX_POS               (21U)
#define RF_PU_LNA_LOTX_LEN               (1U)
#define RF_PU_LNA_LOTX_MSK               (((1U << RF_PU_LNA_LOTX_LEN) - 1) << RF_PU_LNA_LOTX_POS)
#define RF_PU_LNA_LOTX_UMSK              (~(((1U << RF_PU_LNA_LOTX_LEN) - 1) << RF_PU_LNA_LOTX_POS))
#define RF_PU_PA_LOTX                    RF_PU_PA_LOTX
#define RF_PU_PA_LOTX_POS                (22U)
#define RF_PU_PA_LOTX_LEN                (1U)
#define RF_PU_PA_LOTX_MSK                (((1U << RF_PU_PA_LOTX_LEN) - 1) << RF_PU_PA_LOTX_POS)
#define RF_PU_PA_LOTX_UMSK               (~(((1U << RF_PU_PA_LOTX_LEN) - 1) << RF_PU_PA_LOTX_POS))
#define RF_RX_BYPASS_EN_LOTX             RF_RX_BYPASS_EN_LOTX
#define RF_RX_BYPASS_EN_LOTX_POS         (23U)
#define RF_RX_BYPASS_EN_LOTX_LEN         (1U)
#define RF_RX_BYPASS_EN_LOTX_MSK         (((1U << RF_RX_BYPASS_EN_LOTX_LEN) - 1) << RF_RX_BYPASS_EN_LOTX_POS)
#define RF_RX_BYPASS_EN_LOTX_UMSK        (~(((1U << RF_RX_BYPASS_EN_LOTX_LEN) - 1) << RF_RX_BYPASS_EN_LOTX_POS))
#define RF_PA_SERI_CAP_EN_LOTX           RF_PA_SERI_CAP_EN_LOTX
#define RF_PA_SERI_CAP_EN_LOTX_POS       (24U)
#define RF_PA_SERI_CAP_EN_LOTX_LEN       (1U)
#define RF_PA_SERI_CAP_EN_LOTX_MSK       (((1U << RF_PA_SERI_CAP_EN_LOTX_LEN) - 1) << RF_PA_SERI_CAP_EN_LOTX_POS)
#define RF_PA_SERI_CAP_EN_LOTX_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_LOTX_LEN) - 1) << RF_PA_SERI_CAP_EN_LOTX_POS))

/* 0x10C : Power up in LORX state */
#define RF_PUCR_LORX_OFFSET              (0x10C)
#define RF_LODIST_TX_EN_LORX             RF_LODIST_TX_EN_LORX
#define RF_LODIST_TX_EN_LORX_POS         (0U)
#define RF_LODIST_TX_EN_LORX_LEN         (1U)
#define RF_LODIST_TX_EN_LORX_MSK         (((1U << RF_LODIST_TX_EN_LORX_LEN) - 1) << RF_LODIST_TX_EN_LORX_POS)
#define RF_LODIST_TX_EN_LORX_UMSK        (~(((1U << RF_LODIST_TX_EN_LORX_LEN) - 1) << RF_LODIST_TX_EN_LORX_POS))
#define RF_PU_TXBUF_LORX                 RF_PU_TXBUF_LORX
#define RF_PU_TXBUF_LORX_POS             (1U)
#define RF_PU_TXBUF_LORX_LEN             (1U)
#define RF_PU_TXBUF_LORX_MSK             (((1U << RF_PU_TXBUF_LORX_LEN) - 1) << RF_PU_TXBUF_LORX_POS)
#define RF_PU_TXBUF_LORX_UMSK            (~(((1U << RF_PU_TXBUF_LORX_LEN) - 1) << RF_PU_TXBUF_LORX_POS))
#define RF_PU_RXBUF_LORX                 RF_PU_RXBUF_LORX
#define RF_PU_RXBUF_LORX_POS             (2U)
#define RF_PU_RXBUF_LORX_LEN             (1U)
#define RF_PU_RXBUF_LORX_MSK             (((1U << RF_PU_RXBUF_LORX_LEN) - 1) << RF_PU_RXBUF_LORX_POS)
#define RF_PU_RXBUF_LORX_UMSK            (~(((1U << RF_PU_RXBUF_LORX_LEN) - 1) << RF_PU_RXBUF_LORX_POS))
#define RF_PU_DTC_LORX                   RF_PU_DTC_LORX
#define RF_PU_DTC_LORX_POS               (3U)
#define RF_PU_DTC_LORX_LEN               (1U)
#define RF_PU_DTC_LORX_MSK               (((1U << RF_PU_DTC_LORX_LEN) - 1) << RF_PU_DTC_LORX_POS)
#define RF_PU_DTC_LORX_UMSK              (~(((1U << RF_PU_DTC_LORX_LEN) - 1) << RF_PU_DTC_LORX_POS))
#define RF_PU_ADPLL_SFREG_LORX           RF_PU_ADPLL_SFREG_LORX
#define RF_PU_ADPLL_SFREG_LORX_POS       (4U)
#define RF_PU_ADPLL_SFREG_LORX_LEN       (1U)
#define RF_PU_ADPLL_SFREG_LORX_MSK       (((1U << RF_PU_ADPLL_SFREG_LORX_LEN) - 1) << RF_PU_ADPLL_SFREG_LORX_POS)
#define RF_PU_ADPLL_SFREG_LORX_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_LORX_LEN) - 1) << RF_PU_ADPLL_SFREG_LORX_POS))
#define RF_PU_ADPLL_ADC_LORX             RF_PU_ADPLL_ADC_LORX
#define RF_PU_ADPLL_ADC_LORX_POS         (5U)
#define RF_PU_ADPLL_ADC_LORX_LEN         (1U)
#define RF_PU_ADPLL_ADC_LORX_MSK         (((1U << RF_PU_ADPLL_ADC_LORX_LEN) - 1) << RF_PU_ADPLL_ADC_LORX_POS)
#define RF_PU_ADPLL_ADC_LORX_UMSK        (~(((1U << RF_PU_ADPLL_ADC_LORX_LEN) - 1) << RF_PU_ADPLL_ADC_LORX_POS))
#define RF_ADPLL_CLK_EN_LORX             RF_ADPLL_CLK_EN_LORX
#define RF_ADPLL_CLK_EN_LORX_POS         (6U)
#define RF_ADPLL_CLK_EN_LORX_LEN         (1U)
#define RF_ADPLL_CLK_EN_LORX_MSK         (((1U << RF_ADPLL_CLK_EN_LORX_LEN) - 1) << RF_ADPLL_CLK_EN_LORX_POS)
#define RF_ADPLL_CLK_EN_LORX_UMSK        (~(((1U << RF_ADPLL_CLK_EN_LORX_LEN) - 1) << RF_ADPLL_CLK_EN_LORX_POS))
#define RF_LOTPM_HFP_BYPASS_LORX         RF_LOTPM_HFP_BYPASS_LORX
#define RF_LOTPM_HFP_BYPASS_LORX_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_LORX_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_LORX_MSK     (((1U << RF_LOTPM_HFP_BYPASS_LORX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_LORX_POS)
#define RF_LOTPM_HFP_BYPASS_LORX_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_LORX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_LORX_POS))
#define RF_LOTPM_LFP_BYPASS_LORX         RF_LOTPM_LFP_BYPASS_LORX
#define RF_LOTPM_LFP_BYPASS_LORX_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_LORX_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_LORX_MSK     (((1U << RF_LOTPM_LFP_BYPASS_LORX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_LORX_POS)
#define RF_LOTPM_LFP_BYPASS_LORX_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_LORX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_LORX_POS))
#define RF_LOTPM_HFP_CLK_EN_LORX         RF_LOTPM_HFP_CLK_EN_LORX
#define RF_LOTPM_HFP_CLK_EN_LORX_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_LORX_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_LORX_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_LORX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_LORX_POS)
#define RF_LOTPM_HFP_CLK_EN_LORX_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_LORX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_LORX_POS))
#define RF_PU_FBDV_BUF_LORX              RF_PU_FBDV_BUF_LORX
#define RF_PU_FBDV_BUF_LORX_POS          (10U)
#define RF_PU_FBDV_BUF_LORX_LEN          (1U)
#define RF_PU_FBDV_BUF_LORX_MSK          (((1U << RF_PU_FBDV_BUF_LORX_LEN) - 1) << RF_PU_FBDV_BUF_LORX_POS)
#define RF_PU_FBDV_BUF_LORX_UMSK         (~(((1U << RF_PU_FBDV_BUF_LORX_LEN) - 1) << RF_PU_FBDV_BUF_LORX_POS))
#define RF_PU_FBDV_LORX                  RF_PU_FBDV_LORX
#define RF_PU_FBDV_LORX_POS              (11U)
#define RF_PU_FBDV_LORX_LEN              (1U)
#define RF_PU_FBDV_LORX_MSK              (((1U << RF_PU_FBDV_LORX_LEN) - 1) << RF_PU_FBDV_LORX_POS)
#define RF_PU_FBDV_LORX_UMSK             (~(((1U << RF_PU_FBDV_LORX_LEN) - 1) << RF_PU_FBDV_LORX_POS))
#define RF_PU_VCO_LORX                   RF_PU_VCO_LORX
#define RF_PU_VCO_LORX_POS               (12U)
#define RF_PU_VCO_LORX_LEN               (1U)
#define RF_PU_VCO_LORX_MSK               (((1U << RF_PU_VCO_LORX_LEN) - 1) << RF_PU_VCO_LORX_POS)
#define RF_PU_VCO_LORX_UMSK              (~(((1U << RF_PU_VCO_LORX_LEN) - 1) << RF_PU_VCO_LORX_POS))
#define RF_PU_VCO_LDO_LORX               RF_PU_VCO_LDO_LORX
#define RF_PU_VCO_LDO_LORX_POS           (13U)
#define RF_PU_VCO_LDO_LORX_LEN           (1U)
#define RF_PU_VCO_LDO_LORX_MSK           (((1U << RF_PU_VCO_LDO_LORX_LEN) - 1) << RF_PU_VCO_LDO_LORX_POS)
#define RF_PU_VCO_LDO_LORX_UMSK          (~(((1U << RF_PU_VCO_LDO_LORX_LEN) - 1) << RF_PU_VCO_LDO_LORX_POS))
#define RF_PU_LODIST_BODY_BIAS_LORX      RF_PU_LODIST_BODY_BIAS_LORX
#define RF_PU_LODIST_BODY_BIAS_LORX_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_LORX_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_LORX_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_LORX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_LORX_POS)
#define RF_PU_LODIST_BODY_BIAS_LORX_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_LORX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_LORX_POS))
#define RF_RXADC_CLK_EN_LORX             RF_RXADC_CLK_EN_LORX
#define RF_RXADC_CLK_EN_LORX_POS         (15U)
#define RF_RXADC_CLK_EN_LORX_LEN         (1U)
#define RF_RXADC_CLK_EN_LORX_MSK         (((1U << RF_RXADC_CLK_EN_LORX_LEN) - 1) << RF_RXADC_CLK_EN_LORX_POS)
#define RF_RXADC_CLK_EN_LORX_UMSK        (~(((1U << RF_RXADC_CLK_EN_LORX_LEN) - 1) << RF_RXADC_CLK_EN_LORX_POS))
#define RF_PU_RXADC_LORX                 RF_PU_RXADC_LORX
#define RF_PU_RXADC_LORX_POS             (16U)
#define RF_PU_RXADC_LORX_LEN             (1U)
#define RF_PU_RXADC_LORX_MSK             (((1U << RF_PU_RXADC_LORX_LEN) - 1) << RF_PU_RXADC_LORX_POS)
#define RF_PU_RXADC_LORX_UMSK            (~(((1U << RF_PU_RXADC_LORX_LEN) - 1) << RF_PU_RXADC_LORX_POS))
#define RF_PU_ROSDAC_LORX                RF_PU_ROSDAC_LORX
#define RF_PU_ROSDAC_LORX_POS            (17U)
#define RF_PU_ROSDAC_LORX_LEN            (1U)
#define RF_PU_ROSDAC_LORX_MSK            (((1U << RF_PU_ROSDAC_LORX_LEN) - 1) << RF_PU_ROSDAC_LORX_POS)
#define RF_PU_ROSDAC_LORX_UMSK           (~(((1U << RF_PU_ROSDAC_LORX_LEN) - 1) << RF_PU_ROSDAC_LORX_POS))
#define RF_PU_RBB_PKDET_LORX             RF_PU_RBB_PKDET_LORX
#define RF_PU_RBB_PKDET_LORX_POS         (18U)
#define RF_PU_RBB_PKDET_LORX_LEN         (1U)
#define RF_PU_RBB_PKDET_LORX_MSK         (((1U << RF_PU_RBB_PKDET_LORX_LEN) - 1) << RF_PU_RBB_PKDET_LORX_POS)
#define RF_PU_RBB_PKDET_LORX_UMSK        (~(((1U << RF_PU_RBB_PKDET_LORX_LEN) - 1) << RF_PU_RBB_PKDET_LORX_POS))
#define RF_PU_RBB_LORX                   RF_PU_RBB_LORX
#define RF_PU_RBB_LORX_POS               (19U)
#define RF_PU_RBB_LORX_LEN               (1U)
#define RF_PU_RBB_LORX_MSK               (((1U << RF_PU_RBB_LORX_LEN) - 1) << RF_PU_RBB_LORX_POS)
#define RF_PU_RBB_LORX_UMSK              (~(((1U << RF_PU_RBB_LORX_LEN) - 1) << RF_PU_RBB_LORX_POS))
#define RF_PU_RMX_LORX                   RF_PU_RMX_LORX
#define RF_PU_RMX_LORX_POS               (20U)
#define RF_PU_RMX_LORX_LEN               (1U)
#define RF_PU_RMX_LORX_MSK               (((1U << RF_PU_RMX_LORX_LEN) - 1) << RF_PU_RMX_LORX_POS)
#define RF_PU_RMX_LORX_UMSK              (~(((1U << RF_PU_RMX_LORX_LEN) - 1) << RF_PU_RMX_LORX_POS))
#define RF_PU_LNA_LORX                   RF_PU_LNA_LORX
#define RF_PU_LNA_LORX_POS               (21U)
#define RF_PU_LNA_LORX_LEN               (1U)
#define RF_PU_LNA_LORX_MSK               (((1U << RF_PU_LNA_LORX_LEN) - 1) << RF_PU_LNA_LORX_POS)
#define RF_PU_LNA_LORX_UMSK              (~(((1U << RF_PU_LNA_LORX_LEN) - 1) << RF_PU_LNA_LORX_POS))
#define RF_PU_PA_LORX                    RF_PU_PA_LORX
#define RF_PU_PA_LORX_POS                (22U)
#define RF_PU_PA_LORX_LEN                (1U)
#define RF_PU_PA_LORX_MSK                (((1U << RF_PU_PA_LORX_LEN) - 1) << RF_PU_PA_LORX_POS)
#define RF_PU_PA_LORX_UMSK               (~(((1U << RF_PU_PA_LORX_LEN) - 1) << RF_PU_PA_LORX_POS))
#define RF_RX_BYPASS_EN_LORX             RF_RX_BYPASS_EN_LORX
#define RF_RX_BYPASS_EN_LORX_POS         (23U)
#define RF_RX_BYPASS_EN_LORX_LEN         (1U)
#define RF_RX_BYPASS_EN_LORX_MSK         (((1U << RF_RX_BYPASS_EN_LORX_LEN) - 1) << RF_RX_BYPASS_EN_LORX_POS)
#define RF_RX_BYPASS_EN_LORX_UMSK        (~(((1U << RF_RX_BYPASS_EN_LORX_LEN) - 1) << RF_RX_BYPASS_EN_LORX_POS))
#define RF_PA_SERI_CAP_EN_LORX           RF_PA_SERI_CAP_EN_LORX
#define RF_PA_SERI_CAP_EN_LORX_POS       (24U)
#define RF_PA_SERI_CAP_EN_LORX_LEN       (1U)
#define RF_PA_SERI_CAP_EN_LORX_MSK       (((1U << RF_PA_SERI_CAP_EN_LORX_LEN) - 1) << RF_PA_SERI_CAP_EN_LORX_POS)
#define RF_PA_SERI_CAP_EN_LORX_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_LORX_LEN) - 1) << RF_PA_SERI_CAP_EN_LORX_POS))

