bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x110 : Power up in TX state */
#define RF_PUCR_TX_OFFSET              (0x110)
#define RF_LODIST_TX_EN_TX             RF_LODIST_TX_EN_TX
#define RF_LODIST_TX_EN_TX_POS         (0U)
#define RF_LODIST_TX_EN_TX_LEN         (1U)
#define RF_LODIST_TX_EN_TX_MSK         (((1U << RF_LODIST_TX_EN_TX_LEN) - 1) << RF_LODIST_TX_EN_TX_POS)
#define RF_LODIST_TX_EN_TX_UMSK        (~(((1U << RF_LODIST_TX_EN_TX_LEN) - 1) << RF_LODIST_TX_EN_TX_POS))
#define RF_PU_TXBUF_TX                 RF_PU_TXBUF_TX
#define RF_PU_TXBUF_TX_POS             (1U)
#define RF_PU_TXBUF_TX_LEN             (1U)
#define RF_PU_TXBUF_TX_MSK             (((1U << RF_PU_TXBUF_TX_LEN) - 1) << RF_PU_TXBUF_TX_POS)
#define RF_PU_TXBUF_TX_UMSK            (~(((1U << RF_PU_TXBUF_TX_LEN) - 1) << RF_PU_TXBUF_TX_POS))
#define RF_PU_RXBUF_TX                 RF_PU_RXBUF_TX
#define RF_PU_RXBUF_TX_POS             (2U)
#define RF_PU_RXBUF_TX_LEN             (1U)
#define RF_PU_RXBUF_TX_MSK             (((1U << RF_PU_RXBUF_TX_LEN) - 1) << RF_PU_RXBUF_TX_POS)
#define RF_PU_RXBUF_TX_UMSK            (~(((1U << RF_PU_RXBUF_TX_LEN) - 1) << RF_PU_RXBUF_TX_POS))
#define RF_PU_DTC_TX                   RF_PU_DTC_TX
#define RF_PU_DTC_TX_POS               (3U)
#define RF_PU_DTC_TX_LEN               (1U)
#define RF_PU_DTC_TX_MSK               (((1U << RF_PU_DTC_TX_LEN) - 1) << RF_PU_DTC_TX_POS)
#define RF_PU_DTC_TX_UMSK              (~(((1U << RF_PU_DTC_TX_LEN) - 1) << RF_PU_DTC_TX_POS))
#define RF_PU_ADPLL_SFREG_TX           RF_PU_ADPLL_SFREG_TX
#define RF_PU_ADPLL_SFREG_TX_POS       (4U)
#define RF_PU_ADPLL_SFREG_TX_LEN       (1U)
#define RF_PU_ADPLL_SFREG_TX_MSK       (((1U << RF_PU_ADPLL_SFREG_TX_LEN) - 1) << RF_PU_ADPLL_SFREG_TX_POS)
#define RF_PU_ADPLL_SFREG_TX_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_TX_LEN) - 1) << RF_PU_ADPLL_SFREG_TX_POS))
#define RF_PU_ADPLL_ADC_TX             RF_PU_ADPLL_ADC_TX
#define RF_PU_ADPLL_ADC_TX_POS         (5U)
#define RF_PU_ADPLL_ADC_TX_LEN         (1U)
#define RF_PU_ADPLL_ADC_TX_MSK         (((1U << RF_PU_ADPLL_ADC_TX_LEN) - 1) << RF_PU_ADPLL_ADC_TX_POS)
#define RF_PU_ADPLL_ADC_TX_UMSK        (~(((1U << RF_PU_ADPLL_ADC_TX_LEN) - 1) << RF_PU_ADPLL_ADC_TX_POS))
#define RF_ADPLL_CLK_EN_TX             RF_ADPLL_CLK_EN_TX
#define RF_ADPLL_CLK_EN_TX_POS         (6U)
#define RF_ADPLL_CLK_EN_TX_LEN         (1U)
#define RF_ADPLL_CLK_EN_TX_MSK         (((1U << RF_ADPLL_CLK_EN_TX_LEN) - 1) << RF_ADPLL_CLK_EN_TX_POS)
#define RF_ADPLL_CLK_EN_TX_UMSK        (~(((1U << RF_ADPLL_CLK_EN_TX_LEN) - 1) << RF_ADPLL_CLK_EN_TX_POS))
#define RF_LOTPM_HFP_BYPASS_TX         RF_LOTPM_HFP_BYPASS_TX
#define RF_LOTPM_HFP_BYPASS_TX_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_TX_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_TX_MSK     (((1U << RF_LOTPM_HFP_BYPASS_TX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_TX_POS)
#define RF_LOTPM_HFP_BYPASS_TX_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_TX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_TX_POS))
#define RF_LOTPM_LFP_BYPASS_TX         RF_LOTPM_LFP_BYPASS_TX
#define RF_LOTPM_LFP_BYPASS_TX_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_TX_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_TX_MSK     (((1U << RF_LOTPM_LFP_BYPASS_TX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_TX_POS)
#define RF_LOTPM_LFP_BYPASS_TX_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_TX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_TX_POS))
#define RF_LOTPM_HFP_CLK_EN_TX         RF_LOTPM_HFP_CLK_EN_TX
#define RF_LOTPM_HFP_CLK_EN_TX_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_TX_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_TX_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_TX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_TX_POS)
#define RF_LOTPM_HFP_CLK_EN_TX_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_TX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_TX_POS))
#define RF_PU_FBDV_BUF_TX              RF_PU_FBDV_BUF_TX
#define RF_PU_FBDV_BUF_TX_POS          (10U)
#define RF_PU_FBDV_BUF_TX_LEN          (1U)
#define RF_PU_FBDV_BUF_TX_MSK          (((1U << RF_PU_FBDV_BUF_TX_LEN) - 1) << RF_PU_FBDV_BUF_TX_POS)
#define RF_PU_FBDV_BUF_TX_UMSK         (~(((1U << RF_PU_FBDV_BUF_TX_LEN) - 1) << RF_PU_FBDV_BUF_TX_POS))
#define RF_PU_FBDV_TX                  RF_PU_FBDV_TX
#define RF_PU_FBDV_TX_POS              (11U)
#define RF_PU_FBDV_TX_LEN              (1U)
#define RF_PU_FBDV_TX_MSK              (((1U << RF_PU_FBDV_TX_LEN) - 1) << RF_PU_FBDV_TX_POS)
#define RF_PU_FBDV_TX_UMSK             (~(((1U << RF_PU_FBDV_TX_LEN) - 1) << RF_PU_FBDV_TX_POS))
#define RF_PU_VCO_TX                   RF_PU_VCO_TX
#define RF_PU_VCO_TX_POS               (12U)
#define RF_PU_VCO_TX_LEN               (1U)
#define RF_PU_VCO_TX_MSK               (((1U << RF_PU_VCO_TX_LEN) - 1) << RF_PU_VCO_TX_POS)
#define RF_PU_VCO_TX_UMSK              (~(((1U << RF_PU_VCO_TX_LEN) - 1) << RF_PU_VCO_TX_POS))
#define RF_PU_VCO_LDO_TX               RF_PU_VCO_LDO_TX
#define RF_PU_VCO_LDO_TX_POS           (13U)
#define RF_PU_VCO_LDO_TX_LEN           (1U)
#define RF_PU_VCO_LDO_TX_MSK           (((1U << RF_PU_VCO_LDO_TX_LEN) - 1) << RF_PU_VCO_LDO_TX_POS)
#define RF_PU_VCO_LDO_TX_UMSK          (~(((1U << RF_PU_VCO_LDO_TX_LEN) - 1) << RF_PU_VCO_LDO_TX_POS))
#define RF_PU_LODIST_BODY_BIAS_TX      RF_PU_LODIST_BODY_BIAS_TX
#define RF_PU_LODIST_BODY_BIAS_TX_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_TX_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_TX_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_TX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_TX_POS)
#define RF_PU_LODIST_BODY_BIAS_TX_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_TX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_TX_POS))
#define RF_RXADC_CLK_EN_TX             RF_RXADC_CLK_EN_TX
#define RF_RXADC_CLK_EN_TX_POS         (15U)
#define RF_RXADC_CLK_EN_TX_LEN         (1U)
#define RF_RXADC_CLK_EN_TX_MSK         (((1U << RF_RXADC_CLK_EN_TX_LEN) - 1) << RF_RXADC_CLK_EN_TX_POS)
#define RF_RXADC_CLK_EN_TX_UMSK        (~(((1U << RF_RXADC_CLK_EN_TX_LEN) - 1) << RF_RXADC_CLK_EN_TX_POS))
#define RF_PU_RXADC_TX                 RF_PU_RXADC_TX
#define RF_PU_RXADC_TX_POS             (16U)
#define RF_PU_RXADC_TX_LEN             (1U)
#define RF_PU_RXADC_TX_MSK             (((1U << RF_PU_RXADC_TX_LEN) - 1) << RF_PU_RXADC_TX_POS)
#define RF_PU_RXADC_TX_UMSK            (~(((1U << RF_PU_RXADC_TX_LEN) - 1) << RF_PU_RXADC_TX_POS))
#define RF_PU_ROSDAC_TX                RF_PU_ROSDAC_TX
#define RF_PU_ROSDAC_TX_POS            (17U)
#define RF_PU_ROSDAC_TX_LEN            (1U)
#define RF_PU_ROSDAC_TX_MSK            (((1U << RF_PU_ROSDAC_TX_LEN) - 1) << RF_PU_ROSDAC_TX_POS)
#define RF_PU_ROSDAC_TX_UMSK           (~(((1U << RF_PU_ROSDAC_TX_LEN) - 1) << RF_PU_ROSDAC_TX_POS))
#define RF_PU_RBB_PKDET_TX             RF_PU_RBB_PKDET_TX
#define RF_PU_RBB_PKDET_TX_POS         (18U)
#define RF_PU_RBB_PKDET_TX_LEN         (1U)
#define RF_PU_RBB_PKDET_TX_MSK         (((1U << RF_PU_RBB_PKDET_TX_LEN) - 1) << RF_PU_RBB_PKDET_TX_POS)
#define RF_PU_RBB_PKDET_TX_UMSK        (~(((1U << RF_PU_RBB_PKDET_TX_LEN) - 1) << RF_PU_RBB_PKDET_TX_POS))
#define RF_PU_RBB_TX                   RF_PU_RBB_TX
#define RF_PU_RBB_TX_POS               (19U)
#define RF_PU_RBB_TX_LEN               (1U)
#define RF_PU_RBB_TX_MSK               (((1U << RF_PU_RBB_TX_LEN) - 1) << RF_PU_RBB_TX_POS)
#define RF_PU_RBB_TX_UMSK              (~(((1U << RF_PU_RBB_TX_LEN) - 1) << RF_PU_RBB_TX_POS))
#define RF_PU_RMX_TX                   RF_PU_RMX_TX
#define RF_PU_RMX_TX_POS               (20U)
#define RF_PU_RMX_TX_LEN               (1U)
#define RF_PU_RMX_TX_MSK               (((1U << RF_PU_RMX_TX_LEN) - 1) << RF_PU_RMX_TX_POS)
#define RF_PU_RMX_TX_UMSK              (~(((1U << RF_PU_RMX_TX_LEN) - 1) << RF_PU_RMX_TX_POS))
#define RF_PU_LNA_TX                   RF_PU_LNA_TX
#define RF_PU_LNA_TX_POS               (21U)
#define RF_PU_LNA_TX_LEN               (1U)
#define RF_PU_LNA_TX_MSK               (((1U << RF_PU_LNA_TX_LEN) - 1) << RF_PU_LNA_TX_POS)
#define RF_PU_LNA_TX_UMSK              (~(((1U << RF_PU_LNA_TX_LEN) - 1) << RF_PU_LNA_TX_POS))
#define RF_PU_PA_TX                    RF_PU_PA_TX
#define RF_PU_PA_TX_POS                (22U)
#define RF_PU_PA_TX_LEN                (1U)
#define RF_PU_PA_TX_MSK                (((1U << RF_PU_PA_TX_LEN) - 1) << RF_PU_PA_TX_POS)
#define RF_PU_PA_TX_UMSK               (~(((1U << RF_PU_PA_TX_LEN) - 1) << RF_PU_PA_TX_POS))
#define RF_RX_BYPASS_EN_TX             RF_RX_BYPASS_EN_TX
#define RF_RX_BYPASS_EN_TX_POS         (23U)
#define RF_RX_BYPASS_EN_TX_LEN         (1U)
#define RF_RX_BYPASS_EN_TX_MSK         (((1U << RF_RX_BYPASS_EN_TX_LEN) - 1) << RF_RX_BYPASS_EN_TX_POS)
#define RF_RX_BYPASS_EN_TX_UMSK        (~(((1U << RF_RX_BYPASS_EN_TX_LEN) - 1) << RF_RX_BYPASS_EN_TX_POS))
#define RF_PA_SERI_CAP_EN_TX           RF_PA_SERI_CAP_EN_TX
#define RF_PA_SERI_CAP_EN_TX_POS       (24U)
#define RF_PA_SERI_CAP_EN_TX_LEN       (1U)
#define RF_PA_SERI_CAP_EN_TX_MSK       (((1U << RF_PA_SERI_CAP_EN_TX_LEN) - 1) << RF_PA_SERI_CAP_EN_TX_POS)
#define RF_PA_SERI_CAP_EN_TX_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_TX_LEN) - 1) << RF_PA_SERI_CAP_EN_TX_POS))

