bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x114 : Power up in RX state */
#define RF_PUCR_RX_OFFSET              (0x114)
#define RF_LODIST_TX_EN_RX             RF_LODIST_TX_EN_RX
#define RF_LODIST_TX_EN_RX_POS         (0U)
#define RF_LODIST_TX_EN_RX_LEN         (1U)
#define RF_LODIST_TX_EN_RX_MSK         (((1U << RF_LODIST_TX_EN_RX_LEN) - 1) << RF_LODIST_TX_EN_RX_POS)
#define RF_LODIST_TX_EN_RX_UMSK        (~(((1U << RF_LODIST_TX_EN_RX_LEN) - 1) << RF_LODIST_TX_EN_RX_POS))
#define RF_PU_TXBUF_RX                 RF_PU_TXBUF_RX
#define RF_PU_TXBUF_RX_POS             (1U)
#define RF_PU_TXBUF_RX_LEN             (1U)
#define RF_PU_TXBUF_RX_MSK             (((1U << RF_PU_TXBUF_RX_LEN) - 1) << RF_PU_TXBUF_RX_POS)
#define RF_PU_TXBUF_RX_UMSK            (~(((1U << RF_PU_TXBUF_RX_LEN) - 1) << RF_PU_TXBUF_RX_POS))
#define RF_PU_RXBUF_RX                 RF_PU_RXBUF_RX
#define RF_PU_RXBUF_RX_POS             (2U)
#define RF_PU_RXBUF_RX_LEN             (1U)
#define RF_PU_RXBUF_RX_MSK             (((1U << RF_PU_RXBUF_RX_LEN) - 1) << RF_PU_RXBUF_RX_POS)
#define RF_PU_RXBUF_RX_UMSK            (~(((1U << RF_PU_RXBUF_RX_LEN) - 1) << RF_PU_RXBUF_RX_POS))
#define RF_PU_DTC_RX                   RF_PU_DTC_RX
#define RF_PU_DTC_RX_POS               (3U)
#define RF_PU_DTC_RX_LEN               (1U)
#define RF_PU_DTC_RX_MSK               (((1U << RF_PU_DTC_RX_LEN) - 1) << RF_PU_DTC_RX_POS)
#define RF_PU_DTC_RX_UMSK              (~(((1U << RF_PU_DTC_RX_LEN) - 1) << RF_PU_DTC_RX_POS))
#define RF_PU_ADPLL_SFREG_RX           RF_PU_ADPLL_SFREG_RX
#define RF_PU_ADPLL_SFREG_RX_POS       (4U)
#define RF_PU_ADPLL_SFREG_RX_LEN       (1U)
#define RF_PU_ADPLL_SFREG_RX_MSK       (((1U << RF_PU_ADPLL_SFREG_RX_LEN) - 1) << RF_PU_ADPLL_SFREG_RX_POS)
#define RF_PU_ADPLL_SFREG_RX_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_RX_LEN) - 1) << RF_PU_ADPLL_SFREG_RX_POS))
#define RF_PU_ADPLL_ADC_RX             RF_PU_ADPLL_ADC_RX
#define RF_PU_ADPLL_ADC_RX_POS         (5U)
#define RF_PU_ADPLL_ADC_RX_LEN         (1U)
#define RF_PU_ADPLL_ADC_RX_MSK         (((1U << RF_PU_ADPLL_ADC_RX_LEN) - 1) << RF_PU_ADPLL_ADC_RX_POS)
#define RF_PU_ADPLL_ADC_RX_UMSK        (~(((1U << RF_PU_ADPLL_ADC_RX_LEN) - 1) << RF_PU_ADPLL_ADC_RX_POS))
#define RF_ADPLL_CLK_EN_RX             RF_ADPLL_CLK_EN_RX
#define RF_ADPLL_CLK_EN_RX_POS         (6U)
#define RF_ADPLL_CLK_EN_RX_LEN         (1U)
#define RF_ADPLL_CLK_EN_RX_MSK         (((1U << RF_ADPLL_CLK_EN_RX_LEN) - 1) << RF_ADPLL_CLK_EN_RX_POS)
#define RF_ADPLL_CLK_EN_RX_UMSK        (~(((1U << RF_ADPLL_CLK_EN_RX_LEN) - 1) << RF_ADPLL_CLK_EN_RX_POS))
#define RF_LOTPM_HFP_BYPASS_RX         RF_LOTPM_HFP_BYPASS_RX
#define RF_LOTPM_HFP_BYPASS_RX_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_RX_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_RX_MSK     (((1U << RF_LOTPM_HFP_BYPASS_RX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_RX_POS)
#define RF_LOTPM_HFP_BYPASS_RX_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_RX_LEN) - 1) << RF_LOTPM_HFP_BYPASS_RX_POS))
#define RF_LOTPM_LFP_BYPASS_RX         RF_LOTPM_LFP_BYPASS_RX
#define RF_LOTPM_LFP_BYPASS_RX_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_RX_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_RX_MSK     (((1U << RF_LOTPM_LFP_BYPASS_RX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_RX_POS)
#define RF_LOTPM_LFP_BYPASS_RX_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_RX_LEN) - 1) << RF_LOTPM_LFP_BYPASS_RX_POS))
#define RF_LOTPM_HFP_CLK_EN_RX         RF_LOTPM_HFP_CLK_EN_RX
#define RF_LOTPM_HFP_CLK_EN_RX_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_RX_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_RX_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_RX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_RX_POS)
#define RF_LOTPM_HFP_CLK_EN_RX_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_RX_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_RX_POS))
#define RF_PU_FBDV_BUF_RX              RF_PU_FBDV_BUF_RX
#define RF_PU_FBDV_BUF_RX_POS          (10U)
#define RF_PU_FBDV_BUF_RX_LEN          (1U)
#define RF_PU_FBDV_BUF_RX_MSK          (((1U << RF_PU_FBDV_BUF_RX_LEN) - 1) << RF_PU_FBDV_BUF_RX_POS)
#define RF_PU_FBDV_BUF_RX_UMSK         (~(((1U << RF_PU_FBDV_BUF_RX_LEN) - 1) << RF_PU_FBDV_BUF_RX_POS))
#define RF_PU_FBDV_RX                  RF_PU_FBDV_RX
#define RF_PU_FBDV_RX_POS              (11U)
#define RF_PU_FBDV_RX_LEN              (1U)
#define RF_PU_FBDV_RX_MSK              (((1U << RF_PU_FBDV_RX_LEN) - 1) << RF_PU_FBDV_RX_POS)
#define RF_PU_FBDV_RX_UMSK             (~(((1U << RF_PU_FBDV_RX_LEN) - 1) << RF_PU_FBDV_RX_POS))
#define RF_PU_VCO_RX                   RF_PU_VCO_RX
#define RF_PU_VCO_RX_POS               (12U)
#define RF_PU_VCO_RX_LEN               (1U)
#define RF_PU_VCO_RX_MSK               (((1U << RF_PU_VCO_RX_LEN) - 1) << RF_PU_VCO_RX_POS)
#define RF_PU_VCO_RX_UMSK              (~(((1U << RF_PU_VCO_RX_LEN) - 1) << RF_PU_VCO_RX_POS))
#define RF_PU_VCO_LDO_RX               RF_PU_VCO_LDO_RX
#define RF_PU_VCO_LDO_RX_POS           (13U)
#define RF_PU_VCO_LDO_RX_LEN           (1U)
#define RF_PU_VCO_LDO_RX_MSK           (((1U << RF_PU_VCO_LDO_RX_LEN) - 1) << RF_PU_VCO_LDO_RX_POS)
#define RF_PU_VCO_LDO_RX_UMSK          (~(((1U << RF_PU_VCO_LDO_RX_LEN) - 1) << RF_PU_VCO_LDO_RX_POS))
#define RF_PU_LODIST_BODY_BIAS_RX      RF_PU_LODIST_BODY_BIAS_RX
#define RF_PU_LODIST_BODY_BIAS_RX_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_RX_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_RX_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_RX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_RX_POS)
#define RF_PU_LODIST_BODY_BIAS_RX_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_RX_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_RX_POS))
#define RF_RXADC_CLK_EN_RX             RF_RXADC_CLK_EN_RX
#define RF_RXADC_CLK_EN_RX_POS         (15U)
#define RF_RXADC_CLK_EN_RX_LEN         (1U)
#define RF_RXADC_CLK_EN_RX_MSK         (((1U << RF_RXADC_CLK_EN_RX_LEN) - 1) << RF_RXADC_CLK_EN_RX_POS)
#define RF_RXADC_CLK_EN_RX_UMSK        (~(((1U << RF_RXADC_CLK_EN_RX_LEN) - 1) << RF_RXADC_CLK_EN_RX_POS))
#define RF_PU_RXADC_RX                 RF_PU_RXADC_RX
#define RF_PU_RXADC_RX_POS             (16U)
#define RF_PU_RXADC_RX_LEN             (1U)
#define RF_PU_RXADC_RX_MSK             (((1U << RF_PU_RXADC_RX_LEN) - 1) << RF_PU_RXADC_RX_POS)
#define RF_PU_RXADC_RX_UMSK            (~(((1U << RF_PU_RXADC_RX_LEN) - 1) << RF_PU_RXADC_RX_POS))
#define RF_PU_ROSDAC_RX                RF_PU_ROSDAC_RX
#define RF_PU_ROSDAC_RX_POS            (17U)
#define RF_PU_ROSDAC_RX_LEN            (1U)
#define RF_PU_ROSDAC_RX_MSK            (((1U << RF_PU_ROSDAC_RX_LEN) - 1) << RF_PU_ROSDAC_RX_POS)
#define RF_PU_ROSDAC_RX_UMSK           (~(((1U << RF_PU_ROSDAC_RX_LEN) - 1) << RF_PU_ROSDAC_RX_POS))
#define RF_PU_RBB_PKDET_RX             RF_PU_RBB_PKDET_RX
#define RF_PU_RBB_PKDET_RX_POS         (18U)
#define RF_PU_RBB_PKDET_RX_LEN         (1U)
#define RF_PU_RBB_PKDET_RX_MSK         (((1U << RF_PU_RBB_PKDET_RX_LEN) - 1) << RF_PU_RBB_PKDET_RX_POS)
#define RF_PU_RBB_PKDET_RX_UMSK        (~(((1U << RF_PU_RBB_PKDET_RX_LEN) - 1) << RF_PU_RBB_PKDET_RX_POS))
#define RF_PU_RBB_RX                   RF_PU_RBB_RX
#define RF_PU_RBB_RX_POS               (19U)
#define RF_PU_RBB_RX_LEN               (1U)
#define RF_PU_RBB_RX_MSK               (((1U << RF_PU_RBB_RX_LEN) - 1) << RF_PU_RBB_RX_POS)
#define RF_PU_RBB_RX_UMSK              (~(((1U << RF_PU_RBB_RX_LEN) - 1) << RF_PU_RBB_RX_POS))
#define RF_PU_RMX_RX                   RF_PU_RMX_RX
#define RF_PU_RMX_RX_POS               (20U)
#define RF_PU_RMX_RX_LEN               (1U)
#define RF_PU_RMX_RX_MSK               (((1U << RF_PU_RMX_RX_LEN) - 1) << RF_PU_RMX_RX_POS)
#define RF_PU_RMX_RX_UMSK              (~(((1U << RF_PU_RMX_RX_LEN) - 1) << RF_PU_RMX_RX_POS))
#define RF_PU_LNA_RX                   RF_PU_LNA_RX
#define RF_PU_LNA_RX_POS               (21U)
#define RF_PU_LNA_RX_LEN               (1U)
#define RF_PU_LNA_RX_MSK               (((1U << RF_PU_LNA_RX_LEN) - 1) << RF_PU_LNA_RX_POS)
#define RF_PU_LNA_RX_UMSK              (~(((1U << RF_PU_LNA_RX_LEN) - 1) << RF_PU_LNA_RX_POS))
#define RF_PU_PA_RX                    RF_PU_PA_RX
#define RF_PU_PA_RX_POS                (22U)
#define RF_PU_PA_RX_LEN                (1U)
#define RF_PU_PA_RX_MSK                (((1U << RF_PU_PA_RX_LEN) - 1) << RF_PU_PA_RX_POS)
#define RF_PU_PA_RX_UMSK               (~(((1U << RF_PU_PA_RX_LEN) - 1) << RF_PU_PA_RX_POS))
#define RF_RX_BYPASS_EN_RX             RF_RX_BYPASS_EN_RX
#define RF_RX_BYPASS_EN_RX_POS         (23U)
#define RF_RX_BYPASS_EN_RX_LEN         (1U)
#define RF_RX_BYPASS_EN_RX_MSK         (((1U << RF_RX_BYPASS_EN_RX_LEN) - 1) << RF_RX_BYPASS_EN_RX_POS)
#define RF_RX_BYPASS_EN_RX_UMSK        (~(((1U << RF_RX_BYPASS_EN_RX_LEN) - 1) << RF_RX_BYPASS_EN_RX_POS))
#define RF_PA_SERI_CAP_EN_RX           RF_PA_SERI_CAP_EN_RX
#define RF_PA_SERI_CAP_EN_RX_POS       (24U)
#define RF_PA_SERI_CAP_EN_RX_LEN       (1U)
#define RF_PA_SERI_CAP_EN_RX_MSK       (((1U << RF_PA_SERI_CAP_EN_RX_LEN) - 1) << RF_PA_SERI_CAP_EN_RX_POS)
#define RF_PA_SERI_CAP_EN_RX_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_RX_LEN) - 1) << RF_PA_SERI_CAP_EN_RX_POS))

/* 0x118 : Hardware read back of power up signals */
#define RF_PUCR_HW_OFFSET              (0x118)
#define RF_LODIST_TX_EN_HW             RF_LODIST_TX_EN_HW
#define RF_LODIST_TX_EN_HW_POS         (0U)
#define RF_LODIST_TX_EN_HW_LEN         (1U)
#define RF_LODIST_TX_EN_HW_MSK         (((1U << RF_LODIST_TX_EN_HW_LEN) - 1) << RF_LODIST_TX_EN_HW_POS)
#define RF_LODIST_TX_EN_HW_UMSK        (~(((1U << RF_LODIST_TX_EN_HW_LEN) - 1) << RF_LODIST_TX_EN_HW_POS))
#define RF_PU_TXBUF_HW                 RF_PU_TXBUF_HW
#define RF_PU_TXBUF_HW_POS             (1U)
#define RF_PU_TXBUF_HW_LEN             (1U)
#define RF_PU_TXBUF_HW_MSK             (((1U << RF_PU_TXBUF_HW_LEN) - 1) << RF_PU_TXBUF_HW_POS)
#define RF_PU_TXBUF_HW_UMSK            (~(((1U << RF_PU_TXBUF_HW_LEN) - 1) << RF_PU_TXBUF_HW_POS))
#define RF_PU_RXBUF_HW                 RF_PU_RXBUF_HW
#define RF_PU_RXBUF_HW_POS             (2U)
#define RF_PU_RXBUF_HW_LEN             (1U)
#define RF_PU_RXBUF_HW_MSK             (((1U << RF_PU_RXBUF_HW_LEN) - 1) << RF_PU_RXBUF_HW_POS)
#define RF_PU_RXBUF_HW_UMSK            (~(((1U << RF_PU_RXBUF_HW_LEN) - 1) << RF_PU_RXBUF_HW_POS))
#define RF_PU_DTC_HW                   RF_PU_DTC_HW
#define RF_PU_DTC_HW_POS               (3U)
#define RF_PU_DTC_HW_LEN               (1U)
#define RF_PU_DTC_HW_MSK               (((1U << RF_PU_DTC_HW_LEN) - 1) << RF_PU_DTC_HW_POS)
#define RF_PU_DTC_HW_UMSK              (~(((1U << RF_PU_DTC_HW_LEN) - 1) << RF_PU_DTC_HW_POS))
#define RF_PU_ADPLL_SFREG_HW           RF_PU_ADPLL_SFREG_HW
#define RF_PU_ADPLL_SFREG_HW_POS       (4U)
#define RF_PU_ADPLL_SFREG_HW_LEN       (1U)
#define RF_PU_ADPLL_SFREG_HW_MSK       (((1U << RF_PU_ADPLL_SFREG_HW_LEN) - 1) << RF_PU_ADPLL_SFREG_HW_POS)
#define RF_PU_ADPLL_SFREG_HW_UMSK      (~(((1U << RF_PU_ADPLL_SFREG_HW_LEN) - 1) << RF_PU_ADPLL_SFREG_HW_POS))
#define RF_PU_ADPLL_ADC_HW             RF_PU_ADPLL_ADC_HW
#define RF_PU_ADPLL_ADC_HW_POS         (5U)
#define RF_PU_ADPLL_ADC_HW_LEN         (1U)
#define RF_PU_ADPLL_ADC_HW_MSK         (((1U << RF_PU_ADPLL_ADC_HW_LEN) - 1) << RF_PU_ADPLL_ADC_HW_POS)
#define RF_PU_ADPLL_ADC_HW_UMSK        (~(((1U << RF_PU_ADPLL_ADC_HW_LEN) - 1) << RF_PU_ADPLL_ADC_HW_POS))
#define RF_ADPLL_CLK_EN_HW             RF_ADPLL_CLK_EN_HW
#define RF_ADPLL_CLK_EN_HW_POS         (6U)
#define RF_ADPLL_CLK_EN_HW_LEN         (1U)
#define RF_ADPLL_CLK_EN_HW_MSK         (((1U << RF_ADPLL_CLK_EN_HW_LEN) - 1) << RF_ADPLL_CLK_EN_HW_POS)
#define RF_ADPLL_CLK_EN_HW_UMSK        (~(((1U << RF_ADPLL_CLK_EN_HW_LEN) - 1) << RF_ADPLL_CLK_EN_HW_POS))
#define RF_LOTPM_HFP_BYPASS_HW         RF_LOTPM_HFP_BYPASS_HW
#define RF_LOTPM_HFP_BYPASS_HW_POS     (7U)
#define RF_LOTPM_HFP_BYPASS_HW_LEN     (1U)
#define RF_LOTPM_HFP_BYPASS_HW_MSK     (((1U << RF_LOTPM_HFP_BYPASS_HW_LEN) - 1) << RF_LOTPM_HFP_BYPASS_HW_POS)
#define RF_LOTPM_HFP_BYPASS_HW_UMSK    (~(((1U << RF_LOTPM_HFP_BYPASS_HW_LEN) - 1) << RF_LOTPM_HFP_BYPASS_HW_POS))
#define RF_LOTPM_LFP_BYPASS_HW         RF_LOTPM_LFP_BYPASS_HW
#define RF_LOTPM_LFP_BYPASS_HW_POS     (8U)
#define RF_LOTPM_LFP_BYPASS_HW_LEN     (1U)
#define RF_LOTPM_LFP_BYPASS_HW_MSK     (((1U << RF_LOTPM_LFP_BYPASS_HW_LEN) - 1) << RF_LOTPM_LFP_BYPASS_HW_POS)
#define RF_LOTPM_LFP_BYPASS_HW_UMSK    (~(((1U << RF_LOTPM_LFP_BYPASS_HW_LEN) - 1) << RF_LOTPM_LFP_BYPASS_HW_POS))
#define RF_LOTPM_HFP_CLK_EN_HW         RF_LOTPM_HFP_CLK_EN_HW
#define RF_LOTPM_HFP_CLK_EN_HW_POS     (9U)
#define RF_LOTPM_HFP_CLK_EN_HW_LEN     (1U)
#define RF_LOTPM_HFP_CLK_EN_HW_MSK     (((1U << RF_LOTPM_HFP_CLK_EN_HW_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_HW_POS)
#define RF_LOTPM_HFP_CLK_EN_HW_UMSK    (~(((1U << RF_LOTPM_HFP_CLK_EN_HW_LEN) - 1) << RF_LOTPM_HFP_CLK_EN_HW_POS))
#define RF_PU_FBDV_BUF_HW              RF_PU_FBDV_BUF_HW
#define RF_PU_FBDV_BUF_HW_POS          (10U)
#define RF_PU_FBDV_BUF_HW_LEN          (1U)
#define RF_PU_FBDV_BUF_HW_MSK          (((1U << RF_PU_FBDV_BUF_HW_LEN) - 1) << RF_PU_FBDV_BUF_HW_POS)
#define RF_PU_FBDV_BUF_HW_UMSK         (~(((1U << RF_PU_FBDV_BUF_HW_LEN) - 1) << RF_PU_FBDV_BUF_HW_POS))
#define RF_PU_FBDV_HW                  RF_PU_FBDV_HW
#define RF_PU_FBDV_HW_POS              (11U)
#define RF_PU_FBDV_HW_LEN              (1U)
#define RF_PU_FBDV_HW_MSK              (((1U << RF_PU_FBDV_HW_LEN) - 1) << RF_PU_FBDV_HW_POS)
#define RF_PU_FBDV_HW_UMSK             (~(((1U << RF_PU_FBDV_HW_LEN) - 1) << RF_PU_FBDV_HW_POS))
#define RF_PU_VCO_HW                   RF_PU_VCO_HW
#define RF_PU_VCO_HW_POS               (12U)
#define RF_PU_VCO_HW_LEN               (1U)
#define RF_PU_VCO_HW_MSK               (((1U << RF_PU_VCO_HW_LEN) - 1) << RF_PU_VCO_HW_POS)
#define RF_PU_VCO_HW_UMSK              (~(((1U << RF_PU_VCO_HW_LEN) - 1) << RF_PU_VCO_HW_POS))
#define RF_PU_VCO_LDO_HW               RF_PU_VCO_LDO_HW
#define RF_PU_VCO_LDO_HW_POS           (13U)
#define RF_PU_VCO_LDO_HW_LEN           (1U)
#define RF_PU_VCO_LDO_HW_MSK           (((1U << RF_PU_VCO_LDO_HW_LEN) - 1) << RF_PU_VCO_LDO_HW_POS)
#define RF_PU_VCO_LDO_HW_UMSK          (~(((1U << RF_PU_VCO_LDO_HW_LEN) - 1) << RF_PU_VCO_LDO_HW_POS))
#define RF_PU_LODIST_BODY_BIAS_HW      RF_PU_LODIST_BODY_BIAS_HW
#define RF_PU_LODIST_BODY_BIAS_HW_POS  (14U)
#define RF_PU_LODIST_BODY_BIAS_HW_LEN  (1U)
#define RF_PU_LODIST_BODY_BIAS_HW_MSK  (((1U << RF_PU_LODIST_BODY_BIAS_HW_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_HW_POS)
#define RF_PU_LODIST_BODY_BIAS_HW_UMSK (~(((1U << RF_PU_LODIST_BODY_BIAS_HW_LEN) - 1) << RF_PU_LODIST_BODY_BIAS_HW_POS))
#define RF_RXADC_CLK_EN_HW             RF_RXADC_CLK_EN_HW
#define RF_RXADC_CLK_EN_HW_POS         (15U)
#define RF_RXADC_CLK_EN_HW_LEN         (1U)
#define RF_RXADC_CLK_EN_HW_MSK         (((1U << RF_RXADC_CLK_EN_HW_LEN) - 1) << RF_RXADC_CLK_EN_HW_POS)
#define RF_RXADC_CLK_EN_HW_UMSK        (~(((1U << RF_RXADC_CLK_EN_HW_LEN) - 1) << RF_RXADC_CLK_EN_HW_POS))
#define RF_PU_RXADC_HW                 RF_PU_RXADC_HW
#define RF_PU_RXADC_HW_POS             (16U)
#define RF_PU_RXADC_HW_LEN             (1U)
#define RF_PU_RXADC_HW_MSK             (((1U << RF_PU_RXADC_HW_LEN) - 1) << RF_PU_RXADC_HW_POS)
#define RF_PU_RXADC_HW_UMSK            (~(((1U << RF_PU_RXADC_HW_LEN) - 1) << RF_PU_RXADC_HW_POS))
#define RF_PU_ROSDAC_HW                RF_PU_ROSDAC_HW
#define RF_PU_ROSDAC_HW_POS            (17U)
#define RF_PU_ROSDAC_HW_LEN            (1U)
#define RF_PU_ROSDAC_HW_MSK            (((1U << RF_PU_ROSDAC_HW_LEN) - 1) << RF_PU_ROSDAC_HW_POS)
#define RF_PU_ROSDAC_HW_UMSK           (~(((1U << RF_PU_ROSDAC_HW_LEN) - 1) << RF_PU_ROSDAC_HW_POS))
#define RF_PU_RBB_PKDET_HW             RF_PU_RBB_PKDET_HW
#define RF_PU_RBB_PKDET_HW_POS         (18U)
#define RF_PU_RBB_PKDET_HW_LEN         (1U)
#define RF_PU_RBB_PKDET_HW_MSK         (((1U << RF_PU_RBB_PKDET_HW_LEN) - 1) << RF_PU_RBB_PKDET_HW_POS)
#define RF_PU_RBB_PKDET_HW_UMSK        (~(((1U << RF_PU_RBB_PKDET_HW_LEN) - 1) << RF_PU_RBB_PKDET_HW_POS))
#define RF_PU_RBB_HW                   RF_PU_RBB_HW
#define RF_PU_RBB_HW_POS               (19U)
#define RF_PU_RBB_HW_LEN               (1U)
#define RF_PU_RBB_HW_MSK               (((1U << RF_PU_RBB_HW_LEN) - 1) << RF_PU_RBB_HW_POS)
#define RF_PU_RBB_HW_UMSK              (~(((1U << RF_PU_RBB_HW_LEN) - 1) << RF_PU_RBB_HW_POS))
#define RF_PU_RMX_HW                   RF_PU_RMX_HW
#define RF_PU_RMX_HW_POS               (20U)
#define RF_PU_RMX_HW_LEN               (1U)
#define RF_PU_RMX_HW_MSK               (((1U << RF_PU_RMX_HW_LEN) - 1) << RF_PU_RMX_HW_POS)
#define RF_PU_RMX_HW_UMSK              (~(((1U << RF_PU_RMX_HW_LEN) - 1) << RF_PU_RMX_HW_POS))
#define RF_PU_LNA_HW                   RF_PU_LNA_HW
#define RF_PU_LNA_HW_POS               (21U)
#define RF_PU_LNA_HW_LEN               (1U)
#define RF_PU_LNA_HW_MSK               (((1U << RF_PU_LNA_HW_LEN) - 1) << RF_PU_LNA_HW_POS)
#define RF_PU_LNA_HW_UMSK              (~(((1U << RF_PU_LNA_HW_LEN) - 1) << RF_PU_LNA_HW_POS))
#define RF_PU_PA_HW                    RF_PU_PA_HW
#define RF_PU_PA_HW_POS                (22U)
#define RF_PU_PA_HW_LEN                (1U)
#define RF_PU_PA_HW_MSK                (((1U << RF_PU_PA_HW_LEN) - 1) << RF_PU_PA_HW_POS)
#define RF_PU_PA_HW_UMSK               (~(((1U << RF_PU_PA_HW_LEN) - 1) << RF_PU_PA_HW_POS))
#define RF_RX_BYPASS_EN_HW             RF_RX_BYPASS_EN_HW
#define RF_RX_BYPASS_EN_HW_POS         (23U)
#define RF_RX_BYPASS_EN_HW_LEN         (1U)
#define RF_RX_BYPASS_EN_HW_MSK         (((1U << RF_RX_BYPASS_EN_HW_LEN) - 1) << RF_RX_BYPASS_EN_HW_POS)
#define RF_RX_BYPASS_EN_HW_UMSK        (~(((1U << RF_RX_BYPASS_EN_HW_LEN) - 1) << RF_RX_BYPASS_EN_HW_POS))
#define RF_PA_SERI_CAP_EN_HW           RF_PA_SERI_CAP_EN_HW
#define RF_PA_SERI_CAP_EN_HW_POS       (24U)
#define RF_PA_SERI_CAP_EN_HW_LEN       (1U)
#define RF_PA_SERI_CAP_EN_HW_MSK       (((1U << RF_PA_SERI_CAP_EN_HW_LEN) - 1) << RF_PA_SERI_CAP_EN_HW_POS)
#define RF_PA_SERI_CAP_EN_HW_UMSK      (~(((1U << RF_PA_SERI_CAP_EN_HW_LEN) - 1) << RF_PA_SERI_CAP_EN_HW_POS))
#define RF_RST_ADPLL_HW                RF_RST_ADPLL_HW
#define RF_RST_ADPLL_HW_POS            (25U)
#define RF_RST_ADPLL_HW_LEN            (1U)
#define RF_RST_ADPLL_HW_MSK            (((1U << RF_RST_ADPLL_HW_LEN) - 1) << RF_RST_ADPLL_HW_POS)
#define RF_RST_ADPLL_HW_UMSK           (~(((1U << RF_RST_ADPLL_HW_LEN) - 1) << RF_RST_ADPLL_HW_POS))
#define RF_RST_LOTPM_HFP_HW            RF_RST_LOTPM_HFP_HW
#define RF_RST_LOTPM_HFP_HW_POS        (26U)
#define RF_RST_LOTPM_HFP_HW_LEN        (1U)
#define RF_RST_LOTPM_HFP_HW_MSK        (((1U << RF_RST_LOTPM_HFP_HW_LEN) - 1) << RF_RST_LOTPM_HFP_HW_POS)
#define RF_RST_LOTPM_HFP_HW_UMSK       (~(((1U << RF_RST_LOTPM_HFP_HW_LEN) - 1) << RF_RST_LOTPM_HFP_HW_POS))
#define RF_RST_FBDV_HW                 RF_RST_FBDV_HW
#define RF_RST_FBDV_HW_POS             (27U)
#define RF_RST_FBDV_HW_LEN             (1U)
#define RF_RST_FBDV_HW_MSK             (((1U << RF_RST_FBDV_HW_LEN) - 1) << RF_RST_FBDV_HW_POS)
#define RF_RST_FBDV_HW_UMSK            (~(((1U << RF_RST_FBDV_HW_LEN) - 1) << RF_RST_FBDV_HW_POS))

/* 0x11C : non_reg_readback */
#define RF_NON_REG_READBACK_OFFSET      (0x11C)
#define RF_PPU_TESTBUF_HW               RF_PPU_TESTBUF_HW
#define RF_PPU_TESTBUF_HW_POS           (5U)
#define RF_PPU_TESTBUF_HW_LEN           (1U)
#define RF_PPU_TESTBUF_HW_MSK           (((1U << RF_PPU_TESTBUF_HW_LEN) - 1) << RF_PPU_TESTBUF_HW_POS)
#define RF_PPU_TESTBUF_HW_UMSK          (~(((1U << RF_PPU_TESTBUF_HW_LEN) - 1) << RF_PPU_TESTBUF_HW_POS))
#define RF_PPU_TXBUF_HW                 RF_PPU_TXBUF_HW
#define RF_PPU_TXBUF_HW_POS             (6U)
#define RF_PPU_TXBUF_HW_LEN             (1U)
#define RF_PPU_TXBUF_HW_MSK             (((1U << RF_PPU_TXBUF_HW_LEN) - 1) << RF_PPU_TXBUF_HW_POS)
#define RF_PPU_TXBUF_HW_UMSK            (~(((1U << RF_PPU_TXBUF_HW_LEN) - 1) << RF_PPU_TXBUF_HW_POS))
#define RF_PPU_RXBUF_HW                 RF_PPU_RXBUF_HW
#define RF_PPU_RXBUF_HW_POS             (7U)
#define RF_PPU_RXBUF_HW_LEN             (1U)
#define RF_PPU_RXBUF_HW_MSK             (((1U << RF_PPU_RXBUF_HW_LEN) - 1) << RF_PPU_RXBUF_HW_POS)
#define RF_PPU_RXBUF_HW_UMSK            (~(((1U << RF_PPU_RXBUF_HW_LEN) - 1) << RF_PPU_RXBUF_HW_POS))
#define RF_PPU_ADPLL_SFREG_HW           RF_PPU_ADPLL_SFREG_HW
#define RF_PPU_ADPLL_SFREG_HW_POS       (8U)
#define RF_PPU_ADPLL_SFREG_HW_LEN       (1U)
#define RF_PPU_ADPLL_SFREG_HW_MSK       (((1U << RF_PPU_ADPLL_SFREG_HW_LEN) - 1) << RF_PPU_ADPLL_SFREG_HW_POS)
#define RF_PPU_ADPLL_SFREG_HW_UMSK      (~(((1U << RF_PPU_ADPLL_SFREG_HW_LEN) - 1) << RF_PPU_ADPLL_SFREG_HW_POS))
#define RF_PPU_FBDV_HW                  RF_PPU_FBDV_HW
#define RF_PPU_FBDV_HW_POS              (9U)
#define RF_PPU_FBDV_HW_LEN              (1U)
#define RF_PPU_FBDV_HW_MSK              (((1U << RF_PPU_FBDV_HW_LEN) - 1) << RF_PPU_FBDV_HW_POS)
#define RF_PPU_FBDV_HW_UMSK             (~(((1U << RF_PPU_FBDV_HW_LEN) - 1) << RF_PPU_FBDV_HW_POS))
#define RF_PUD_VCO_HW                   RF_PUD_VCO_HW
#define RF_PUD_VCO_HW_POS               (10U)
#define RF_PUD_VCO_HW_LEN               (1U)
#define RF_PUD_VCO_HW_MSK               (((1U << RF_PUD_VCO_HW_LEN) - 1) << RF_PUD_VCO_HW_POS)
#define RF_PUD_VCO_HW_UMSK              (~(((1U << RF_PUD_VCO_HW_LEN) - 1) << RF_PUD_VCO_HW_POS))
#define RF_PPU_VCO_HW                   RF_PPU_VCO_HW
#define RF_PPU_VCO_HW_POS               (11U)
#define RF_PPU_VCO_HW_LEN               (1U)
#define RF_PPU_VCO_HW_MSK               (((1U << RF_PPU_VCO_HW_LEN) - 1) << RF_PPU_VCO_HW_POS)
#define RF_PPU_VCO_HW_UMSK              (~(((1U << RF_PPU_VCO_HW_LEN) - 1) << RF_PPU_VCO_HW_POS))
#define RF_PPU_VCO_LDO_HW               RF_PPU_VCO_LDO_HW
#define RF_PPU_VCO_LDO_HW_POS           (12U)
#define RF_PPU_VCO_LDO_HW_LEN           (1U)
#define RF_PPU_VCO_LDO_HW_MSK           (((1U << RF_PPU_VCO_LDO_HW_LEN) - 1) << RF_PPU_VCO_LDO_HW_POS)
#define RF_PPU_VCO_LDO_HW_UMSK          (~(((1U << RF_PPU_VCO_LDO_HW_LEN) - 1) << RF_PPU_VCO_LDO_HW_POS))
#define RF_PPU_LODIST_BODY_BIAS_HW      RF_PPU_LODIST_BODY_BIAS_HW
#define RF_PPU_LODIST_BODY_BIAS_HW_POS  (13U)
#define RF_PPU_LODIST_BODY_BIAS_HW_LEN  (1U)
#define RF_PPU_LODIST_BODY_BIAS_HW_MSK  (((1U << RF_PPU_LODIST_BODY_BIAS_HW_LEN) - 1) << RF_PPU_LODIST_BODY_BIAS_HW_POS)
#define RF_PPU_LODIST_BODY_BIAS_HW_UMSK (~(((1U << RF_PPU_LODIST_BODY_BIAS_HW_LEN) - 1) << RF_PPU_LODIST_BODY_BIAS_HW_POS))
#define RF_PPU_RBB_HW                   RF_PPU_RBB_HW
#define RF_PPU_RBB_HW_POS               (15U)
#define RF_PPU_RBB_HW_LEN               (1U)
#define RF_PPU_RBB_HW_MSK               (((1U << RF_PPU_RBB_HW_LEN) - 1) << RF_PPU_RBB_HW_POS)
#define RF_PPU_RBB_HW_UMSK              (~(((1U << RF_PPU_RBB_HW_LEN) - 1) << RF_PPU_RBB_HW_POS))
#define RF_PPU_LNA_HW                   RF_PPU_LNA_HW
#define RF_PPU_LNA_HW_POS               (16U)
#define RF_PPU_LNA_HW_LEN               (1U)
#define RF_PPU_LNA_HW_MSK               (((1U << RF_PPU_LNA_HW_LEN) - 1) << RF_PPU_LNA_HW_POS)
#define RF_PPU_LNA_HW_UMSK              (~(((1U << RF_PPU_LNA_HW_LEN) - 1) << RF_PPU_LNA_HW_POS))

