bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x120 : Register control of TX/RX gain */
#define RF_TRX_GAIN_BW_OFFSET (0x120)
#define RF_GC_LNA             RF_GC_LNA
#define RF_GC_LNA_POS         (0U)
#define RF_GC_LNA_LEN         (3U)
#define RF_GC_LNA_MSK         (((1U << RF_GC_LNA_LEN) - 1) << RF_GC_LNA_POS)
#define RF_GC_LNA_UMSK        (~(((1U << RF_GC_LNA_LEN) - 1) << RF_GC_LNA_POS))
#define RF_GC_RBB1            RF_GC_RBB1
#define RF_GC_RBB1_POS        (3U)
#define RF_GC_RBB1_LEN        (2U)
#define RF_GC_RBB1_MSK        (((1U << RF_GC_RBB1_LEN) - 1) << RF_GC_RBB1_POS)
#define RF_GC_RBB1_UMSK       (~(((1U << RF_GC_RBB1_LEN) - 1) << RF_GC_RBB1_POS))
#define RF_GC_RBB2            RF_GC_RBB2
#define RF_GC_RBB2_POS        (5U)
#define RF_GC_RBB2_LEN        (3U)
#define RF_GC_RBB2_MSK        (((1U << RF_GC_RBB2_LEN) - 1) << RF_GC_RBB2_POS)
#define RF_GC_RBB2_UMSK       (~(((1U << RF_GC_RBB2_LEN) - 1) << RF_GC_RBB2_POS))
#define RF_RBB_BW             RF_RBB_BW
#define RF_RBB_BW_POS         (8U)
#define RF_RBB_BW_LEN         (1U)
#define RF_RBB_BW_MSK         (((1U << RF_RBB_BW_LEN) - 1) << RF_RBB_BW_POS)
#define RF_RBB_BW_UMSK        (~(((1U << RF_RBB_BW_LEN) - 1) << RF_RBB_BW_POS))
#define RF_PA_REF_DAC         RF_PA_REF_DAC
#define RF_PA_REF_DAC_POS     (12U)
#define RF_PA_REF_DAC_LEN     (5U)
#define RF_PA_REF_DAC_MSK     (((1U << RF_PA_REF_DAC_LEN) - 1) << RF_PA_REF_DAC_POS)
#define RF_PA_REF_DAC_UMSK    (~(((1U << RF_PA_REF_DAC_LEN) - 1) << RF_PA_REF_DAC_POS))
#define RF_PA_INBUF_UNIT      RF_PA_INBUF_UNIT
#define RF_PA_INBUF_UNIT_POS  (20U)
#define RF_PA_INBUF_UNIT_LEN  (3U)
#define RF_PA_INBUF_UNIT_MSK  (((1U << RF_PA_INBUF_UNIT_LEN) - 1) << RF_PA_INBUF_UNIT_POS)
#define RF_PA_INBUF_UNIT_UMSK (~(((1U << RF_PA_INBUF_UNIT_LEN) - 1) << RF_PA_INBUF_UNIT_POS))

/* 0x124 : Hardware read back of TX/RX gain */
#define RF_TRX_GAIN_BW_HW_OFFSET (0x124)
#define RF_GC_LNA_HW             RF_GC_LNA_HW
#define RF_GC_LNA_HW_POS         (0U)
#define RF_GC_LNA_HW_LEN         (3U)
#define RF_GC_LNA_HW_MSK         (((1U << RF_GC_LNA_HW_LEN) - 1) << RF_GC_LNA_HW_POS)
#define RF_GC_LNA_HW_UMSK        (~(((1U << RF_GC_LNA_HW_LEN) - 1) << RF_GC_LNA_HW_POS))
#define RF_GC_RBB1_HW            RF_GC_RBB1_HW
#define RF_GC_RBB1_HW_POS        (3U)
#define RF_GC_RBB1_HW_LEN        (2U)
#define RF_GC_RBB1_HW_MSK        (((1U << RF_GC_RBB1_HW_LEN) - 1) << RF_GC_RBB1_HW_POS)
#define RF_GC_RBB1_HW_UMSK       (~(((1U << RF_GC_RBB1_HW_LEN) - 1) << RF_GC_RBB1_HW_POS))
#define RF_GC_RBB2_HW            RF_GC_RBB2_HW
#define RF_GC_RBB2_HW_POS        (5U)
#define RF_GC_RBB2_HW_LEN        (3U)
#define RF_GC_RBB2_HW_MSK        (((1U << RF_GC_RBB2_HW_LEN) - 1) << RF_GC_RBB2_HW_POS)
#define RF_GC_RBB2_HW_UMSK       (~(((1U << RF_GC_RBB2_HW_LEN) - 1) << RF_GC_RBB2_HW_POS))
#define RF_RBB_BW_HW             RF_RBB_BW_HW
#define RF_RBB_BW_HW_POS         (8U)
#define RF_RBB_BW_HW_LEN         (1U)
#define RF_RBB_BW_HW_MSK         (((1U << RF_RBB_BW_HW_LEN) - 1) << RF_RBB_BW_HW_POS)
#define RF_RBB_BW_HW_UMSK        (~(((1U << RF_RBB_BW_HW_LEN) - 1) << RF_RBB_BW_HW_POS))
#define RF_PA_REF_DAC_HW         RF_PA_REF_DAC_HW
#define RF_PA_REF_DAC_HW_POS     (12U)
#define RF_PA_REF_DAC_HW_LEN     (5U)
#define RF_PA_REF_DAC_HW_MSK     (((1U << RF_PA_REF_DAC_HW_LEN) - 1) << RF_PA_REF_DAC_HW_POS)
#define RF_PA_REF_DAC_HW_UMSK    (~(((1U << RF_PA_REF_DAC_HW_LEN) - 1) << RF_PA_REF_DAC_HW_POS))
#define RF_PA_INBUF_UNIT_HW      RF_PA_INBUF_UNIT_HW
#define RF_PA_INBUF_UNIT_HW_POS  (20U)
#define RF_PA_INBUF_UNIT_HW_LEN  (3U)
#define RF_PA_INBUF_UNIT_HW_MSK  (((1U << RF_PA_INBUF_UNIT_HW_LEN) - 1) << RF_PA_INBUF_UNIT_HW_POS)
#define RF_PA_INBUF_UNIT_HW_UMSK (~(((1U << RF_PA_INBUF_UNIT_HW_LEN) - 1) << RF_PA_INBUF_UNIT_HW_POS))

/* 0x128 : DC Test register 0 */
#define RF_DCTEST_ACTEST_OFFSET (0x128)
#define RF_DC_TP_OUT_EN         RF_DC_TP_OUT_EN
#define RF_DC_TP_OUT_EN_POS     (4U)
#define RF_DC_TP_OUT_EN_LEN     (2U)
#define RF_DC_TP_OUT_EN_MSK     (((1U << RF_DC_TP_OUT_EN_LEN) - 1) << RF_DC_TP_OUT_EN_POS)
#define RF_DC_TP_OUT_EN_UMSK    (~(((1U << RF_DC_TP_OUT_EN_LEN) - 1) << RF_DC_TP_OUT_EN_POS))
#define RF_ATEST_OUT_EN         RF_ATEST_OUT_EN
#define RF_ATEST_OUT_EN_POS     (6U)
#define RF_ATEST_OUT_EN_LEN     (2U)
#define RF_ATEST_OUT_EN_MSK     (((1U << RF_ATEST_OUT_EN_LEN) - 1) << RF_ATEST_OUT_EN_POS)
#define RF_ATEST_OUT_EN_UMSK    (~(((1U << RF_ATEST_OUT_EN_LEN) - 1) << RF_ATEST_OUT_EN_POS))
#define RF_TEN_DTC              RF_TEN_DTC
#define RF_TEN_DTC_POS          (17U)
#define RF_TEN_DTC_LEN          (1U)
#define RF_TEN_DTC_MSK          (((1U << RF_TEN_DTC_LEN) - 1) << RF_TEN_DTC_POS)
#define RF_TEN_DTC_UMSK         (~(((1U << RF_TEN_DTC_LEN) - 1) << RF_TEN_DTC_POS))
#define RF_TEN_RBB              RF_TEN_RBB
#define RF_TEN_RBB_POS          (18U)
#define RF_TEN_RBB_LEN          (1U)
#define RF_TEN_RBB_MSK          (((1U << RF_TEN_RBB_LEN) - 1) << RF_TEN_RBB_POS)
#define RF_TEN_RBB_UMSK         (~(((1U << RF_TEN_RBB_LEN) - 1) << RF_TEN_RBB_POS))
#define RF_TEN_RBB_ACTEST       RF_TEN_RBB_ACTEST
#define RF_TEN_RBB_ACTEST_POS   (19U)
#define RF_TEN_RBB_ACTEST_LEN   (1U)
#define RF_TEN_RBB_ACTEST_MSK   (((1U << RF_TEN_RBB_ACTEST_LEN) - 1) << RF_TEN_RBB_ACTEST_POS)
#define RF_TEN_RBB_ACTEST_UMSK  (~(((1U << RF_TEN_RBB_ACTEST_LEN) - 1) << RF_TEN_RBB_ACTEST_POS))
#define RF_TEN_ADPLL_ADC        RF_TEN_ADPLL_ADC
#define RF_TEN_ADPLL_ADC_POS    (20U)
#define RF_TEN_ADPLL_ADC_LEN    (1U)
#define RF_TEN_ADPLL_ADC_MSK    (((1U << RF_TEN_ADPLL_ADC_LEN) - 1) << RF_TEN_ADPLL_ADC_POS)
#define RF_TEN_ADPLL_ADC_UMSK   (~(((1U << RF_TEN_ADPLL_ADC_LEN) - 1) << RF_TEN_ADPLL_ADC_POS))
#define RF_TEN_VCO              RF_TEN_VCO
#define RF_TEN_VCO_POS          (21U)
#define RF_TEN_VCO_LEN          (1U)
#define RF_TEN_VCO_MSK          (((1U << RF_TEN_VCO_LEN) - 1) << RF_TEN_VCO_POS)
#define RF_TEN_VCO_UMSK         (~(((1U << RF_TEN_VCO_LEN) - 1) << RF_TEN_VCO_POS))
#define RF_TEN_RXADC            RF_TEN_RXADC
#define RF_TEN_RXADC_POS        (22U)
#define RF_TEN_RXADC_LEN        (1U)
#define RF_TEN_RXADC_MSK        (((1U << RF_TEN_RXADC_LEN) - 1) << RF_TEN_RXADC_POS)
#define RF_TEN_RXADC_UMSK       (~(((1U << RF_TEN_RXADC_LEN) - 1) << RF_TEN_RXADC_POS))
#define RF_TEN_RRF1             RF_TEN_RRF1
#define RF_TEN_RRF1_POS         (23U)
#define RF_TEN_RRF1_LEN         (1U)
#define RF_TEN_RRF1_MSK         (((1U << RF_TEN_RRF1_LEN) - 1) << RF_TEN_RRF1_POS)
#define RF_TEN_RRF1_UMSK        (~(((1U << RF_TEN_RRF1_LEN) - 1) << RF_TEN_RRF1_POS))
#define RF_TEN_RRF0             RF_TEN_RRF0
#define RF_TEN_RRF0_POS         (24U)
#define RF_TEN_RRF0_LEN         (1U)
#define RF_TEN_RRF0_MSK         (((1U << RF_TEN_RRF0_LEN) - 1) << RF_TEN_RRF0_POS)
#define RF_TEN_RRF0_UMSK        (~(((1U << RF_TEN_RRF0_LEN) - 1) << RF_TEN_RRF0_POS))
#define RF_TEN_PA_1             RF_TEN_PA_1
#define RF_TEN_PA_1_POS         (25U)
#define RF_TEN_PA_1_LEN         (1U)
#define RF_TEN_PA_1_MSK         (((1U << RF_TEN_PA_1_LEN) - 1) << RF_TEN_PA_1_POS)
#define RF_TEN_PA_1_UMSK        (~(((1U << RF_TEN_PA_1_LEN) - 1) << RF_TEN_PA_1_POS))
#define RF_TEN_PA_0             RF_TEN_PA_0
#define RF_TEN_PA_0_POS         (26U)
#define RF_TEN_PA_0_LEN         (1U)
#define RF_TEN_PA_0_MSK         (((1U << RF_TEN_PA_0_LEN) - 1) << RF_TEN_PA_0_POS)
#define RF_TEN_PA_0_UMSK        (~(((1U << RF_TEN_PA_0_LEN) - 1) << RF_TEN_PA_0_POS))
#define RF_TEN_LODIST           RF_TEN_LODIST
#define RF_TEN_LODIST_POS       (27U)
#define RF_TEN_LODIST_LEN       (1U)
#define RF_TEN_LODIST_MSK       (((1U << RF_TEN_LODIST_LEN) - 1) << RF_TEN_LODIST_POS)
#define RF_TEN_LODIST_UMSK      (~(((1U << RF_TEN_LODIST_LEN) - 1) << RF_TEN_LODIST_POS))
#define RF_TEN_DLL              RF_TEN_DLL
#define RF_TEN_DLL_POS          (28U)
#define RF_TEN_DLL_LEN          (1U)
#define RF_TEN_DLL_MSK          (((1U << RF_TEN_DLL_LEN) - 1) << RF_TEN_DLL_POS)
#define RF_TEN_DLL_UMSK         (~(((1U << RF_TEN_DLL_LEN) - 1) << RF_TEN_DLL_POS))
#define RF_TEN_MBG              RF_TEN_MBG
#define RF_TEN_MBG_POS          (31U)
#define RF_TEN_MBG_LEN          (1U)
#define RF_TEN_MBG_MSK          (((1U << RF_TEN_MBG_LEN) - 1) << RF_TEN_MBG_POS)
#define RF_TEN_MBG_UMSK         (~(((1U << RF_TEN_MBG_LEN) - 1) << RF_TEN_MBG_POS))

