bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x12C : LO Bias Mode registers */
#define RF_DTEST_OFFSET            (0x12C)
#define RF_DTEST_PULLDOWN          RF_DTEST_PULLDOWN
#define RF_DTEST_PULLDOWN_POS      (0U)
#define RF_DTEST_PULLDOWN_LEN      (1U)
#define RF_DTEST_PULLDOWN_MSK      (((1U << RF_DTEST_PULLDOWN_LEN) - 1) << RF_DTEST_PULLDOWN_POS)
#define RF_DTEST_PULLDOWN_UMSK     (~(((1U << RF_DTEST_PULLDOWN_LEN) - 1) << RF_DTEST_PULLDOWN_POS))
#define RF_DTEST_EN_RXADC_Q        RF_DTEST_EN_RXADC_Q
#define RF_DTEST_EN_RXADC_Q_POS    (23U)
#define RF_DTEST_EN_RXADC_Q_LEN    (1U)
#define RF_DTEST_EN_RXADC_Q_MSK    (((1U << RF_DTEST_EN_RXADC_Q_LEN) - 1) << RF_DTEST_EN_RXADC_Q_POS)
#define RF_DTEST_EN_RXADC_Q_UMSK   (~(((1U << RF_DTEST_EN_RXADC_Q_LEN) - 1) << RF_DTEST_EN_RXADC_Q_POS))
#define RF_DTEST_EN_RXADC_I        RF_DTEST_EN_RXADC_I
#define RF_DTEST_EN_RXADC_I_POS    (24U)
#define RF_DTEST_EN_RXADC_I_LEN    (1U)
#define RF_DTEST_EN_RXADC_I_MSK    (((1U << RF_DTEST_EN_RXADC_I_LEN) - 1) << RF_DTEST_EN_RXADC_I_POS)
#define RF_DTEST_EN_RXADC_I_UMSK   (~(((1U << RF_DTEST_EN_RXADC_I_LEN) - 1) << RF_DTEST_EN_RXADC_I_POS))
#define RF_DTEST_EN_ADPLL_ADC      RF_DTEST_EN_ADPLL_ADC
#define RF_DTEST_EN_ADPLL_ADC_POS  (25U)
#define RF_DTEST_EN_ADPLL_ADC_LEN  (1U)
#define RF_DTEST_EN_ADPLL_ADC_MSK  (((1U << RF_DTEST_EN_ADPLL_ADC_LEN) - 1) << RF_DTEST_EN_ADPLL_ADC_POS)
#define RF_DTEST_EN_ADPLL_ADC_UMSK (~(((1U << RF_DTEST_EN_ADPLL_ADC_LEN) - 1) << RF_DTEST_EN_ADPLL_ADC_POS))
#define RF_DTEST_EN_MOD4           RF_DTEST_EN_MOD4
#define RF_DTEST_EN_MOD4_POS       (26U)
#define RF_DTEST_EN_MOD4_LEN       (1U)
#define RF_DTEST_EN_MOD4_MSK       (((1U << RF_DTEST_EN_MOD4_LEN) - 1) << RF_DTEST_EN_MOD4_POS)
#define RF_DTEST_EN_MOD4_UMSK      (~(((1U << RF_DTEST_EN_MOD4_LEN) - 1) << RF_DTEST_EN_MOD4_POS))
#define RF_DTEST_EN_FREF           RF_DTEST_EN_FREF
#define RF_DTEST_EN_FREF_POS       (27U)
#define RF_DTEST_EN_FREF_LEN       (1U)
#define RF_DTEST_EN_FREF_MSK       (((1U << RF_DTEST_EN_FREF_LEN) - 1) << RF_DTEST_EN_FREF_POS)
#define RF_DTEST_EN_FREF_UMSK      (~(((1U << RF_DTEST_EN_FREF_LEN) - 1) << RF_DTEST_EN_FREF_POS))
#define RF_DTEST_EN_DTC_OUT        RF_DTEST_EN_DTC_OUT
#define RF_DTEST_EN_DTC_OUT_POS    (28U)
#define RF_DTEST_EN_DTC_OUT_LEN    (1U)
#define RF_DTEST_EN_DTC_OUT_MSK    (((1U << RF_DTEST_EN_DTC_OUT_LEN) - 1) << RF_DTEST_EN_DTC_OUT_POS)
#define RF_DTEST_EN_DTC_OUT_UMSK   (~(((1U << RF_DTEST_EN_DTC_OUT_LEN) - 1) << RF_DTEST_EN_DTC_OUT_POS))
#define RF_DTEST_EN_DTC_IN         RF_DTEST_EN_DTC_IN
#define RF_DTEST_EN_DTC_IN_POS     (29U)
#define RF_DTEST_EN_DTC_IN_LEN     (1U)
#define RF_DTEST_EN_DTC_IN_MSK     (((1U << RF_DTEST_EN_DTC_IN_LEN) - 1) << RF_DTEST_EN_DTC_IN_POS)
#define RF_DTEST_EN_DTC_IN_UMSK    (~(((1U << RF_DTEST_EN_DTC_IN_LEN) - 1) << RF_DTEST_EN_DTC_IN_POS))

/* 0x130 : adpll_test */
#define RF_ADPLL_TEST_OFFSET         (0x130)
#define RF_ADPLL_TEST_OUT            RF_ADPLL_TEST_OUT
#define RF_ADPLL_TEST_OUT_POS        (0U)
#define RF_ADPLL_TEST_OUT_LEN        (16U)
#define RF_ADPLL_TEST_OUT_MSK        (((1U << RF_ADPLL_TEST_OUT_LEN) - 1) << RF_ADPLL_TEST_OUT_POS)
#define RF_ADPLL_TEST_OUT_UMSK       (~(((1U << RF_ADPLL_TEST_OUT_LEN) - 1) << RF_ADPLL_TEST_OUT_POS))
#define RF_ADPLL_TEST_DATA_SEL       RF_ADPLL_TEST_DATA_SEL
#define RF_ADPLL_TEST_DATA_SEL_POS   (16U)
#define RF_ADPLL_TEST_DATA_SEL_LEN   (3U)
#define RF_ADPLL_TEST_DATA_SEL_MSK   (((1U << RF_ADPLL_TEST_DATA_SEL_LEN) - 1) << RF_ADPLL_TEST_DATA_SEL_POS)
#define RF_ADPLL_TEST_DATA_SEL_UMSK  (~(((1U << RF_ADPLL_TEST_DATA_SEL_LEN) - 1) << RF_ADPLL_TEST_DATA_SEL_POS))
#define RF_ADPLL_TEST_START_SEL      RF_ADPLL_TEST_START_SEL
#define RF_ADPLL_TEST_START_SEL_POS  (20U)
#define RF_ADPLL_TEST_START_SEL_LEN  (2U)
#define RF_ADPLL_TEST_START_SEL_MSK  (((1U << RF_ADPLL_TEST_START_SEL_LEN) - 1) << RF_ADPLL_TEST_START_SEL_POS)
#define RF_ADPLL_TEST_START_SEL_UMSK (~(((1U << RF_ADPLL_TEST_START_SEL_LEN) - 1) << RF_ADPLL_TEST_START_SEL_POS))
#define RF_ADPLL_TEST_EN             RF_ADPLL_TEST_EN
#define RF_ADPLL_TEST_EN_POS         (24U)
#define RF_ADPLL_TEST_EN_LEN         (1U)
#define RF_ADPLL_TEST_EN_MSK         (((1U << RF_ADPLL_TEST_EN_LEN) - 1) << RF_ADPLL_TEST_EN_POS)
#define RF_ADPLL_TEST_EN_UMSK        (~(((1U << RF_ADPLL_TEST_EN_LEN) - 1) << RF_ADPLL_TEST_EN_POS))
#define RF_ADPLL_TEST_START          RF_ADPLL_TEST_START
#define RF_ADPLL_TEST_START_POS      (25U)
#define RF_ADPLL_TEST_START_LEN      (1U)
#define RF_ADPLL_TEST_START_MSK      (((1U << RF_ADPLL_TEST_START_LEN) - 1) << RF_ADPLL_TEST_START_POS)
#define RF_ADPLL_TEST_START_UMSK     (~(((1U << RF_ADPLL_TEST_START_LEN) - 1) << RF_ADPLL_TEST_START_POS))

/* 0x134 : rf_ext_pa */
#define RF_EXT_PA_OFFSET    (0x134)
#define RF_EXT_PA_SB        RF_EXT_PA_SB
#define RF_EXT_PA_SB_POS    (0U)
#define RF_EXT_PA_SB_LEN    (5U)
#define RF_EXT_PA_SB_MSK    (((1U << RF_EXT_PA_SB_LEN) - 1) << RF_EXT_PA_SB_POS)
#define RF_EXT_PA_SB_UMSK   (~(((1U << RF_EXT_PA_SB_LEN) - 1) << RF_EXT_PA_SB_POS))
#define RF_EXT_PA_LOTX      RF_EXT_PA_LOTX
#define RF_EXT_PA_LOTX_POS  (5U)
#define RF_EXT_PA_LOTX_LEN  (5U)
#define RF_EXT_PA_LOTX_MSK  (((1U << RF_EXT_PA_LOTX_LEN) - 1) << RF_EXT_PA_LOTX_POS)
#define RF_EXT_PA_LOTX_UMSK (~(((1U << RF_EXT_PA_LOTX_LEN) - 1) << RF_EXT_PA_LOTX_POS))
#define RF_EXT_PA_TX        RF_EXT_PA_TX
#define RF_EXT_PA_TX_POS    (10U)
#define RF_EXT_PA_TX_LEN    (5U)
#define RF_EXT_PA_TX_MSK    (((1U << RF_EXT_PA_TX_LEN) - 1) << RF_EXT_PA_TX_POS)
#define RF_EXT_PA_TX_UMSK   (~(((1U << RF_EXT_PA_TX_LEN) - 1) << RF_EXT_PA_TX_POS))
#define RF_EXT_PA_LORX      RF_EXT_PA_LORX
#define RF_EXT_PA_LORX_POS  (15U)
#define RF_EXT_PA_LORX_LEN  (5U)
#define RF_EXT_PA_LORX_MSK  (((1U << RF_EXT_PA_LORX_LEN) - 1) << RF_EXT_PA_LORX_POS)
#define RF_EXT_PA_LORX_UMSK (~(((1U << RF_EXT_PA_LORX_LEN) - 1) << RF_EXT_PA_LORX_POS))
#define RF_EXT_PA_RX        RF_EXT_PA_RX
#define RF_EXT_PA_RX_POS    (20U)
#define RF_EXT_PA_RX_LEN    (5U)
#define RF_EXT_PA_RX_MSK    (((1U << RF_EXT_PA_RX_LEN) - 1) << RF_EXT_PA_RX_POS)
#define RF_EXT_PA_RX_UMSK   (~(((1U << RF_EXT_PA_RX_LEN) - 1) << RF_EXT_PA_RX_POS))

/* 0x200 : cip_ldo15 */
#define RF_CIP_LDO15_OFFSET (0x200)
#define RF_VG11_SEL         RF_VG11_SEL
#define RF_VG11_SEL_POS     (0U)
#define RF_VG11_SEL_LEN     (2U)
#define RF_VG11_SEL_MSK     (((1U << RF_VG11_SEL_LEN) - 1) << RF_VG11_SEL_POS)
#define RF_VG11_SEL_UMSK    (~(((1U << RF_VG11_SEL_LEN) - 1) << RF_VG11_SEL_POS))

/* 0x204 : PA register */
#define RF_PA_OFFSET                (0x204)
#define RF_PA_SERI_CS_TX            RF_PA_SERI_CS_TX
#define RF_PA_SERI_CS_TX_POS        (0U)
#define RF_PA_SERI_CS_TX_LEN        (4U)
#define RF_PA_SERI_CS_TX_MSK        (((1U << RF_PA_SERI_CS_TX_LEN) - 1) << RF_PA_SERI_CS_TX_POS)
#define RF_PA_SERI_CS_TX_UMSK       (~(((1U << RF_PA_SERI_CS_TX_LEN) - 1) << RF_PA_SERI_CS_TX_POS))
#define RF_PA_SERI_CS_RX            RF_PA_SERI_CS_RX
#define RF_PA_SERI_CS_RX_POS        (4U)
#define RF_PA_SERI_CS_RX_LEN        (4U)
#define RF_PA_SERI_CS_RX_MSK        (((1U << RF_PA_SERI_CS_RX_LEN) - 1) << RF_PA_SERI_CS_RX_POS)
#define RF_PA_SERI_CS_RX_UMSK       (~(((1U << RF_PA_SERI_CS_RX_LEN) - 1) << RF_PA_SERI_CS_RX_POS))
#define RF_PA_SERI_CS_HW            RF_PA_SERI_CS_HW
#define RF_PA_SERI_CS_HW_POS        (8U)
#define RF_PA_SERI_CS_HW_LEN        (4U)
#define RF_PA_SERI_CS_HW_MSK        (((1U << RF_PA_SERI_CS_HW_LEN) - 1) << RF_PA_SERI_CS_HW_POS)
#define RF_PA_SERI_CS_HW_UMSK       (~(((1U << RF_PA_SERI_CS_HW_LEN) - 1) << RF_PA_SERI_CS_HW_POS))
#define RF_PA_PARA_CS               RF_PA_PARA_CS
#define RF_PA_PARA_CS_POS           (12U)
#define RF_PA_PARA_CS_LEN           (4U)
#define RF_PA_PARA_CS_MSK           (((1U << RF_PA_PARA_CS_LEN) - 1) << RF_PA_PARA_CS_POS)
#define RF_PA_PARA_CS_UMSK          (~(((1U << RF_PA_PARA_CS_LEN) - 1) << RF_PA_PARA_CS_POS))
#define RF_PA_VDD11_SEL             RF_PA_VDD11_SEL
#define RF_PA_VDD11_SEL_POS         (20U)
#define RF_PA_VDD11_SEL_LEN         (3U)
#define RF_PA_VDD11_SEL_MSK         (((1U << RF_PA_VDD11_SEL_LEN) - 1) << RF_PA_VDD11_SEL_POS)
#define RF_PA_VDD11_SEL_UMSK        (~(((1U << RF_PA_VDD11_SEL_LEN) - 1) << RF_PA_VDD11_SEL_POS))
#define RF_PA_LDO_BM                RF_PA_LDO_BM
#define RF_PA_LDO_BM_POS            (24U)
#define RF_PA_LDO_BM_LEN            (3U)
#define RF_PA_LDO_BM_MSK            (((1U << RF_PA_LDO_BM_LEN) - 1) << RF_PA_LDO_BM_POS)
#define RF_PA_LDO_BM_UMSK           (~(((1U << RF_PA_LDO_BM_LEN) - 1) << RF_PA_LDO_BM_POS))
#define RF_PA_LP_EN                 RF_PA_LP_EN
#define RF_PA_LP_EN_POS             (28U)
#define RF_PA_LP_EN_LEN             (1U)
#define RF_PA_LP_EN_MSK             (((1U << RF_PA_LP_EN_LEN) - 1) << RF_PA_LP_EN_POS)
#define RF_PA_LP_EN_UMSK            (~(((1U << RF_PA_LP_EN_LEN) - 1) << RF_PA_LP_EN_POS))
#define RF_PA_HP_EN                 RF_PA_HP_EN
#define RF_PA_HP_EN_POS             (29U)
#define RF_PA_HP_EN_LEN             (1U)
#define RF_PA_HP_EN_MSK             (((1U << RF_PA_HP_EN_LEN) - 1) << RF_PA_HP_EN_POS)
#define RF_PA_HP_EN_UMSK            (~(((1U << RF_PA_HP_EN_LEN) - 1) << RF_PA_HP_EN_POS))
#define RF_PA_FORCE_SHORT_OPEN      RF_PA_FORCE_SHORT_OPEN
#define RF_PA_FORCE_SHORT_OPEN_POS  (30U)
#define RF_PA_FORCE_SHORT_OPEN_LEN  (1U)
#define RF_PA_FORCE_SHORT_OPEN_MSK  (((1U << RF_PA_FORCE_SHORT_OPEN_LEN) - 1) << RF_PA_FORCE_SHORT_OPEN_POS)
#define RF_PA_FORCE_SHORT_OPEN_UMSK (~(((1U << RF_PA_FORCE_SHORT_OPEN_LEN) - 1) << RF_PA_FORCE_SHORT_OPEN_POS))

/* 0x208 : LNA mixer register */
#define RF_LNA_MX_OFFSET      (0x208)
#define RF_RMX_BM             RF_RMX_BM
#define RF_RMX_BM_POS         (0U)
#define RF_RMX_BM_LEN         (3U)
#define RF_RMX_BM_MSK         (((1U << RF_RMX_BM_LEN) - 1) << RF_RMX_BM_POS)
#define RF_RMX_BM_UMSK        (~(((1U << RF_RMX_BM_LEN) - 1) << RF_RMX_BM_POS))
#define RF_LNA_RFB_MATCH      RF_LNA_RFB_MATCH
#define RF_LNA_RFB_MATCH_POS  (3U)
#define RF_LNA_RFB_MATCH_LEN  (3U)
#define RF_LNA_RFB_MATCH_MSK  (((1U << RF_LNA_RFB_MATCH_LEN) - 1) << RF_LNA_RFB_MATCH_POS)
#define RF_LNA_RFB_MATCH_UMSK (~(((1U << RF_LNA_RFB_MATCH_LEN) - 1) << RF_LNA_RFB_MATCH_POS))
#define RF_LNA_VDD13_SEL      RF_LNA_VDD13_SEL
#define RF_LNA_VDD13_SEL_POS  (6U)
#define RF_LNA_VDD13_SEL_LEN  (2U)
#define RF_LNA_VDD13_SEL_MSK  (((1U << RF_LNA_VDD13_SEL_LEN) - 1) << RF_LNA_VDD13_SEL_POS)
#define RF_LNA_VDD13_SEL_UMSK (~(((1U << RF_LNA_VDD13_SEL_LEN) - 1) << RF_LNA_VDD13_SEL_POS))
#define RF_LNA_LOAD_CSW       RF_LNA_LOAD_CSW
#define RF_LNA_LOAD_CSW_POS   (8U)
#define RF_LNA_LOAD_CSW_LEN   (4U)
#define RF_LNA_LOAD_CSW_MSK   (((1U << RF_LNA_LOAD_CSW_LEN) - 1) << RF_LNA_LOAD_CSW_POS)
#define RF_LNA_LOAD_CSW_UMSK  (~(((1U << RF_LNA_LOAD_CSW_LEN) - 1) << RF_LNA_LOAD_CSW_POS))
#define RF_LNA_LG_GSEL        RF_LNA_LG_GSEL
#define RF_LNA_LG_GSEL_POS    (12U)
#define RF_LNA_LG_GSEL_LEN    (3U)
#define RF_LNA_LG_GSEL_MSK    (((1U << RF_LNA_LG_GSEL_LEN) - 1) << RF_LNA_LG_GSEL_POS)
#define RF_LNA_LG_GSEL_UMSK   (~(((1U << RF_LNA_LG_GSEL_LEN) - 1) << RF_LNA_LG_GSEL_POS))
#define RF_LNA_CAP_MATCH      RF_LNA_CAP_MATCH
#define RF_LNA_CAP_MATCH_POS  (15U)
#define RF_LNA_CAP_MATCH_LEN  (3U)
#define RF_LNA_CAP_MATCH_MSK  (((1U << RF_LNA_CAP_MATCH_LEN) - 1) << RF_LNA_CAP_MATCH_POS)
#define RF_LNA_CAP_MATCH_UMSK (~(((1U << RF_LNA_CAP_MATCH_LEN) - 1) << RF_LNA_CAP_MATCH_POS))
#define RF_LNA_CAP_LG         RF_LNA_CAP_LG
#define RF_LNA_CAP_LG_POS     (18U)
#define RF_LNA_CAP_LG_LEN     (2U)
#define RF_LNA_CAP_LG_MSK     (((1U << RF_LNA_CAP_LG_LEN) - 1) << RF_LNA_CAP_LG_POS)
#define RF_LNA_CAP_LG_UMSK    (~(((1U << RF_LNA_CAP_LG_LEN) - 1) << RF_LNA_CAP_LG_POS))
#define RF_LNA_BM_LG          RF_LNA_BM_LG
#define RF_LNA_BM_LG_POS      (20U)
#define RF_LNA_BM_LG_LEN      (4U)
#define RF_LNA_BM_LG_MSK      (((1U << RF_LNA_BM_LG_LEN) - 1) << RF_LNA_BM_LG_POS)
#define RF_LNA_BM_LG_UMSK     (~(((1U << RF_LNA_BM_LG_LEN) - 1) << RF_LNA_BM_LG_POS))
#define RF_LNA_BM_HG          RF_LNA_BM_HG
#define RF_LNA_BM_HG_POS      (24U)
#define RF_LNA_BM_HG_LEN      (4U)
#define RF_LNA_BM_HG_MSK      (((1U << RF_LNA_BM_HG_LEN) - 1) << RF_LNA_BM_HG_POS)
#define RF_LNA_BM_HG_UMSK     (~(((1U << RF_LNA_BM_HG_LEN) - 1) << RF_LNA_BM_HG_POS))
#define RF_LNA_BM_HW          RF_LNA_BM_HW
#define RF_LNA_BM_HW_POS      (28U)
#define RF_LNA_BM_HW_LEN      (4U)
#define RF_LNA_BM_HW_MSK      (((1U << RF_LNA_BM_HW_LEN) - 1) << RF_LNA_BM_HW_POS)
#define RF_LNA_BM_HW_UMSK     (~(((1U << RF_LNA_BM_HW_LEN) - 1) << RF_LNA_BM_HW_POS))

/* 0x20C : rbb_rosdac */
#define RF_RBB_ROSDAC_OFFSET (0x20C)
#define RF_ROSDAC_Q_HW       RF_ROSDAC_Q_HW
#define RF_ROSDAC_Q_HW_POS   (0U)
#define RF_ROSDAC_Q_HW_LEN   (6U)
#define RF_ROSDAC_Q_HW_MSK   (((1U << RF_ROSDAC_Q_HW_LEN) - 1) << RF_ROSDAC_Q_HW_POS)
#define RF_ROSDAC_Q_HW_UMSK  (~(((1U << RF_ROSDAC_Q_HW_LEN) - 1) << RF_ROSDAC_Q_HW_POS))
#define RF_ROSDAC_I_HW       RF_ROSDAC_I_HW
#define RF_ROSDAC_I_HW_POS   (8U)
#define RF_ROSDAC_I_HW_LEN   (6U)
#define RF_ROSDAC_I_HW_MSK   (((1U << RF_ROSDAC_I_HW_LEN) - 1) << RF_ROSDAC_I_HW_POS)
#define RF_ROSDAC_I_HW_UMSK  (~(((1U << RF_ROSDAC_I_HW_LEN) - 1) << RF_ROSDAC_I_HW_POS))
#define RF_ROSDAC_Q          RF_ROSDAC_Q
#define RF_ROSDAC_Q_POS      (16U)
#define RF_ROSDAC_Q_LEN      (6U)
#define RF_ROSDAC_Q_MSK      (((1U << RF_ROSDAC_Q_LEN) - 1) << RF_ROSDAC_Q_POS)
#define RF_ROSDAC_Q_UMSK     (~(((1U << RF_ROSDAC_Q_LEN) - 1) << RF_ROSDAC_Q_POS))
#define RF_ROSDAC_I          RF_ROSDAC_I
#define RF_ROSDAC_I_POS      (24U)
#define RF_ROSDAC_I_LEN      (6U)
#define RF_ROSDAC_I_MSK      (((1U << RF_ROSDAC_I_LEN) - 1) << RF_ROSDAC_I_POS)
#define RF_ROSDAC_I_UMSK     (~(((1U << RF_ROSDAC_I_LEN) - 1) << RF_ROSDAC_I_POS))

/* 0x210 : rbb_cap_1 */
#define RF_RBB_CAP_1_OFFSET   (0x210)
#define RF_RBB_CAP2_FC_Q      RF_RBB_CAP2_FC_Q
#define RF_RBB_CAP2_FC_Q_POS  (0U)
#define RF_RBB_CAP2_FC_Q_LEN  (6U)
#define RF_RBB_CAP2_FC_Q_MSK  (((1U << RF_RBB_CAP2_FC_Q_LEN) - 1) << RF_RBB_CAP2_FC_Q_POS)
#define RF_RBB_CAP2_FC_Q_UMSK (~(((1U << RF_RBB_CAP2_FC_Q_LEN) - 1) << RF_RBB_CAP2_FC_Q_POS))
#define RF_RBB_CAP2_FC_I      RF_RBB_CAP2_FC_I
#define RF_RBB_CAP2_FC_I_POS  (8U)
#define RF_RBB_CAP2_FC_I_LEN  (6U)
#define RF_RBB_CAP2_FC_I_MSK  (((1U << RF_RBB_CAP2_FC_I_LEN) - 1) << RF_RBB_CAP2_FC_I_POS)
#define RF_RBB_CAP2_FC_I_UMSK (~(((1U << RF_RBB_CAP2_FC_I_LEN) - 1) << RF_RBB_CAP2_FC_I_POS))
#define RF_RBB_CAP1_FC_Q      RF_RBB_CAP1_FC_Q
#define RF_RBB_CAP1_FC_Q_POS  (16U)
#define RF_RBB_CAP1_FC_Q_LEN  (6U)
#define RF_RBB_CAP1_FC_Q_MSK  (((1U << RF_RBB_CAP1_FC_Q_LEN) - 1) << RF_RBB_CAP1_FC_Q_POS)
#define RF_RBB_CAP1_FC_Q_UMSK (~(((1U << RF_RBB_CAP1_FC_Q_LEN) - 1) << RF_RBB_CAP1_FC_Q_POS))
#define RF_RBB_CAP1_FC_I      RF_RBB_CAP1_FC_I
#define RF_RBB_CAP1_FC_I_POS  (24U)
#define RF_RBB_CAP1_FC_I_LEN  (6U)
#define RF_RBB_CAP1_FC_I_MSK  (((1U << RF_RBB_CAP1_FC_I_LEN) - 1) << RF_RBB_CAP1_FC_I_POS)
#define RF_RBB_CAP1_FC_I_UMSK (~(((1U << RF_RBB_CAP1_FC_I_LEN) - 1) << RF_RBB_CAP1_FC_I_POS))

