bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x214 : rbb_cap_2 */
#define RF_RBB_CAP_2_OFFSET      (0x214)
#define RF_RBB_CAP2_FC_Q_HW      RF_RBB_CAP2_FC_Q_HW
#define RF_RBB_CAP2_FC_Q_HW_POS  (0U)
#define RF_RBB_CAP2_FC_Q_HW_LEN  (6U)
#define RF_RBB_CAP2_FC_Q_HW_MSK  (((1U << RF_RBB_CAP2_FC_Q_HW_LEN) - 1) << RF_RBB_CAP2_FC_Q_HW_POS)
#define RF_RBB_CAP2_FC_Q_HW_UMSK (~(((1U << RF_RBB_CAP2_FC_Q_HW_LEN) - 1) << RF_RBB_CAP2_FC_Q_HW_POS))
#define RF_RBB_CAP2_FC_I_HW      RF_RBB_CAP2_FC_I_HW
#define RF_RBB_CAP2_FC_I_HW_POS  (8U)
#define RF_RBB_CAP2_FC_I_HW_LEN  (6U)
#define RF_RBB_CAP2_FC_I_HW_MSK  (((1U << RF_RBB_CAP2_FC_I_HW_LEN) - 1) << RF_RBB_CAP2_FC_I_HW_POS)
#define RF_RBB_CAP2_FC_I_HW_UMSK (~(((1U << RF_RBB_CAP2_FC_I_HW_LEN) - 1) << RF_RBB_CAP2_FC_I_HW_POS))
#define RF_RBB_CAP1_FC_Q_HW      RF_RBB_CAP1_FC_Q_HW
#define RF_RBB_CAP1_FC_Q_HW_POS  (16U)
#define RF_RBB_CAP1_FC_Q_HW_LEN  (6U)
#define RF_RBB_CAP1_FC_Q_HW_MSK  (((1U << RF_RBB_CAP1_FC_Q_HW_LEN) - 1) << RF_RBB_CAP1_FC_Q_HW_POS)
#define RF_RBB_CAP1_FC_Q_HW_UMSK (~(((1U << RF_RBB_CAP1_FC_Q_HW_LEN) - 1) << RF_RBB_CAP1_FC_Q_HW_POS))
#define RF_RBB_CAP1_FC_I_HW      RF_RBB_CAP1_FC_I_HW
#define RF_RBB_CAP1_FC_I_HW_POS  (24U)
#define RF_RBB_CAP1_FC_I_HW_LEN  (6U)
#define RF_RBB_CAP1_FC_I_HW_MSK  (((1U << RF_RBB_CAP1_FC_I_HW_LEN) - 1) << RF_RBB_CAP1_FC_I_HW_POS)
#define RF_RBB_CAP1_FC_I_HW_UMSK (~(((1U << RF_RBB_CAP1_FC_I_HW_LEN) - 1) << RF_RBB_CAP1_FC_I_HW_POS))

/* 0x218 : rbb_cap_3 */
#define RF_RBB_CAP_3_OFFSET       (0x218)
#define RF_RBB_CAP2_FC_Q_BW0      RF_RBB_CAP2_FC_Q_BW0
#define RF_RBB_CAP2_FC_Q_BW0_POS  (0U)
#define RF_RBB_CAP2_FC_Q_BW0_LEN  (6U)
#define RF_RBB_CAP2_FC_Q_BW0_MSK  (((1U << RF_RBB_CAP2_FC_Q_BW0_LEN) - 1) << RF_RBB_CAP2_FC_Q_BW0_POS)
#define RF_RBB_CAP2_FC_Q_BW0_UMSK (~(((1U << RF_RBB_CAP2_FC_Q_BW0_LEN) - 1) << RF_RBB_CAP2_FC_Q_BW0_POS))
#define RF_RBB_CAP2_FC_I_BW0      RF_RBB_CAP2_FC_I_BW0
#define RF_RBB_CAP2_FC_I_BW0_POS  (8U)
#define RF_RBB_CAP2_FC_I_BW0_LEN  (6U)
#define RF_RBB_CAP2_FC_I_BW0_MSK  (((1U << RF_RBB_CAP2_FC_I_BW0_LEN) - 1) << RF_RBB_CAP2_FC_I_BW0_POS)
#define RF_RBB_CAP2_FC_I_BW0_UMSK (~(((1U << RF_RBB_CAP2_FC_I_BW0_LEN) - 1) << RF_RBB_CAP2_FC_I_BW0_POS))
#define RF_RBB_CAP1_FC_Q_BW0      RF_RBB_CAP1_FC_Q_BW0
#define RF_RBB_CAP1_FC_Q_BW0_POS  (16U)
#define RF_RBB_CAP1_FC_Q_BW0_LEN  (6U)
#define RF_RBB_CAP1_FC_Q_BW0_MSK  (((1U << RF_RBB_CAP1_FC_Q_BW0_LEN) - 1) << RF_RBB_CAP1_FC_Q_BW0_POS)
#define RF_RBB_CAP1_FC_Q_BW0_UMSK (~(((1U << RF_RBB_CAP1_FC_Q_BW0_LEN) - 1) << RF_RBB_CAP1_FC_Q_BW0_POS))
#define RF_RBB_CAP1_FC_I_BW0      RF_RBB_CAP1_FC_I_BW0
#define RF_RBB_CAP1_FC_I_BW0_POS  (24U)
#define RF_RBB_CAP1_FC_I_BW0_LEN  (6U)
#define RF_RBB_CAP1_FC_I_BW0_MSK  (((1U << RF_RBB_CAP1_FC_I_BW0_LEN) - 1) << RF_RBB_CAP1_FC_I_BW0_POS)
#define RF_RBB_CAP1_FC_I_BW0_UMSK (~(((1U << RF_RBB_CAP1_FC_I_BW0_LEN) - 1) << RF_RBB_CAP1_FC_I_BW0_POS))

/* 0x21C : rbb_cap4 */
#define RF_RBB_CAP4_OFFSET        (0x21C)
#define RF_RBB_CAP2_FC_Q_BW1      RF_RBB_CAP2_FC_Q_BW1
#define RF_RBB_CAP2_FC_Q_BW1_POS  (0U)
#define RF_RBB_CAP2_FC_Q_BW1_LEN  (6U)
#define RF_RBB_CAP2_FC_Q_BW1_MSK  (((1U << RF_RBB_CAP2_FC_Q_BW1_LEN) - 1) << RF_RBB_CAP2_FC_Q_BW1_POS)
#define RF_RBB_CAP2_FC_Q_BW1_UMSK (~(((1U << RF_RBB_CAP2_FC_Q_BW1_LEN) - 1) << RF_RBB_CAP2_FC_Q_BW1_POS))
#define RF_RBB_CAP2_FC_I_BW1      RF_RBB_CAP2_FC_I_BW1
#define RF_RBB_CAP2_FC_I_BW1_POS  (8U)
#define RF_RBB_CAP2_FC_I_BW1_LEN  (6U)
#define RF_RBB_CAP2_FC_I_BW1_MSK  (((1U << RF_RBB_CAP2_FC_I_BW1_LEN) - 1) << RF_RBB_CAP2_FC_I_BW1_POS)
#define RF_RBB_CAP2_FC_I_BW1_UMSK (~(((1U << RF_RBB_CAP2_FC_I_BW1_LEN) - 1) << RF_RBB_CAP2_FC_I_BW1_POS))
#define RF_RBB_CAP1_FC_Q_BW1      RF_RBB_CAP1_FC_Q_BW1
#define RF_RBB_CAP1_FC_Q_BW1_POS  (16U)
#define RF_RBB_CAP1_FC_Q_BW1_LEN  (6U)
#define RF_RBB_CAP1_FC_Q_BW1_MSK  (((1U << RF_RBB_CAP1_FC_Q_BW1_LEN) - 1) << RF_RBB_CAP1_FC_Q_BW1_POS)
#define RF_RBB_CAP1_FC_Q_BW1_UMSK (~(((1U << RF_RBB_CAP1_FC_Q_BW1_LEN) - 1) << RF_RBB_CAP1_FC_Q_BW1_POS))
#define RF_RBB_CAP1_FC_I_BW1      RF_RBB_CAP1_FC_I_BW1
#define RF_RBB_CAP1_FC_I_BW1_POS  (24U)
#define RF_RBB_CAP1_FC_I_BW1_LEN  (6U)
#define RF_RBB_CAP1_FC_I_BW1_MSK  (((1U << RF_RBB_CAP1_FC_I_BW1_LEN) - 1) << RF_RBB_CAP1_FC_I_BW1_POS)
#define RF_RBB_CAP1_FC_I_BW1_UMSK (~(((1U << RF_RBB_CAP1_FC_I_BW1_LEN) - 1) << RF_RBB_CAP1_FC_I_BW1_POS))

/* 0x220 : rbb_rx */
#define RF_RBB_RX_OFFSET    (0x220)
#define RF_RBB_RX2_BW1      RF_RBB_RX2_BW1
#define RF_RBB_RX2_BW1_POS  (0U)
#define RF_RBB_RX2_BW1_LEN  (3U)
#define RF_RBB_RX2_BW1_MSK  (((1U << RF_RBB_RX2_BW1_LEN) - 1) << RF_RBB_RX2_BW1_POS)
#define RF_RBB_RX2_BW1_UMSK (~(((1U << RF_RBB_RX2_BW1_LEN) - 1) << RF_RBB_RX2_BW1_POS))
#define RF_RBB_RX1_BW1      RF_RBB_RX1_BW1
#define RF_RBB_RX1_BW1_POS  (4U)
#define RF_RBB_RX1_BW1_LEN  (3U)
#define RF_RBB_RX1_BW1_MSK  (((1U << RF_RBB_RX1_BW1_LEN) - 1) << RF_RBB_RX1_BW1_POS)
#define RF_RBB_RX1_BW1_UMSK (~(((1U << RF_RBB_RX1_BW1_LEN) - 1) << RF_RBB_RX1_BW1_POS))
#define RF_RBB_RX2_BW0      RF_RBB_RX2_BW0
#define RF_RBB_RX2_BW0_POS  (8U)
#define RF_RBB_RX2_BW0_LEN  (3U)
#define RF_RBB_RX2_BW0_MSK  (((1U << RF_RBB_RX2_BW0_LEN) - 1) << RF_RBB_RX2_BW0_POS)
#define RF_RBB_RX2_BW0_UMSK (~(((1U << RF_RBB_RX2_BW0_LEN) - 1) << RF_RBB_RX2_BW0_POS))
#define RF_RBB_RX1_BW0      RF_RBB_RX1_BW0
#define RF_RBB_RX1_BW0_POS  (12U)
#define RF_RBB_RX1_BW0_LEN  (3U)
#define RF_RBB_RX1_BW0_MSK  (((1U << RF_RBB_RX1_BW0_LEN) - 1) << RF_RBB_RX1_BW0_POS)
#define RF_RBB_RX1_BW0_UMSK (~(((1U << RF_RBB_RX1_BW0_LEN) - 1) << RF_RBB_RX1_BW0_POS))
#define RF_RBB_RX2_HW       RF_RBB_RX2_HW
#define RF_RBB_RX2_HW_POS   (16U)
#define RF_RBB_RX2_HW_LEN   (3U)
#define RF_RBB_RX2_HW_MSK   (((1U << RF_RBB_RX2_HW_LEN) - 1) << RF_RBB_RX2_HW_POS)
#define RF_RBB_RX2_HW_UMSK  (~(((1U << RF_RBB_RX2_HW_LEN) - 1) << RF_RBB_RX2_HW_POS))
#define RF_RBB_RX1_HW       RF_RBB_RX1_HW
#define RF_RBB_RX1_HW_POS   (20U)
#define RF_RBB_RX1_HW_LEN   (3U)
#define RF_RBB_RX1_HW_MSK   (((1U << RF_RBB_RX1_HW_LEN) - 1) << RF_RBB_RX1_HW_POS)
#define RF_RBB_RX1_HW_UMSK  (~(((1U << RF_RBB_RX1_HW_LEN) - 1) << RF_RBB_RX1_HW_POS))
#define RF_RBB_RX2          RF_RBB_RX2
#define RF_RBB_RX2_POS      (24U)
#define RF_RBB_RX2_LEN      (3U)
#define RF_RBB_RX2_MSK      (((1U << RF_RBB_RX2_LEN) - 1) << RF_RBB_RX2_POS)
#define RF_RBB_RX2_UMSK     (~(((1U << RF_RBB_RX2_LEN) - 1) << RF_RBB_RX2_POS))
#define RF_RBB_RX1          RF_RBB_RX1
#define RF_RBB_RX1_POS      (28U)
#define RF_RBB_RX1_LEN      (3U)
#define RF_RBB_RX1_MSK      (((1U << RF_RBB_RX1_LEN) - 1) << RF_RBB_RX1_POS)
#define RF_RBB_RX1_UMSK     (~(((1U << RF_RBB_RX1_LEN) - 1) << RF_RBB_RX1_POS))

