bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x224 : rbb */
#define RF_RBB_OFFSET                      (0x224)
#define RF_PKDET_OUT_LATCH                 RF_PKDET_OUT_LATCH
#define RF_PKDET_OUT_LATCH_POS             (0U)
#define RF_PKDET_OUT_LATCH_LEN             (1U)
#define RF_PKDET_OUT_LATCH_MSK             (((1U << RF_PKDET_OUT_LATCH_LEN) - 1) << RF_PKDET_OUT_LATCH_POS)
#define RF_PKDET_OUT_LATCH_UMSK            (~(((1U << RF_PKDET_OUT_LATCH_LEN) - 1) << RF_PKDET_OUT_LATCH_POS))
#define RF_PKDET_OUT_RAW                   RF_PKDET_OUT_RAW
#define RF_PKDET_OUT_RAW_POS               (1U)
#define RF_PKDET_OUT_RAW_LEN               (1U)
#define RF_PKDET_OUT_RAW_MSK               (((1U << RF_PKDET_OUT_RAW_LEN) - 1) << RF_PKDET_OUT_RAW_POS)
#define RF_PKDET_OUT_RAW_UMSK              (~(((1U << RF_PKDET_OUT_RAW_LEN) - 1) << RF_PKDET_OUT_RAW_POS))
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW      RF_RBB_PKDET_OUT_RSTN_CTRL_HW
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS  (4U)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN  (1U)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_MSK  (((1U << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_UMSK (~(((1U << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS))
#define RF_RBB_PKDET_OUT_RSTN_HW           RF_RBB_PKDET_OUT_RSTN_HW
#define RF_RBB_PKDET_OUT_RSTN_HW_POS       (5U)
#define RF_RBB_PKDET_OUT_RSTN_HW_LEN       (1U)
#define RF_RBB_PKDET_OUT_RSTN_HW_MSK       (((1U << RF_RBB_PKDET_OUT_RSTN_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_HW_POS)
#define RF_RBB_PKDET_OUT_RSTN_HW_UMSK      (~(((1U << RF_RBB_PKDET_OUT_RSTN_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_HW_POS))
#define RF_RBB_PKDET_OUT_RSTN              RF_RBB_PKDET_OUT_RSTN
#define RF_RBB_PKDET_OUT_RSTN_POS          (6U)
#define RF_RBB_PKDET_OUT_RSTN_LEN          (1U)
#define RF_RBB_PKDET_OUT_RSTN_MSK          (((1U << RF_RBB_PKDET_OUT_RSTN_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_POS)
#define RF_RBB_PKDET_OUT_RSTN_UMSK         (~(((1U << RF_RBB_PKDET_OUT_RSTN_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_POS))
#define RF_RBB_PKDET_EN_CTRL_HW            RF_RBB_PKDET_EN_CTRL_HW
#define RF_RBB_PKDET_EN_CTRL_HW_POS        (8U)
#define RF_RBB_PKDET_EN_CTRL_HW_LEN        (1U)
#define RF_RBB_PKDET_EN_CTRL_HW_MSK        (((1U << RF_RBB_PKDET_EN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_EN_CTRL_HW_POS)
#define RF_RBB_PKDET_EN_CTRL_HW_UMSK       (~(((1U << RF_RBB_PKDET_EN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_EN_CTRL_HW_POS))
#define RF_RBB_PKDET_EN_HW                 RF_RBB_PKDET_EN_HW
#define RF_RBB_PKDET_EN_HW_POS             (9U)
#define RF_RBB_PKDET_EN_HW_LEN             (1U)
#define RF_RBB_PKDET_EN_HW_MSK             (((1U << RF_RBB_PKDET_EN_HW_LEN) - 1) << RF_RBB_PKDET_EN_HW_POS)
#define RF_RBB_PKDET_EN_HW_UMSK            (~(((1U << RF_RBB_PKDET_EN_HW_LEN) - 1) << RF_RBB_PKDET_EN_HW_POS))
#define RF_RBB_PKDET_EN                    RF_RBB_PKDET_EN
#define RF_RBB_PKDET_EN_POS                (10U)
#define RF_RBB_PKDET_EN_LEN                (1U)
#define RF_RBB_PKDET_EN_MSK                (((1U << RF_RBB_PKDET_EN_LEN) - 1) << RF_RBB_PKDET_EN_POS)
#define RF_RBB_PKDET_EN_UMSK               (~(((1U << RF_RBB_PKDET_EN_LEN) - 1) << RF_RBB_PKDET_EN_POS))
#define RF_RBB_PKDET_VTH                   RF_RBB_PKDET_VTH
#define RF_RBB_PKDET_VTH_POS               (12U)
#define RF_RBB_PKDET_VTH_LEN               (4U)
#define RF_RBB_PKDET_VTH_MSK               (((1U << RF_RBB_PKDET_VTH_LEN) - 1) << RF_RBB_PKDET_VTH_POS)
#define RF_RBB_PKDET_VTH_UMSK              (~(((1U << RF_RBB_PKDET_VTH_LEN) - 1) << RF_RBB_PKDET_VTH_POS))
#define RF_ROSDAC_RANGE                    RF_ROSDAC_RANGE
#define RF_ROSDAC_RANGE_POS                (16U)
#define RF_ROSDAC_RANGE_LEN                (2U)
#define RF_ROSDAC_RANGE_MSK                (((1U << RF_ROSDAC_RANGE_LEN) - 1) << RF_ROSDAC_RANGE_POS)
#define RF_ROSDAC_RANGE_UMSK               (~(((1U << RF_ROSDAC_RANGE_LEN) - 1) << RF_ROSDAC_RANGE_POS))
#define RF_RBB_LPF_EN                      RF_RBB_LPF_EN
#define RF_RBB_LPF_EN_POS                  (19U)
#define RF_RBB_LPF_EN_LEN                  (1U)
#define RF_RBB_LPF_EN_MSK                  (((1U << RF_RBB_LPF_EN_LEN) - 1) << RF_RBB_LPF_EN_POS)
#define RF_RBB_LPF_EN_UMSK                 (~(((1U << RF_RBB_LPF_EN_LEN) - 1) << RF_RBB_LPF_EN_POS))
#define RF_RBB_DEQ                         RF_RBB_DEQ
#define RF_RBB_DEQ_POS                     (20U)
#define RF_RBB_DEQ_LEN                     (2U)
#define RF_RBB_DEQ_MSK                     (((1U << RF_RBB_DEQ_LEN) - 1) << RF_RBB_DEQ_POS)
#define RF_RBB_DEQ_UMSK                    (~(((1U << RF_RBB_DEQ_LEN) - 1) << RF_RBB_DEQ_POS))
#define RF_RBB_VCM                         RF_RBB_VCM
#define RF_RBB_VCM_POS                     (24U)
#define RF_RBB_VCM_LEN                     (2U)
#define RF_RBB_VCM_MSK                     (((1U << RF_RBB_VCM_LEN) - 1) << RF_RBB_VCM_POS)
#define RF_RBB_VCM_UMSK                    (~(((1U << RF_RBB_VCM_LEN) - 1) << RF_RBB_VCM_POS))
#define RF_RBB_BM_OP                       RF_RBB_BM_OP
#define RF_RBB_BM_OP_POS                   (28U)
#define RF_RBB_BM_OP_LEN                   (2U)
#define RF_RBB_BM_OP_MSK                   (((1U << RF_RBB_BM_OP_LEN) - 1) << RF_RBB_BM_OP_POS)
#define RF_RBB_BM_OP_UMSK                  (~(((1U << RF_RBB_BM_OP_LEN) - 1) << RF_RBB_BM_OP_POS))

/* 0x228 : rxadc */
#define RF_RXADC_OFFSET             (0x228)
#define RF_RXADC_OSCAL_EN           RF_RXADC_OSCAL_EN
#define RF_RXADC_OSCAL_EN_POS       (0U)
#define RF_RXADC_OSCAL_EN_LEN       (1U)
#define RF_RXADC_OSCAL_EN_MSK       (((1U << RF_RXADC_OSCAL_EN_LEN) - 1) << RF_RXADC_OSCAL_EN_POS)
#define RF_RXADC_OSCAL_EN_UMSK      (~(((1U << RF_RXADC_OSCAL_EN_LEN) - 1) << RF_RXADC_OSCAL_EN_POS))
#define RF_RXADC_VREF_SEL           RF_RXADC_VREF_SEL
#define RF_RXADC_VREF_SEL_POS       (4U)
#define RF_RXADC_VREF_SEL_LEN       (2U)
#define RF_RXADC_VREF_SEL_MSK       (((1U << RF_RXADC_VREF_SEL_LEN) - 1) << RF_RXADC_VREF_SEL_POS)
#define RF_RXADC_VREF_SEL_UMSK      (~(((1U << RF_RXADC_VREF_SEL_LEN) - 1) << RF_RXADC_VREF_SEL_POS))
#define RF_RXADC_CLK_SYNC_INV       RF_RXADC_CLK_SYNC_INV
#define RF_RXADC_CLK_SYNC_INV_POS   (8U)
#define RF_RXADC_CLK_SYNC_INV_LEN   (1U)
#define RF_RXADC_CLK_SYNC_INV_MSK   (((1U << RF_RXADC_CLK_SYNC_INV_LEN) - 1) << RF_RXADC_CLK_SYNC_INV_POS)
#define RF_RXADC_CLK_SYNC_INV_UMSK  (~(((1U << RF_RXADC_CLK_SYNC_INV_LEN) - 1) << RF_RXADC_CLK_SYNC_INV_POS))
#define RF_RXADC_CLK_INV            RF_RXADC_CLK_INV
#define RF_RXADC_CLK_INV_POS        (12U)
#define RF_RXADC_CLK_INV_LEN        (1U)
#define RF_RXADC_CLK_INV_MSK        (((1U << RF_RXADC_CLK_INV_LEN) - 1) << RF_RXADC_CLK_INV_POS)
#define RF_RXADC_CLK_INV_UMSK       (~(((1U << RF_RXADC_CLK_INV_LEN) - 1) << RF_RXADC_CLK_INV_POS))
#define RF_RXADC_CLK_DIV_SEL        RF_RXADC_CLK_DIV_SEL
#define RF_RXADC_CLK_DIV_SEL_POS    (16U)
#define RF_RXADC_CLK_DIV_SEL_LEN    (1U)
#define RF_RXADC_CLK_DIV_SEL_MSK    (((1U << RF_RXADC_CLK_DIV_SEL_LEN) - 1) << RF_RXADC_CLK_DIV_SEL_POS)
#define RF_RXADC_CLK_DIV_SEL_UMSK   (~(((1U << RF_RXADC_CLK_DIV_SEL_LEN) - 1) << RF_RXADC_CLK_DIV_SEL_POS))
#define RF_RXADC_GLITCH_REMOVE      RF_RXADC_GLITCH_REMOVE
#define RF_RXADC_GLITCH_REMOVE_POS  (20U)
#define RF_RXADC_GLITCH_REMOVE_LEN  (1U)
#define RF_RXADC_GLITCH_REMOVE_MSK  (((1U << RF_RXADC_GLITCH_REMOVE_LEN) - 1) << RF_RXADC_GLITCH_REMOVE_POS)
#define RF_RXADC_GLITCH_REMOVE_UMSK (~(((1U << RF_RXADC_GLITCH_REMOVE_LEN) - 1) << RF_RXADC_GLITCH_REMOVE_POS))
#define RF_RXADC_DLY_CTRL           RF_RXADC_DLY_CTRL
#define RF_RXADC_DLY_CTRL_POS       (24U)
#define RF_RXADC_DLY_CTRL_LEN       (2U)
#define RF_RXADC_DLY_CTRL_MSK       (((1U << RF_RXADC_DLY_CTRL_LEN) - 1) << RF_RXADC_DLY_CTRL_POS)
#define RF_RXADC_DLY_CTRL_UMSK      (~(((1U << RF_RXADC_DLY_CTRL_LEN) - 1) << RF_RXADC_DLY_CTRL_POS))

