bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x22C : rxadc_readback */
#define RF_RXADC_READBACK_OFFSET (0x22C)
#define RF_RXADC_DOUT_Q          RF_RXADC_DOUT_Q
#define RF_RXADC_DOUT_Q_POS      (0U)
#define RF_RXADC_DOUT_Q_LEN      (9U)
#define RF_RXADC_DOUT_Q_MSK      (((1U << RF_RXADC_DOUT_Q_LEN) - 1) << RF_RXADC_DOUT_Q_POS)
#define RF_RXADC_DOUT_Q_UMSK     (~(((1U << RF_RXADC_DOUT_Q_LEN) - 1) << RF_RXADC_DOUT_Q_POS))
#define RF_RXADC_DOUT_I          RF_RXADC_DOUT_I
#define RF_RXADC_DOUT_I_POS      (16U)
#define RF_RXADC_DOUT_I_LEN      (9U)
#define RF_RXADC_DOUT_I_MSK      (((1U << RF_RXADC_DOUT_I_LEN) - 1) << RF_RXADC_DOUT_I_POS)
#define RF_RXADC_DOUT_I_UMSK     (~(((1U << RF_RXADC_DOUT_I_LEN) - 1) << RF_RXADC_DOUT_I_POS))

/* 0x230 : rf_adc_osdata */
#define RF_ADC_OSDATA_OFFSET (0x230)
#define RF_RXADC_OS_Q        RF_RXADC_OS_Q
#define RF_RXADC_OS_Q_POS    (0U)
#define RF_RXADC_OS_Q_LEN    (9U)
#define RF_RXADC_OS_Q_MSK    (((1U << RF_RXADC_OS_Q_LEN) - 1) << RF_RXADC_OS_Q_POS)
#define RF_RXADC_OS_Q_UMSK   (~(((1U << RF_RXADC_OS_Q_LEN) - 1) << RF_RXADC_OS_Q_POS))
#define RF_RXADC_OS_I        RF_RXADC_OS_I
#define RF_RXADC_OS_I_POS    (16U)
#define RF_RXADC_OS_I_LEN    (9U)
#define RF_RXADC_OS_I_MSK    (((1U << RF_RXADC_OS_I_LEN) - 1) << RF_RXADC_OS_I_POS)
#define RF_RXADC_OS_I_UMSK   (~(((1U << RF_RXADC_OS_I_LEN) - 1) << RF_RXADC_OS_I_POS))

/* 0x234 : testbuf */
#define RF_TESTBUF_OFFSET     (0x234)
#define RF_TESTBUF_RIN        RF_TESTBUF_RIN
#define RF_TESTBUF_RIN_POS    (0U)
#define RF_TESTBUF_RIN_LEN    (1U)
#define RF_TESTBUF_RIN_MSK    (((1U << RF_TESTBUF_RIN_LEN) - 1) << RF_TESTBUF_RIN_POS)
#define RF_TESTBUF_RIN_UMSK   (~(((1U << RF_TESTBUF_RIN_LEN) - 1) << RF_TESTBUF_RIN_POS))
#define RF_TESTBUF_RFB        RF_TESTBUF_RFB
#define RF_TESTBUF_RFB_POS    (4U)
#define RF_TESTBUF_RFB_LEN    (1U)
#define RF_TESTBUF_RFB_MSK    (((1U << RF_TESTBUF_RFB_LEN) - 1) << RF_TESTBUF_RFB_POS)
#define RF_TESTBUF_RFB_UMSK   (~(((1U << RF_TESTBUF_RFB_LEN) - 1) << RF_TESTBUF_RFB_POS))
#define RF_TESTBUF_OP_CC      RF_TESTBUF_OP_CC
#define RF_TESTBUF_OP_CC_POS  (8U)
#define RF_TESTBUF_OP_CC_LEN  (4U)
#define RF_TESTBUF_OP_CC_MSK  (((1U << RF_TESTBUF_OP_CC_LEN) - 1) << RF_TESTBUF_OP_CC_POS)
#define RF_TESTBUF_OP_CC_UMSK (~(((1U << RF_TESTBUF_OP_CC_LEN) - 1) << RF_TESTBUF_OP_CC_POS))
#define RF_TESTBUF_BOOST      RF_TESTBUF_BOOST
#define RF_TESTBUF_BOOST_POS  (12U)
#define RF_TESTBUF_BOOST_LEN  (1U)
#define RF_TESTBUF_BOOST_MSK  (((1U << RF_TESTBUF_BOOST_LEN) - 1) << RF_TESTBUF_BOOST_POS)
#define RF_TESTBUF_BOOST_UMSK (~(((1U << RF_TESTBUF_BOOST_LEN) - 1) << RF_TESTBUF_BOOST_POS))
#define RF_TESTBUF_BM         RF_TESTBUF_BM
#define RF_TESTBUF_BM_POS     (16U)
#define RF_TESTBUF_BM_LEN     (3U)
#define RF_TESTBUF_BM_MSK     (((1U << RF_TESTBUF_BM_LEN) - 1) << RF_TESTBUF_BM_POS)
#define RF_TESTBUF_BM_UMSK    (~(((1U << RF_TESTBUF_BM_LEN) - 1) << RF_TESTBUF_BM_POS))
#define RF_TESTBUF_VCM        RF_TESTBUF_VCM
#define RF_TESTBUF_VCM_POS    (20U)
#define RF_TESTBUF_VCM_LEN    (2U)
#define RF_TESTBUF_VCM_MSK    (((1U << RF_TESTBUF_VCM_LEN) - 1) << RF_TESTBUF_VCM_POS)
#define RF_TESTBUF_VCM_UMSK   (~(((1U << RF_TESTBUF_VCM_LEN) - 1) << RF_TESTBUF_VCM_POS))
#define RF_PU_TESTBUF         RF_PU_TESTBUF
#define RF_PU_TESTBUF_POS     (24U)
#define RF_PU_TESTBUF_LEN     (1U)
#define RF_PU_TESTBUF_MSK     (((1U << RF_PU_TESTBUF_LEN) - 1) << RF_PU_TESTBUF_POS)
#define RF_PU_TESTBUF_UMSK    (~(((1U << RF_PU_TESTBUF_LEN) - 1) << RF_PU_TESTBUF_POS))

/* 0x238 : vco */
#define RF_VCO_OFFSET                  (0x238)
#define RF_VCO_SHORT_VBIAS_FILTER      RF_VCO_SHORT_VBIAS_FILTER
#define RF_VCO_SHORT_VBIAS_FILTER_POS  (0U)
#define RF_VCO_SHORT_VBIAS_FILTER_LEN  (1U)
#define RF_VCO_SHORT_VBIAS_FILTER_MSK  (((1U << RF_VCO_SHORT_VBIAS_FILTER_LEN) - 1) << RF_VCO_SHORT_VBIAS_FILTER_POS)
#define RF_VCO_SHORT_VBIAS_FILTER_UMSK (~(((1U << RF_VCO_SHORT_VBIAS_FILTER_LEN) - 1) << RF_VCO_SHORT_VBIAS_FILTER_POS))
#define RF_VCO_SHORT_IDAC_FILTER       RF_VCO_SHORT_IDAC_FILTER
#define RF_VCO_SHORT_IDAC_FILTER_POS   (1U)
#define RF_VCO_SHORT_IDAC_FILTER_LEN   (1U)
#define RF_VCO_SHORT_IDAC_FILTER_MSK   (((1U << RF_VCO_SHORT_IDAC_FILTER_LEN) - 1) << RF_VCO_SHORT_IDAC_FILTER_POS)
#define RF_VCO_SHORT_IDAC_FILTER_UMSK  (~(((1U << RF_VCO_SHORT_IDAC_FILTER_LEN) - 1) << RF_VCO_SHORT_IDAC_FILTER_POS))
#define RF_VCO_MODCAP_SEL              RF_VCO_MODCAP_SEL
#define RF_VCO_MODCAP_SEL_POS          (2U)
#define RF_VCO_MODCAP_SEL_LEN          (2U)
#define RF_VCO_MODCAP_SEL_MSK          (((1U << RF_VCO_MODCAP_SEL_LEN) - 1) << RF_VCO_MODCAP_SEL_POS)
#define RF_VCO_MODCAP_SEL_UMSK         (~(((1U << RF_VCO_MODCAP_SEL_LEN) - 1) << RF_VCO_MODCAP_SEL_POS))
#define RF_VCO_ACAL_VREF               RF_VCO_ACAL_VREF
#define RF_VCO_ACAL_VREF_POS           (4U)
#define RF_VCO_ACAL_VREF_LEN           (3U)
#define RF_VCO_ACAL_VREF_MSK           (((1U << RF_VCO_ACAL_VREF_LEN) - 1) << RF_VCO_ACAL_VREF_POS)
#define RF_VCO_ACAL_VREF_UMSK          (~(((1U << RF_VCO_ACAL_VREF_LEN) - 1) << RF_VCO_ACAL_VREF_POS))
#define RF_VCO_VBIAS                   RF_VCO_VBIAS
#define RF_VCO_VBIAS_POS               (8U)
#define RF_VCO_VBIAS_LEN               (2U)
#define RF_VCO_VBIAS_MSK               (((1U << RF_VCO_VBIAS_LEN) - 1) << RF_VCO_VBIAS_POS)
#define RF_VCO_VBIAS_UMSK              (~(((1U << RF_VCO_VBIAS_LEN) - 1) << RF_VCO_VBIAS_POS))
#define RF_VCO_IDAC_BOOST              RF_VCO_IDAC_BOOST
#define RF_VCO_IDAC_BOOST_POS          (12U)
#define RF_VCO_IDAC_BOOST_LEN          (1U)
#define RF_VCO_IDAC_BOOST_MSK          (((1U << RF_VCO_IDAC_BOOST_LEN) - 1) << RF_VCO_IDAC_BOOST_POS)
#define RF_VCO_IDAC_BOOST_UMSK         (~(((1U << RF_VCO_IDAC_BOOST_LEN) - 1) << RF_VCO_IDAC_BOOST_POS))
#define RF_VCO_LDO_VSEL                RF_VCO_LDO_VSEL
#define RF_VCO_LDO_VSEL_POS            (13U)
#define RF_VCO_LDO_VSEL_LEN            (2U)
#define RF_VCO_LDO_VSEL_MSK            (((1U << RF_VCO_LDO_VSEL_LEN) - 1) << RF_VCO_LDO_VSEL_POS)
#define RF_VCO_LDO_VSEL_UMSK           (~(((1U << RF_VCO_LDO_VSEL_LEN) - 1) << RF_VCO_LDO_VSEL_POS))
#define RF_VCO_LDO_BYPASS              RF_VCO_LDO_BYPASS
#define RF_VCO_LDO_BYPASS_POS          (15U)
#define RF_VCO_LDO_BYPASS_LEN          (1U)
#define RF_VCO_LDO_BYPASS_MSK          (((1U << RF_VCO_LDO_BYPASS_LEN) - 1) << RF_VCO_LDO_BYPASS_POS)
#define RF_VCO_LDO_BYPASS_UMSK         (~(((1U << RF_VCO_LDO_BYPASS_LEN) - 1) << RF_VCO_LDO_BYPASS_POS))
#define RF_VCO_IDAC                    RF_VCO_IDAC
#define RF_VCO_IDAC_POS                (16U)
#define RF_VCO_IDAC_LEN                (6U)
#define RF_VCO_IDAC_MSK                (((1U << RF_VCO_IDAC_LEN) - 1) << RF_VCO_IDAC_POS)
#define RF_VCO_IDAC_UMSK               (~(((1U << RF_VCO_IDAC_LEN) - 1) << RF_VCO_IDAC_POS))
#define RF_VCO_IDAC_HW                 RF_VCO_IDAC_HW
#define RF_VCO_IDAC_HW_POS             (24U)
#define RF_VCO_IDAC_HW_LEN             (6U)
#define RF_VCO_IDAC_HW_MSK             (((1U << RF_VCO_IDAC_HW_LEN) - 1) << RF_VCO_IDAC_HW_POS)
#define RF_VCO_IDAC_HW_UMSK            (~(((1U << RF_VCO_IDAC_HW_LEN) - 1) << RF_VCO_IDAC_HW_POS))
#define RF_VCO_ACAL_UD                 RF_VCO_ACAL_UD
#define RF_VCO_ACAL_UD_POS             (31U)
#define RF_VCO_ACAL_UD_LEN             (1U)
#define RF_VCO_ACAL_UD_MSK             (((1U << RF_VCO_ACAL_UD_LEN) - 1) << RF_VCO_ACAL_UD_POS)
#define RF_VCO_ACAL_UD_UMSK            (~(((1U << RF_VCO_ACAL_UD_LEN) - 1) << RF_VCO_ACAL_UD_POS))

/* 0x23C : lodist */
#define RF_LODIST_OFFSET                  (0x23C)
#define RF_LODIST_TXBUF_SUPPLY_MODE       RF_LODIST_TXBUF_SUPPLY_MODE
#define RF_LODIST_TXBUF_SUPPLY_MODE_POS   (0U)
#define RF_LODIST_TXBUF_SUPPLY_MODE_LEN   (2U)
#define RF_LODIST_TXBUF_SUPPLY_MODE_MSK   (((1U << RF_LODIST_TXBUF_SUPPLY_MODE_LEN) - 1) << RF_LODIST_TXBUF_SUPPLY_MODE_POS)
#define RF_LODIST_TXBUF_SUPPLY_MODE_UMSK  (~(((1U << RF_LODIST_TXBUF_SUPPLY_MODE_LEN) - 1) << RF_LODIST_TXBUF_SUPPLY_MODE_POS))
#define RF_LODIST_RXBUF_SUPPLY_MODE       RF_LODIST_RXBUF_SUPPLY_MODE
#define RF_LODIST_RXBUF_SUPPLY_MODE_POS   (4U)
#define RF_LODIST_RXBUF_SUPPLY_MODE_LEN   (2U)
#define RF_LODIST_RXBUF_SUPPLY_MODE_MSK   (((1U << RF_LODIST_RXBUF_SUPPLY_MODE_LEN) - 1) << RF_LODIST_RXBUF_SUPPLY_MODE_POS)
#define RF_LODIST_RXBUF_SUPPLY_MODE_UMSK  (~(((1U << RF_LODIST_RXBUF_SUPPLY_MODE_LEN) - 1) << RF_LODIST_RXBUF_SUPPLY_MODE_POS))
#define RF_LODIST_RXBUF_SUPPLY_BOOST      RF_LODIST_RXBUF_SUPPLY_BOOST
#define RF_LODIST_RXBUF_SUPPLY_BOOST_POS  (6U)
#define RF_LODIST_RXBUF_SUPPLY_BOOST_LEN  (1U)
#define RF_LODIST_RXBUF_SUPPLY_BOOST_MSK  (((1U << RF_LODIST_RXBUF_SUPPLY_BOOST_LEN) - 1) << RF_LODIST_RXBUF_SUPPLY_BOOST_POS)
#define RF_LODIST_RXBUF_SUPPLY_BOOST_UMSK (~(((1U << RF_LODIST_RXBUF_SUPPLY_BOOST_LEN) - 1) << RF_LODIST_RXBUF_SUPPLY_BOOST_POS))
#define RF_LODIST_RWELL_BIAS              RF_LODIST_RWELL_BIAS
#define RF_LODIST_RWELL_BIAS_POS          (8U)
#define RF_LODIST_RWELL_BIAS_LEN          (2U)
#define RF_LODIST_RWELL_BIAS_MSK          (((1U << RF_LODIST_RWELL_BIAS_LEN) - 1) << RF_LODIST_RWELL_BIAS_POS)
#define RF_LODIST_RWELL_BIAS_UMSK         (~(((1U << RF_LODIST_RWELL_BIAS_LEN) - 1) << RF_LODIST_RWELL_BIAS_POS))
#define RF_LODIST_NWELL_BIAS              RF_LODIST_NWELL_BIAS
#define RF_LODIST_NWELL_BIAS_POS          (12U)
#define RF_LODIST_NWELL_BIAS_LEN          (2U)
#define RF_LODIST_NWELL_BIAS_MSK          (((1U << RF_LODIST_NWELL_BIAS_LEN) - 1) << RF_LODIST_NWELL_BIAS_POS)
#define RF_LODIST_NWELL_BIAS_UMSK         (~(((1U << RF_LODIST_NWELL_BIAS_LEN) - 1) << RF_LODIST_NWELL_BIAS_POS))
#define RF_LODIST_75DC_SEL                RF_LODIST_75DC_SEL
#define RF_LODIST_75DC_SEL_POS            (16U)
#define RF_LODIST_75DC_SEL_LEN            (1U)
#define RF_LODIST_75DC_SEL_MSK            (((1U << RF_LODIST_75DC_SEL_LEN) - 1) << RF_LODIST_75DC_SEL_POS)
#define RF_LODIST_75DC_SEL_UMSK           (~(((1U << RF_LODIST_75DC_SEL_LEN) - 1) << RF_LODIST_75DC_SEL_POS))

/* 0x240 : fbdv */
#define RF_FBDV_OFFSET                   (0x240)
#define RF_FBDV_TPM_CLK_SEL              RF_FBDV_TPM_CLK_SEL
#define RF_FBDV_TPM_CLK_SEL_POS          (0U)
#define RF_FBDV_TPM_CLK_SEL_LEN          (3U)
#define RF_FBDV_TPM_CLK_SEL_MSK          (((1U << RF_FBDV_TPM_CLK_SEL_LEN) - 1) << RF_FBDV_TPM_CLK_SEL_POS)
#define RF_FBDV_TPM_CLK_SEL_UMSK         (~(((1U << RF_FBDV_TPM_CLK_SEL_LEN) - 1) << RF_FBDV_TPM_CLK_SEL_POS))
#define RF_FBDV_ADPLL_CLK_SEL            RF_FBDV_ADPLL_CLK_SEL
#define RF_FBDV_ADPLL_CLK_SEL_POS        (4U)
#define RF_FBDV_ADPLL_CLK_SEL_LEN        (1U)
#define RF_FBDV_ADPLL_CLK_SEL_MSK        (((1U << RF_FBDV_ADPLL_CLK_SEL_LEN) - 1) << RF_FBDV_ADPLL_CLK_SEL_POS)
#define RF_FBDV_ADPLL_CLK_SEL_UMSK       (~(((1U << RF_FBDV_ADPLL_CLK_SEL_LEN) - 1) << RF_FBDV_ADPLL_CLK_SEL_POS))
#define RF_FBDV_DCO_DITHER_CLK_SEL       RF_FBDV_DCO_DITHER_CLK_SEL
#define RF_FBDV_DCO_DITHER_CLK_SEL_POS   (8U)
#define RF_FBDV_DCO_DITHER_CLK_SEL_LEN   (1U)
#define RF_FBDV_DCO_DITHER_CLK_SEL_MSK   (((1U << RF_FBDV_DCO_DITHER_CLK_SEL_LEN) - 1) << RF_FBDV_DCO_DITHER_CLK_SEL_POS)
#define RF_FBDV_DCO_DITHER_CLK_SEL_UMSK  (~(((1U << RF_FBDV_DCO_DITHER_CLK_SEL_LEN) - 1) << RF_FBDV_DCO_DITHER_CLK_SEL_POS))
#define RF_FBDV_FB_CLK_SEL               RF_FBDV_FB_CLK_SEL
#define RF_FBDV_FB_CLK_SEL_POS           (12U)
#define RF_FBDV_FB_CLK_SEL_LEN           (1U)
#define RF_FBDV_FB_CLK_SEL_MSK           (((1U << RF_FBDV_FB_CLK_SEL_LEN) - 1) << RF_FBDV_FB_CLK_SEL_POS)
#define RF_FBDV_FB_CLK_SEL_UMSK          (~(((1U << RF_FBDV_FB_CLK_SEL_LEN) - 1) << RF_FBDV_FB_CLK_SEL_POS))
#define RF_FBDV_SAMPLE_CLK_SEL           RF_FBDV_SAMPLE_CLK_SEL
#define RF_FBDV_SAMPLE_CLK_SEL_POS       (16U)
#define RF_FBDV_SAMPLE_CLK_SEL_LEN       (2U)
#define RF_FBDV_SAMPLE_CLK_SEL_MSK       (((1U << RF_FBDV_SAMPLE_CLK_SEL_LEN) - 1) << RF_FBDV_SAMPLE_CLK_SEL_POS)
#define RF_FBDV_SAMPLE_CLK_SEL_UMSK      (~(((1U << RF_FBDV_SAMPLE_CLK_SEL_LEN) - 1) << RF_FBDV_SAMPLE_CLK_SEL_POS))
#define RF_FBDV_STG_SEL                  RF_FBDV_STG_SEL
#define RF_FBDV_STG_SEL_POS              (20U)
#define RF_FBDV_STG_SEL_LEN              (1U)
#define RF_FBDV_STG_SEL_MSK              (((1U << RF_FBDV_STG_SEL_LEN) - 1) << RF_FBDV_STG_SEL_POS)
#define RF_FBDV_STG_SEL_UMSK             (~(((1U << RF_FBDV_STG_SEL_LEN) - 1) << RF_FBDV_STG_SEL_POS))
#define RF_RST_MMDIV                     RF_RST_MMDIV
#define RF_RST_MMDIV_POS                 (24U)
#define RF_RST_MMDIV_LEN                 (1U)
#define RF_RST_MMDIV_MSK                 (((1U << RF_RST_MMDIV_LEN) - 1) << RF_RST_MMDIV_POS)
#define RF_RST_MMDIV_UMSK                (~(((1U << RF_RST_MMDIV_LEN) - 1) << RF_RST_MMDIV_POS))
#define RF_LOTPM_FMASH_CLK_POLARITY      RF_LOTPM_FMASH_CLK_POLARITY
#define RF_LOTPM_FMASH_CLK_POLARITY_POS  (28U)
#define RF_LOTPM_FMASH_CLK_POLARITY_LEN  (1U)
#define RF_LOTPM_FMASH_CLK_POLARITY_MSK  (((1U << RF_LOTPM_FMASH_CLK_POLARITY_LEN) - 1) << RF_LOTPM_FMASH_CLK_POLARITY_POS)
#define RF_LOTPM_FMASH_CLK_POLARITY_UMSK (~(((1U << RF_LOTPM_FMASH_CLK_POLARITY_LEN) - 1) << RF_LOTPM_FMASH_CLK_POLARITY_POS))
#define RF_DCO_DITHER_CLK_POLARITY       RF_DCO_DITHER_CLK_POLARITY
#define RF_DCO_DITHER_CLK_POLARITY_POS   (29U)
#define RF_DCO_DITHER_CLK_POLARITY_LEN   (1U)
#define RF_DCO_DITHER_CLK_POLARITY_MSK   (((1U << RF_DCO_DITHER_CLK_POLARITY_LEN) - 1) << RF_DCO_DITHER_CLK_POLARITY_POS)
#define RF_DCO_DITHER_CLK_POLARITY_UMSK  (~(((1U << RF_DCO_DITHER_CLK_POLARITY_LEN) - 1) << RF_DCO_DITHER_CLK_POLARITY_POS))

/* 0x244 : kcal1 */
#define RF_KCAL1_OFFSET        (0x244)
#define RF_KCAL_DIV            RF_KCAL_DIV
#define RF_KCAL_DIV_POS        (0U)
#define RF_KCAL_DIV_LEN        (16U)
#define RF_KCAL_DIV_MSK        (((1U << RF_KCAL_DIV_LEN) - 1) << RF_KCAL_DIV_POS)
#define RF_KCAL_DIV_UMSK       (~(((1U << RF_KCAL_DIV_LEN) - 1) << RF_KCAL_DIV_POS))
#define RF_KCAL_CNT_START      RF_KCAL_CNT_START
#define RF_KCAL_CNT_START_POS  (16U)
#define RF_KCAL_CNT_START_LEN  (1U)
#define RF_KCAL_CNT_START_MSK  (((1U << RF_KCAL_CNT_START_LEN) - 1) << RF_KCAL_CNT_START_POS)
#define RF_KCAL_CNT_START_UMSK (~(((1U << RF_KCAL_CNT_START_LEN) - 1) << RF_KCAL_CNT_START_POS))
#define RF_KCAL_RATIO          RF_KCAL_RATIO
#define RF_KCAL_RATIO_POS      (20U)
#define RF_KCAL_RATIO_LEN      (10U)
#define RF_KCAL_RATIO_MSK      (((1U << RF_KCAL_RATIO_LEN) - 1) << RF_KCAL_RATIO_POS)
#define RF_KCAL_RATIO_UMSK     (~(((1U << RF_KCAL_RATIO_LEN) - 1) << RF_KCAL_RATIO_POS))

/* 0x248 : kcal2 */
#define RF_KCAL2_OFFSET       (0x248)
#define RF_KCAL_CNT_OP        RF_KCAL_CNT_OP
#define RF_KCAL_CNT_OP_POS    (0U)
#define RF_KCAL_CNT_OP_LEN    (16U)
#define RF_KCAL_CNT_OP_MSK    (((1U << RF_KCAL_CNT_OP_LEN) - 1) << RF_KCAL_CNT_OP_POS)
#define RF_KCAL_CNT_OP_UMSK   (~(((1U << RF_KCAL_CNT_OP_LEN) - 1) << RF_KCAL_CNT_OP_POS))
#define RF_KCAL_CNT_RDY       RF_KCAL_CNT_RDY
#define RF_KCAL_CNT_RDY_POS   (16U)
#define RF_KCAL_CNT_RDY_LEN   (1U)
#define RF_KCAL_CNT_RDY_MSK   (((1U << RF_KCAL_CNT_RDY_LEN) - 1) << RF_KCAL_CNT_RDY_POS)
#define RF_KCAL_CNT_RDY_UMSK  (~(((1U << RF_KCAL_CNT_RDY_LEN) - 1) << RF_KCAL_CNT_RDY_POS))
#define RF_KCAL_RATIO_HW      RF_KCAL_RATIO_HW
#define RF_KCAL_RATIO_HW_POS  (20U)
#define RF_KCAL_RATIO_HW_LEN  (10U)
#define RF_KCAL_RATIO_HW_MSK  (((1U << RF_KCAL_RATIO_HW_LEN) - 1) << RF_KCAL_RATIO_HW_POS)
#define RF_KCAL_RATIO_HW_UMSK (~(((1U << RF_KCAL_RATIO_HW_LEN) - 1) << RF_KCAL_RATIO_HW_POS))

/* 0x24C : adpll_slope_gen */
#define RF_ADPLL_SLOPE_GEN_OFFSET                   (0x24C)
#define RF_ADPLL_SLOPE_GEN_R_SEL                    RF_ADPLL_SLOPE_GEN_R_SEL
#define RF_ADPLL_SLOPE_GEN_R_SEL_POS                (0U)
#define RF_ADPLL_SLOPE_GEN_R_SEL_LEN                (3U)
#define RF_ADPLL_SLOPE_GEN_R_SEL_MSK                (((1U << RF_ADPLL_SLOPE_GEN_R_SEL_LEN) - 1) << RF_ADPLL_SLOPE_GEN_R_SEL_POS)
#define RF_ADPLL_SLOPE_GEN_R_SEL_UMSK               (~(((1U << RF_ADPLL_SLOPE_GEN_R_SEL_LEN) - 1) << RF_ADPLL_SLOPE_GEN_R_SEL_POS))
#define RF_ADPLL_SLOPE_GEN_DC_CORR                  RF_ADPLL_SLOPE_GEN_DC_CORR
#define RF_ADPLL_SLOPE_GEN_DC_CORR_POS              (4U)
#define RF_ADPLL_SLOPE_GEN_DC_CORR_LEN              (2U)
#define RF_ADPLL_SLOPE_GEN_DC_CORR_MSK              (((1U << RF_ADPLL_SLOPE_GEN_DC_CORR_LEN) - 1) << RF_ADPLL_SLOPE_GEN_DC_CORR_POS)
#define RF_ADPLL_SLOPE_GEN_DC_CORR_UMSK             (~(((1U << RF_ADPLL_SLOPE_GEN_DC_CORR_LEN) - 1) << RF_ADPLL_SLOPE_GEN_DC_CORR_POS))
#define RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE      RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE
#define RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_POS  (6U)
#define RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_LEN  (1U)
#define RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_MSK  (((1U << RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_LEN) - 1) << RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_POS)
#define RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_UMSK (~(((1U << RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_LEN) - 1) << RF_ADPLL_SLOPE_GEN_PULSE_WIDTH_ENHANCE_POS))

