bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x250 : adpll_adc */
#define RF_ADPLL_ADC_OFFSET             (0x250)
#define RF_ADPLL_ADC_VTH_BIAS_MODE      RF_ADPLL_ADC_VTH_BIAS_MODE
#define RF_ADPLL_ADC_VTH_BIAS_MODE_POS  (0U)
#define RF_ADPLL_ADC_VTH_BIAS_MODE_LEN  (1U)
#define RF_ADPLL_ADC_VTH_BIAS_MODE_MSK  (((1U << RF_ADPLL_ADC_VTH_BIAS_MODE_LEN) - 1) << RF_ADPLL_ADC_VTH_BIAS_MODE_POS)
#define RF_ADPLL_ADC_VTH_BIAS_MODE_UMSK (~(((1U << RF_ADPLL_ADC_VTH_BIAS_MODE_LEN) - 1) << RF_ADPLL_ADC_VTH_BIAS_MODE_POS))
#define RF_ADPLL_ADC_VTH_EN             RF_ADPLL_ADC_VTH_EN
#define RF_ADPLL_ADC_VTH_EN_POS         (1U)
#define RF_ADPLL_ADC_VTH_EN_LEN         (1U)
#define RF_ADPLL_ADC_VTH_EN_MSK         (((1U << RF_ADPLL_ADC_VTH_EN_LEN) - 1) << RF_ADPLL_ADC_VTH_EN_POS)
#define RF_ADPLL_ADC_VTH_EN_UMSK        (~(((1U << RF_ADPLL_ADC_VTH_EN_LEN) - 1) << RF_ADPLL_ADC_VTH_EN_POS))
#define RF_ADPLL_ADC_DATA_SIGN_SEL      RF_ADPLL_ADC_DATA_SIGN_SEL
#define RF_ADPLL_ADC_DATA_SIGN_SEL_POS  (2U)
#define RF_ADPLL_ADC_DATA_SIGN_SEL_LEN  (1U)
#define RF_ADPLL_ADC_DATA_SIGN_SEL_MSK  (((1U << RF_ADPLL_ADC_DATA_SIGN_SEL_LEN) - 1) << RF_ADPLL_ADC_DATA_SIGN_SEL_POS)
#define RF_ADPLL_ADC_DATA_SIGN_SEL_UMSK (~(((1U << RF_ADPLL_ADC_DATA_SIGN_SEL_LEN) - 1) << RF_ADPLL_ADC_DATA_SIGN_SEL_POS))
#define RF_ADPLL_ADC_VREF_FINE          RF_ADPLL_ADC_VREF_FINE
#define RF_ADPLL_ADC_VREF_FINE_POS      (4U)
#define RF_ADPLL_ADC_VREF_FINE_LEN      (2U)
#define RF_ADPLL_ADC_VREF_FINE_MSK      (((1U << RF_ADPLL_ADC_VREF_FINE_LEN) - 1) << RF_ADPLL_ADC_VREF_FINE_POS)
#define RF_ADPLL_ADC_VREF_FINE_UMSK     (~(((1U << RF_ADPLL_ADC_VREF_FINE_LEN) - 1) << RF_ADPLL_ADC_VREF_FINE_POS))
#define RF_ADPLL_ADC_VREF_COARSE        RF_ADPLL_ADC_VREF_COARSE
#define RF_ADPLL_ADC_VREF_COARSE_POS    (8U)
#define RF_ADPLL_ADC_VREF_COARSE_LEN    (2U)
#define RF_ADPLL_ADC_VREF_COARSE_MSK    (((1U << RF_ADPLL_ADC_VREF_COARSE_LEN) - 1) << RF_ADPLL_ADC_VREF_COARSE_POS)
#define RF_ADPLL_ADC_VREF_COARSE_UMSK   (~(((1U << RF_ADPLL_ADC_VREF_COARSE_LEN) - 1) << RF_ADPLL_ADC_VREF_COARSE_POS))
#define RF_ADPLL_ADC_OSCAL_EN           RF_ADPLL_ADC_OSCAL_EN
#define RF_ADPLL_ADC_OSCAL_EN_POS       (12U)
#define RF_ADPLL_ADC_OSCAL_EN_LEN       (1U)
#define RF_ADPLL_ADC_OSCAL_EN_MSK       (((1U << RF_ADPLL_ADC_OSCAL_EN_LEN) - 1) << RF_ADPLL_ADC_OSCAL_EN_POS)
#define RF_ADPLL_ADC_OSCAL_EN_UMSK      (~(((1U << RF_ADPLL_ADC_OSCAL_EN_LEN) - 1) << RF_ADPLL_ADC_OSCAL_EN_POS))
#define RF_ADPLL_ADC_CLK_SYNC_INV       RF_ADPLL_ADC_CLK_SYNC_INV
#define RF_ADPLL_ADC_CLK_SYNC_INV_POS   (16U)
#define RF_ADPLL_ADC_CLK_SYNC_INV_LEN   (1U)
#define RF_ADPLL_ADC_CLK_SYNC_INV_MSK   (((1U << RF_ADPLL_ADC_CLK_SYNC_INV_LEN) - 1) << RF_ADPLL_ADC_CLK_SYNC_INV_POS)
#define RF_ADPLL_ADC_CLK_SYNC_INV_UMSK  (~(((1U << RF_ADPLL_ADC_CLK_SYNC_INV_LEN) - 1) << RF_ADPLL_ADC_CLK_SYNC_INV_POS))
#define RF_ADPLL_ADC_CLK_DIV_SEL        RF_ADPLL_ADC_CLK_DIV_SEL
#define RF_ADPLL_ADC_CLK_DIV_SEL_POS    (24U)
#define RF_ADPLL_ADC_CLK_DIV_SEL_LEN    (1U)
#define RF_ADPLL_ADC_CLK_DIV_SEL_MSK    (((1U << RF_ADPLL_ADC_CLK_DIV_SEL_LEN) - 1) << RF_ADPLL_ADC_CLK_DIV_SEL_POS)
#define RF_ADPLL_ADC_CLK_DIV_SEL_UMSK   (~(((1U << RF_ADPLL_ADC_CLK_DIV_SEL_LEN) - 1) << RF_ADPLL_ADC_CLK_DIV_SEL_POS))
#define RF_ADPLL_ADC_CLK_INV            RF_ADPLL_ADC_CLK_INV
#define RF_ADPLL_ADC_CLK_INV_POS        (28U)
#define RF_ADPLL_ADC_CLK_INV_LEN        (1U)
#define RF_ADPLL_ADC_CLK_INV_MSK        (((1U << RF_ADPLL_ADC_CLK_INV_LEN) - 1) << RF_ADPLL_ADC_CLK_INV_POS)
#define RF_ADPLL_ADC_CLK_INV_UMSK       (~(((1U << RF_ADPLL_ADC_CLK_INV_LEN) - 1) << RF_ADPLL_ADC_CLK_INV_POS))
#define RF_ADPLL_ADC_CLK_EN             RF_ADPLL_ADC_CLK_EN
#define RF_ADPLL_ADC_CLK_EN_POS         (29U)
#define RF_ADPLL_ADC_CLK_EN_LEN         (1U)
#define RF_ADPLL_ADC_CLK_EN_MSK         (((1U << RF_ADPLL_ADC_CLK_EN_LEN) - 1) << RF_ADPLL_ADC_CLK_EN_POS)
#define RF_ADPLL_ADC_CLK_EN_UMSK        (~(((1U << RF_ADPLL_ADC_CLK_EN_LEN) - 1) << RF_ADPLL_ADC_CLK_EN_POS))

/* 0x254 : adpll_dtc */
#define RF_ADPLL_DTC_OFFSET           (0x254)
#define RF_ADPLL_DTC_BYPASS           RF_ADPLL_DTC_BYPASS
#define RF_ADPLL_DTC_BYPASS_POS       (0U)
#define RF_ADPLL_DTC_BYPASS_LEN       (1U)
#define RF_ADPLL_DTC_BYPASS_MSK       (((1U << RF_ADPLL_DTC_BYPASS_LEN) - 1) << RF_ADPLL_DTC_BYPASS_POS)
#define RF_ADPLL_DTC_BYPASS_UMSK      (~(((1U << RF_ADPLL_DTC_BYPASS_LEN) - 1) << RF_ADPLL_DTC_BYPASS_POS))
#define RF_ADPLL_DTC_R_SEL            RF_ADPLL_DTC_R_SEL
#define RF_ADPLL_DTC_R_SEL_POS        (4U)
#define RF_ADPLL_DTC_R_SEL_LEN        (3U)
#define RF_ADPLL_DTC_R_SEL_MSK        (((1U << RF_ADPLL_DTC_R_SEL_LEN) - 1) << RF_ADPLL_DTC_R_SEL_POS)
#define RF_ADPLL_DTC_R_SEL_UMSK       (~(((1U << RF_ADPLL_DTC_R_SEL_LEN) - 1) << RF_ADPLL_DTC_R_SEL_POS))
#define RF_ADPLL_DTC_INV_VTH_SEL      RF_ADPLL_DTC_INV_VTH_SEL
#define RF_ADPLL_DTC_INV_VTH_SEL_POS  (8U)
#define RF_ADPLL_DTC_INV_VTH_SEL_LEN  (2U)
#define RF_ADPLL_DTC_INV_VTH_SEL_MSK  (((1U << RF_ADPLL_DTC_INV_VTH_SEL_LEN) - 1) << RF_ADPLL_DTC_INV_VTH_SEL_POS)
#define RF_ADPLL_DTC_INV_VTH_SEL_UMSK (~(((1U << RF_ADPLL_DTC_INV_VTH_SEL_LEN) - 1) << RF_ADPLL_DTC_INV_VTH_SEL_POS))

/* 0x258 : lo_fc_config1 */
#define RF_LO_FC_CONFIG1_OFFSET (0x258)
#define RF_LO_FCW               RF_LO_FCW
#define RF_LO_FCW_POS           (0U)
#define RF_LO_FCW_LEN           (25U)
#define RF_LO_FCW_MSK           (((1U << RF_LO_FCW_LEN) - 1) << RF_LO_FCW_POS)
#define RF_LO_FCW_UMSK          (~(((1U << RF_LO_FCW_LEN) - 1) << RF_LO_FCW_POS))

/* 0x25C : lo_fcw_config2 */
#define RF_LO_FCW_CONFIG2_OFFSET (0x25C)
#define RF_LO_FCW_HW             RF_LO_FCW_HW
#define RF_LO_FCW_HW_POS         (0U)
#define RF_LO_FCW_HW_LEN         (25U)
#define RF_LO_FCW_HW_MSK         (((1U << RF_LO_FCW_HW_LEN) - 1) << RF_LO_FCW_HW_POS)
#define RF_LO_FCW_HW_UMSK        (~(((1U << RF_LO_FCW_HW_LEN) - 1) << RF_LO_FCW_HW_POS))

/* 0x260 : lo_fcw3 */
#define RF_LO_FCW3_OFFSET      (0x260)
#define RF_TX_FREQ_MOD_LP      RF_TX_FREQ_MOD_LP
#define RF_TX_FREQ_MOD_LP_POS  (0U)
#define RF_TX_FREQ_MOD_LP_LEN  (12U)
#define RF_TX_FREQ_MOD_LP_MSK  (((1U << RF_TX_FREQ_MOD_LP_LEN) - 1) << RF_TX_FREQ_MOD_LP_POS)
#define RF_TX_FREQ_MOD_LP_UMSK (~(((1U << RF_TX_FREQ_MOD_LP_LEN) - 1) << RF_TX_FREQ_MOD_LP_POS))
#define RF_TX_FREQ_MOD_HP      RF_TX_FREQ_MOD_HP
#define RF_TX_FREQ_MOD_HP_POS  (16U)
#define RF_TX_FREQ_MOD_HP_LEN  (10U)
#define RF_TX_FREQ_MOD_HP_MSK  (((1U << RF_TX_FREQ_MOD_HP_LEN) - 1) << RF_TX_FREQ_MOD_HP_POS)
#define RF_TX_FREQ_MOD_HP_UMSK (~(((1U << RF_TX_FREQ_MOD_HP_LEN) - 1) << RF_TX_FREQ_MOD_HP_POS))

/* 0x264 : lotpm */
#define RF_LOTPM_OFFSET               (0x264)
#define RF_LOTPM_LFP_DELAY_SEL        RF_LOTPM_LFP_DELAY_SEL
#define RF_LOTPM_LFP_DELAY_SEL_POS    (0U)
#define RF_LOTPM_LFP_DELAY_SEL_LEN    (2U)
#define RF_LOTPM_LFP_DELAY_SEL_MSK    (((1U << RF_LOTPM_LFP_DELAY_SEL_LEN) - 1) << RF_LOTPM_LFP_DELAY_SEL_POS)
#define RF_LOTPM_LFP_DELAY_SEL_UMSK   (~(((1U << RF_LOTPM_LFP_DELAY_SEL_LEN) - 1) << RF_LOTPM_LFP_DELAY_SEL_POS))
#define RF_LOTPM_HFP_DELAY_FMASH      RF_LOTPM_HFP_DELAY_FMASH
#define RF_LOTPM_HFP_DELAY_FMASH_POS  (4U)
#define RF_LOTPM_HFP_DELAY_FMASH_LEN  (4U)
#define RF_LOTPM_HFP_DELAY_FMASH_MSK  (((1U << RF_LOTPM_HFP_DELAY_FMASH_LEN) - 1) << RF_LOTPM_HFP_DELAY_FMASH_POS)
#define RF_LOTPM_HFP_DELAY_FMASH_UMSK (~(((1U << RF_LOTPM_HFP_DELAY_FMASH_LEN) - 1) << RF_LOTPM_HFP_DELAY_FMASH_POS))
#define RF_LOTPM_HFP_DELAY_FREF       RF_LOTPM_HFP_DELAY_FREF
#define RF_LOTPM_HFP_DELAY_FREF_POS   (8U)
#define RF_LOTPM_HFP_DELAY_FREF_LEN   (2U)
#define RF_LOTPM_HFP_DELAY_FREF_MSK   (((1U << RF_LOTPM_HFP_DELAY_FREF_LEN) - 1) << RF_LOTPM_HFP_DELAY_FREF_POS)
#define RF_LOTPM_HFP_DELAY_FREF_UMSK  (~(((1U << RF_LOTPM_HFP_DELAY_FREF_LEN) - 1) << RF_LOTPM_HFP_DELAY_FREF_POS))
#define RF_LOTPM_HFP_POLARITY         RF_LOTPM_HFP_POLARITY
#define RF_LOTPM_HFP_POLARITY_POS     (12U)
#define RF_LOTPM_HFP_POLARITY_LEN     (1U)
#define RF_LOTPM_HFP_POLARITY_MSK     (((1U << RF_LOTPM_HFP_POLARITY_LEN) - 1) << RF_LOTPM_HFP_POLARITY_POS)
#define RF_LOTPM_HFP_POLARITY_UMSK    (~(((1U << RF_LOTPM_HFP_POLARITY_LEN) - 1) << RF_LOTPM_HFP_POLARITY_POS))
#define RF_LOTPM_HFP_MASH1_SEL        RF_LOTPM_HFP_MASH1_SEL
#define RF_LOTPM_HFP_MASH1_SEL_POS    (16U)
#define RF_LOTPM_HFP_MASH1_SEL_LEN    (1U)
#define RF_LOTPM_HFP_MASH1_SEL_MSK    (((1U << RF_LOTPM_HFP_MASH1_SEL_LEN) - 1) << RF_LOTPM_HFP_MASH1_SEL_POS)
#define RF_LOTPM_HFP_MASH1_SEL_UMSK   (~(((1U << RF_LOTPM_HFP_MASH1_SEL_LEN) - 1) << RF_LOTPM_HFP_MASH1_SEL_POS))

/* 0x268 : adpll1 */
#define RF_ADPLL1_OFFSET                         (0x268)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR          RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_POS      (0U)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_LEN      (1U)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_MSK      (((1U << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_LEN) - 1) << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_POS)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_UMSK     (~(((1U << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_LEN) - 1) << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_POS))
#define RF_ADPLL_LO_LOCK_SEL                     RF_ADPLL_LO_LOCK_SEL
#define RF_ADPLL_LO_LOCK_SEL_POS                 (1U)
#define RF_ADPLL_LO_LOCK_SEL_LEN                 (1U)
#define RF_ADPLL_LO_LOCK_SEL_MSK                 (((1U << RF_ADPLL_LO_LOCK_SEL_LEN) - 1) << RF_ADPLL_LO_LOCK_SEL_POS)
#define RF_ADPLL_LO_LOCK_SEL_UMSK                (~(((1U << RF_ADPLL_LO_LOCK_SEL_LEN) - 1) << RF_ADPLL_LO_LOCK_SEL_POS))
#define RF_ADPLL_TIMEOUT_CNT1_SEL                RF_ADPLL_TIMEOUT_CNT1_SEL
#define RF_ADPLL_TIMEOUT_CNT1_SEL_POS            (2U)
#define RF_ADPLL_TIMEOUT_CNT1_SEL_LEN            (1U)
#define RF_ADPLL_TIMEOUT_CNT1_SEL_MSK            (((1U << RF_ADPLL_TIMEOUT_CNT1_SEL_LEN) - 1) << RF_ADPLL_TIMEOUT_CNT1_SEL_POS)
#define RF_ADPLL_TIMEOUT_CNT1_SEL_UMSK           (~(((1U << RF_ADPLL_TIMEOUT_CNT1_SEL_LEN) - 1) << RF_ADPLL_TIMEOUT_CNT1_SEL_POS))
#define RF_ADPLL_TIMEOUT_CNT_SEL                 RF_ADPLL_TIMEOUT_CNT_SEL
#define RF_ADPLL_TIMEOUT_CNT_SEL_POS             (3U)
#define RF_ADPLL_TIMEOUT_CNT_SEL_LEN             (1U)
#define RF_ADPLL_TIMEOUT_CNT_SEL_MSK             (((1U << RF_ADPLL_TIMEOUT_CNT_SEL_LEN) - 1) << RF_ADPLL_TIMEOUT_CNT_SEL_POS)
#define RF_ADPLL_TIMEOUT_CNT_SEL_UMSK            (~(((1U << RF_ADPLL_TIMEOUT_CNT_SEL_LEN) - 1) << RF_ADPLL_TIMEOUT_CNT_SEL_POS))
#define RF_ADPLL_MOMHOLD_LMSENB_EXT              RF_ADPLL_MOMHOLD_LMSENB_EXT
#define RF_ADPLL_MOMHOLD_LMSENB_EXT_POS          (4U)
#define RF_ADPLL_MOMHOLD_LMSENB_EXT_LEN          (1U)
#define RF_ADPLL_MOMHOLD_LMSENB_EXT_MSK          (((1U << RF_ADPLL_MOMHOLD_LMSENB_EXT_LEN) - 1) << RF_ADPLL_MOMHOLD_LMSENB_EXT_POS)
#define RF_ADPLL_MOMHOLD_LMSENB_EXT_UMSK         (~(((1U << RF_ADPLL_MOMHOLD_LMSENB_EXT_LEN) - 1) << RF_ADPLL_MOMHOLD_LMSENB_EXT_POS))
#define RF_ADPLL_RST_COARSE_DET_EXT              RF_ADPLL_RST_COARSE_DET_EXT
#define RF_ADPLL_RST_COARSE_DET_EXT_POS          (5U)
#define RF_ADPLL_RST_COARSE_DET_EXT_LEN          (1U)
#define RF_ADPLL_RST_COARSE_DET_EXT_MSK          (((1U << RF_ADPLL_RST_COARSE_DET_EXT_LEN) - 1) << RF_ADPLL_RST_COARSE_DET_EXT_POS)
#define RF_ADPLL_RST_COARSE_DET_EXT_UMSK         (~(((1U << RF_ADPLL_RST_COARSE_DET_EXT_LEN) - 1) << RF_ADPLL_RST_COARSE_DET_EXT_POS))
#define RF_ADPLL_RST_SPD_DET_EXT                 RF_ADPLL_RST_SPD_DET_EXT
#define RF_ADPLL_RST_SPD_DET_EXT_POS             (6U)
#define RF_ADPLL_RST_SPD_DET_EXT_LEN             (1U)
#define RF_ADPLL_RST_SPD_DET_EXT_MSK             (((1U << RF_ADPLL_RST_SPD_DET_EXT_LEN) - 1) << RF_ADPLL_RST_SPD_DET_EXT_POS)
#define RF_ADPLL_RST_SPD_DET_EXT_UMSK            (~(((1U << RF_ADPLL_RST_SPD_DET_EXT_LEN) - 1) << RF_ADPLL_RST_SPD_DET_EXT_POS))
#define RF_ADPLL_LOOP_LOCK_EXT                   RF_ADPLL_LOOP_LOCK_EXT
#define RF_ADPLL_LOOP_LOCK_EXT_POS               (7U)
#define RF_ADPLL_LOOP_LOCK_EXT_LEN               (1U)
#define RF_ADPLL_LOOP_LOCK_EXT_MSK               (((1U << RF_ADPLL_LOOP_LOCK_EXT_LEN) - 1) << RF_ADPLL_LOOP_LOCK_EXT_POS)
#define RF_ADPLL_LOOP_LOCK_EXT_UMSK              (~(((1U << RF_ADPLL_LOOP_LOCK_EXT_LEN) - 1) << RF_ADPLL_LOOP_LOCK_EXT_POS))
#define RF_ADPLL_FCAL_DONE_EXT                   RF_ADPLL_FCAL_DONE_EXT
#define RF_ADPLL_FCAL_DONE_EXT_POS               (8U)
#define RF_ADPLL_FCAL_DONE_EXT_LEN               (1U)
#define RF_ADPLL_FCAL_DONE_EXT_MSK               (((1U << RF_ADPLL_FCAL_DONE_EXT_LEN) - 1) << RF_ADPLL_FCAL_DONE_EXT_POS)
#define RF_ADPLL_FCAL_DONE_EXT_UMSK              (~(((1U << RF_ADPLL_FCAL_DONE_EXT_LEN) - 1) << RF_ADPLL_FCAL_DONE_EXT_POS))
#define RF_ADPLL_FCAL_START_EXT                  RF_ADPLL_FCAL_START_EXT
#define RF_ADPLL_FCAL_START_EXT_POS              (9U)
#define RF_ADPLL_FCAL_START_EXT_LEN              (1U)
#define RF_ADPLL_FCAL_START_EXT_MSK              (((1U << RF_ADPLL_FCAL_START_EXT_LEN) - 1) << RF_ADPLL_FCAL_START_EXT_POS)
#define RF_ADPLL_FCAL_START_EXT_UMSK             (~(((1U << RF_ADPLL_FCAL_START_EXT_LEN) - 1) << RF_ADPLL_FCAL_START_EXT_POS))
#define RF_ADPLL_LO_LOCK_DIRECTLY                RF_ADPLL_LO_LOCK_DIRECTLY
#define RF_ADPLL_LO_LOCK_DIRECTLY_POS            (10U)
#define RF_ADPLL_LO_LOCK_DIRECTLY_LEN            (1U)
#define RF_ADPLL_LO_LOCK_DIRECTLY_MSK            (((1U << RF_ADPLL_LO_LOCK_DIRECTLY_LEN) - 1) << RF_ADPLL_LO_LOCK_DIRECTLY_POS)
#define RF_ADPLL_LO_LOCK_DIRECTLY_UMSK           (~(((1U << RF_ADPLL_LO_LOCK_DIRECTLY_LEN) - 1) << RF_ADPLL_LO_LOCK_DIRECTLY_POS))
#define RF_ADPLL_LO_FSM_EXT                      RF_ADPLL_LO_FSM_EXT
#define RF_ADPLL_LO_FSM_EXT_POS                  (11U)
#define RF_ADPLL_LO_FSM_EXT_LEN                  (1U)
#define RF_ADPLL_LO_FSM_EXT_MSK                  (((1U << RF_ADPLL_LO_FSM_EXT_LEN) - 1) << RF_ADPLL_LO_FSM_EXT_POS)
#define RF_ADPLL_LO_FSM_EXT_UMSK                 (~(((1U << RF_ADPLL_LO_FSM_EXT_LEN) - 1) << RF_ADPLL_LO_FSM_EXT_POS))
#define RF_ADPLL_FSM_EN                          RF_ADPLL_FSM_EN
#define RF_ADPLL_FSM_EN_POS                      (12U)
#define RF_ADPLL_FSM_EN_LEN                      (1U)
#define RF_ADPLL_FSM_EN_MSK                      (((1U << RF_ADPLL_FSM_EN_LEN) - 1) << RF_ADPLL_FSM_EN_POS)
#define RF_ADPLL_FSM_EN_UMSK                     (~(((1U << RF_ADPLL_FSM_EN_LEN) - 1) << RF_ADPLL_FSM_EN_POS))
#define RF_ADPLL_LOCK_FAIL_EN                    RF_ADPLL_LOCK_FAIL_EN
#define RF_ADPLL_LOCK_FAIL_EN_POS                (14U)
#define RF_ADPLL_LOCK_FAIL_EN_LEN                (1U)
#define RF_ADPLL_LOCK_FAIL_EN_MSK                (((1U << RF_ADPLL_LOCK_FAIL_EN_LEN) - 1) << RF_ADPLL_LOCK_FAIL_EN_POS)
#define RF_ADPLL_LOCK_FAIL_EN_UMSK               (~(((1U << RF_ADPLL_LOCK_FAIL_EN_LEN) - 1) << RF_ADPLL_LOCK_FAIL_EN_POS))
#define RF_ADPLL_ABNORMAL_DEALED                 RF_ADPLL_ABNORMAL_DEALED
#define RF_ADPLL_ABNORMAL_DEALED_POS             (15U)
#define RF_ADPLL_ABNORMAL_DEALED_LEN             (1U)
#define RF_ADPLL_ABNORMAL_DEALED_MSK             (((1U << RF_ADPLL_ABNORMAL_DEALED_LEN) - 1) << RF_ADPLL_ABNORMAL_DEALED_POS)
#define RF_ADPLL_ABNORMAL_DEALED_UMSK            (~(((1U << RF_ADPLL_ABNORMAL_DEALED_LEN) - 1) << RF_ADPLL_ABNORMAL_DEALED_POS))
#define RF_ADPLL_VCTRL_DET_START_EXT             RF_ADPLL_VCTRL_DET_START_EXT
#define RF_ADPLL_VCTRL_DET_START_EXT_POS         (18U)
#define RF_ADPLL_VCTRL_DET_START_EXT_LEN         (1U)
#define RF_ADPLL_VCTRL_DET_START_EXT_MSK         (((1U << RF_ADPLL_VCTRL_DET_START_EXT_LEN) - 1) << RF_ADPLL_VCTRL_DET_START_EXT_POS)
#define RF_ADPLL_VCTRL_DET_START_EXT_UMSK        (~(((1U << RF_ADPLL_VCTRL_DET_START_EXT_LEN) - 1) << RF_ADPLL_VCTRL_DET_START_EXT_POS))
#define RF_ADPLL_VCTRL_DET_EN_EXT                RF_ADPLL_VCTRL_DET_EN_EXT
#define RF_ADPLL_VCTRL_DET_EN_EXT_POS            (19U)
#define RF_ADPLL_VCTRL_DET_EN_EXT_LEN            (1U)
#define RF_ADPLL_VCTRL_DET_EN_EXT_MSK            (((1U << RF_ADPLL_VCTRL_DET_EN_EXT_LEN) - 1) << RF_ADPLL_VCTRL_DET_EN_EXT_POS)
#define RF_ADPLL_VCTRL_DET_EN_EXT_UMSK           (~(((1U << RF_ADPLL_VCTRL_DET_EN_EXT_LEN) - 1) << RF_ADPLL_VCTRL_DET_EN_EXT_POS))
#define RF_ADPLL_MOM_UPDATE_EN_EXT               RF_ADPLL_MOM_UPDATE_EN_EXT
#define RF_ADPLL_MOM_UPDATE_EN_EXT_POS           (20U)
#define RF_ADPLL_MOM_UPDATE_EN_EXT_LEN           (1U)
#define RF_ADPLL_MOM_UPDATE_EN_EXT_MSK           (((1U << RF_ADPLL_MOM_UPDATE_EN_EXT_LEN) - 1) << RF_ADPLL_MOM_UPDATE_EN_EXT_POS)
#define RF_ADPLL_MOM_UPDATE_EN_EXT_UMSK          (~(((1U << RF_ADPLL_MOM_UPDATE_EN_EXT_LEN) - 1) << RF_ADPLL_MOM_UPDATE_EN_EXT_POS))
#define RF_ADPLL_FREQERR_DET_START_EXT           RF_ADPLL_FREQERR_DET_START_EXT
#define RF_ADPLL_FREQERR_DET_START_EXT_POS       (21U)
#define RF_ADPLL_FREQERR_DET_START_EXT_LEN       (1U)
#define RF_ADPLL_FREQERR_DET_START_EXT_MSK       (((1U << RF_ADPLL_FREQERR_DET_START_EXT_LEN) - 1) << RF_ADPLL_FREQERR_DET_START_EXT_POS)
#define RF_ADPLL_FREQERR_DET_START_EXT_UMSK      (~(((1U << RF_ADPLL_FREQERR_DET_START_EXT_LEN) - 1) << RF_ADPLL_FREQERR_DET_START_EXT_POS))
#define RF_ADPLL_MOM_SEARCH_EN_EXT               RF_ADPLL_MOM_SEARCH_EN_EXT
#define RF_ADPLL_MOM_SEARCH_EN_EXT_POS           (22U)
#define RF_ADPLL_MOM_SEARCH_EN_EXT_LEN           (1U)
#define RF_ADPLL_MOM_SEARCH_EN_EXT_MSK           (((1U << RF_ADPLL_MOM_SEARCH_EN_EXT_LEN) - 1) << RF_ADPLL_MOM_SEARCH_EN_EXT_POS)
#define RF_ADPLL_MOM_SEARCH_EN_EXT_UMSK          (~(((1U << RF_ADPLL_MOM_SEARCH_EN_EXT_LEN) - 1) << RF_ADPLL_MOM_SEARCH_EN_EXT_POS))
#define RF_ADPLL_LO_OPEN                         RF_ADPLL_LO_OPEN
#define RF_ADPLL_LO_OPEN_POS                     (23U)
#define RF_ADPLL_LO_OPEN_LEN                     (1U)
#define RF_ADPLL_LO_OPEN_MSK                     (((1U << RF_ADPLL_LO_OPEN_LEN) - 1) << RF_ADPLL_LO_OPEN_POS)
#define RF_ADPLL_LO_OPEN_UMSK                    (~(((1U << RF_ADPLL_LO_OPEN_LEN) - 1) << RF_ADPLL_LO_OPEN_POS))
#define RF_ADPLL_SFREG_SEL                       RF_ADPLL_SFREG_SEL
#define RF_ADPLL_SFREG_SEL_POS                   (24U)
#define RF_ADPLL_SFREG_SEL_LEN                   (1U)
#define RF_ADPLL_SFREG_SEL_MSK                   (((1U << RF_ADPLL_SFREG_SEL_LEN) - 1) << RF_ADPLL_SFREG_SEL_POS)
#define RF_ADPLL_SFREG_SEL_UMSK                  (~(((1U << RF_ADPLL_SFREG_SEL_LEN) - 1) << RF_ADPLL_SFREG_SEL_POS))
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL      RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_POS  (25U)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_LEN  (1U)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_MSK  (((1U << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_LEN) - 1) << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_POS)
#define RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_UMSK (~(((1U << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_LEN) - 1) << RF_ADPLL_LO_UNLOCK_INTRPT_CLEAR_SEL_POS))
#define RF_ADPLL_FORCE_INC_FCAL_EN               RF_ADPLL_FORCE_INC_FCAL_EN
#define RF_ADPLL_FORCE_INC_FCAL_EN_POS           (26U)
#define RF_ADPLL_FORCE_INC_FCAL_EN_LEN           (1U)
#define RF_ADPLL_FORCE_INC_FCAL_EN_MSK           (((1U << RF_ADPLL_FORCE_INC_FCAL_EN_LEN) - 1) << RF_ADPLL_FORCE_INC_FCAL_EN_POS)
#define RF_ADPLL_FORCE_INC_FCAL_EN_UMSK          (~(((1U << RF_ADPLL_FORCE_INC_FCAL_EN_LEN) - 1) << RF_ADPLL_FORCE_INC_FCAL_EN_POS))

