bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x26C : adpll_lf_reg */
#define RF_ADPLL_LF_REG_OFFSET           (0x26C)
#define RF_ADPLL_LF_VCTRL_RANGE_EXT      RF_ADPLL_LF_VCTRL_RANGE_EXT
#define RF_ADPLL_LF_VCTRL_RANGE_EXT_POS  (0U)
#define RF_ADPLL_LF_VCTRL_RANGE_EXT_LEN  (2U)
#define RF_ADPLL_LF_VCTRL_RANGE_EXT_MSK  (((1U << RF_ADPLL_LF_VCTRL_RANGE_EXT_LEN) - 1) << RF_ADPLL_LF_VCTRL_RANGE_EXT_POS)
#define RF_ADPLL_LF_VCTRL_RANGE_EXT_UMSK (~(((1U << RF_ADPLL_LF_VCTRL_RANGE_EXT_LEN) - 1) << RF_ADPLL_LF_VCTRL_RANGE_EXT_POS))
#define RF_ADPLL_LF_LSB_EXT              RF_ADPLL_LF_LSB_EXT
#define RF_ADPLL_LF_LSB_EXT_POS          (2U)
#define RF_ADPLL_LF_LSB_EXT_LEN          (7U)
#define RF_ADPLL_LF_LSB_EXT_MSK          (((1U << RF_ADPLL_LF_LSB_EXT_LEN) - 1) << RF_ADPLL_LF_LSB_EXT_POS)
#define RF_ADPLL_LF_LSB_EXT_UMSK         (~(((1U << RF_ADPLL_LF_LSB_EXT_LEN) - 1) << RF_ADPLL_LF_LSB_EXT_POS))
#define RF_ADPLL_LF_AVG_EN               RF_ADPLL_LF_AVG_EN
#define RF_ADPLL_LF_AVG_EN_POS           (9U)
#define RF_ADPLL_LF_AVG_EN_LEN           (1U)
#define RF_ADPLL_LF_AVG_EN_MSK           (((1U << RF_ADPLL_LF_AVG_EN_LEN) - 1) << RF_ADPLL_LF_AVG_EN_POS)
#define RF_ADPLL_LF_AVG_EN_UMSK          (~(((1U << RF_ADPLL_LF_AVG_EN_LEN) - 1) << RF_ADPLL_LF_AVG_EN_POS))
#define RF_ADPLL_LF_F_P3                 RF_ADPLL_LF_F_P3
#define RF_ADPLL_LF_F_P3_POS             (10U)
#define RF_ADPLL_LF_F_P3_LEN             (2U)
#define RF_ADPLL_LF_F_P3_MSK             (((1U << RF_ADPLL_LF_F_P3_LEN) - 1) << RF_ADPLL_LF_F_P3_POS)
#define RF_ADPLL_LF_F_P3_UMSK            (~(((1U << RF_ADPLL_LF_F_P3_LEN) - 1) << RF_ADPLL_LF_F_P3_POS))
#define RF_ADPLL_LF_BETA_FAST            RF_ADPLL_LF_BETA_FAST
#define RF_ADPLL_LF_BETA_FAST_POS        (13U)
#define RF_ADPLL_LF_BETA_FAST_LEN        (1U)
#define RF_ADPLL_LF_BETA_FAST_MSK        (((1U << RF_ADPLL_LF_BETA_FAST_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_POS)
#define RF_ADPLL_LF_BETA_FAST_UMSK       (~(((1U << RF_ADPLL_LF_BETA_FAST_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_POS))
#define RF_ADPLL_LF_BETA_EXP             RF_ADPLL_LF_BETA_EXP
#define RF_ADPLL_LF_BETA_EXP_POS         (14U)
#define RF_ADPLL_LF_BETA_EXP_LEN         (3U)
#define RF_ADPLL_LF_BETA_EXP_MSK         (((1U << RF_ADPLL_LF_BETA_EXP_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_POS)
#define RF_ADPLL_LF_BETA_EXP_UMSK        (~(((1U << RF_ADPLL_LF_BETA_EXP_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_POS))
#define RF_ADPLL_LF_BETA_BASE            RF_ADPLL_LF_BETA_BASE
#define RF_ADPLL_LF_BETA_BASE_POS        (17U)
#define RF_ADPLL_LF_BETA_BASE_LEN        (2U)
#define RF_ADPLL_LF_BETA_BASE_MSK        (((1U << RF_ADPLL_LF_BETA_BASE_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_POS)
#define RF_ADPLL_LF_BETA_BASE_UMSK       (~(((1U << RF_ADPLL_LF_BETA_BASE_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_POS))
#define RF_ADPLL_LF_ALPHA_FAST           RF_ADPLL_LF_ALPHA_FAST
#define RF_ADPLL_LF_ALPHA_FAST_POS       (20U)
#define RF_ADPLL_LF_ALPHA_FAST_LEN       (2U)
#define RF_ADPLL_LF_ALPHA_FAST_MSK       (((1U << RF_ADPLL_LF_ALPHA_FAST_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_POS)
#define RF_ADPLL_LF_ALPHA_FAST_UMSK      (~(((1U << RF_ADPLL_LF_ALPHA_FAST_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_POS))
#define RF_ADPLL_LF_ALPHA_EXP            RF_ADPLL_LF_ALPHA_EXP
#define RF_ADPLL_LF_ALPHA_EXP_POS        (24U)
#define RF_ADPLL_LF_ALPHA_EXP_LEN        (3U)
#define RF_ADPLL_LF_ALPHA_EXP_MSK        (((1U << RF_ADPLL_LF_ALPHA_EXP_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_POS)
#define RF_ADPLL_LF_ALPHA_EXP_UMSK       (~(((1U << RF_ADPLL_LF_ALPHA_EXP_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_POS))
#define RF_ADPLL_LF_ALPHA_BASE           RF_ADPLL_LF_ALPHA_BASE
#define RF_ADPLL_LF_ALPHA_BASE_POS       (27U)
#define RF_ADPLL_LF_ALPHA_BASE_LEN       (1U)
#define RF_ADPLL_LF_ALPHA_BASE_MSK       (((1U << RF_ADPLL_LF_ALPHA_BASE_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_POS)
#define RF_ADPLL_LF_ALPHA_BASE_UMSK      (~(((1U << RF_ADPLL_LF_ALPHA_BASE_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_POS))
#define RF_ADPLL_LF_CTRL_HW              RF_ADPLL_LF_CTRL_HW
#define RF_ADPLL_LF_CTRL_HW_POS          (28U)
#define RF_ADPLL_LF_CTRL_HW_LEN          (1U)
#define RF_ADPLL_LF_CTRL_HW_MSK          (((1U << RF_ADPLL_LF_CTRL_HW_LEN) - 1) << RF_ADPLL_LF_CTRL_HW_POS)
#define RF_ADPLL_LF_CTRL_HW_UMSK         (~(((1U << RF_ADPLL_LF_CTRL_HW_LEN) - 1) << RF_ADPLL_LF_CTRL_HW_POS))

/* 0x270 : adpll_lf_tx */
#define RF_ADPLL_LF_TX_OFFSET          (0x270)
#define RF_ADPLL_LF_F_P3_TX            RF_ADPLL_LF_F_P3_TX
#define RF_ADPLL_LF_F_P3_TX_POS        (10U)
#define RF_ADPLL_LF_F_P3_TX_LEN        (2U)
#define RF_ADPLL_LF_F_P3_TX_MSK        (((1U << RF_ADPLL_LF_F_P3_TX_LEN) - 1) << RF_ADPLL_LF_F_P3_TX_POS)
#define RF_ADPLL_LF_F_P3_TX_UMSK       (~(((1U << RF_ADPLL_LF_F_P3_TX_LEN) - 1) << RF_ADPLL_LF_F_P3_TX_POS))
#define RF_ADPLL_LF_BETA_FAST_TX       RF_ADPLL_LF_BETA_FAST_TX
#define RF_ADPLL_LF_BETA_FAST_TX_POS   (13U)
#define RF_ADPLL_LF_BETA_FAST_TX_LEN   (1U)
#define RF_ADPLL_LF_BETA_FAST_TX_MSK   (((1U << RF_ADPLL_LF_BETA_FAST_TX_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_TX_POS)
#define RF_ADPLL_LF_BETA_FAST_TX_UMSK  (~(((1U << RF_ADPLL_LF_BETA_FAST_TX_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_TX_POS))
#define RF_ADPLL_LF_BETA_EXP_TX        RF_ADPLL_LF_BETA_EXP_TX
#define RF_ADPLL_LF_BETA_EXP_TX_POS    (14U)
#define RF_ADPLL_LF_BETA_EXP_TX_LEN    (3U)
#define RF_ADPLL_LF_BETA_EXP_TX_MSK    (((1U << RF_ADPLL_LF_BETA_EXP_TX_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_TX_POS)
#define RF_ADPLL_LF_BETA_EXP_TX_UMSK   (~(((1U << RF_ADPLL_LF_BETA_EXP_TX_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_TX_POS))
#define RF_ADPLL_LF_BETA_BASE_TX       RF_ADPLL_LF_BETA_BASE_TX
#define RF_ADPLL_LF_BETA_BASE_TX_POS   (17U)
#define RF_ADPLL_LF_BETA_BASE_TX_LEN   (2U)
#define RF_ADPLL_LF_BETA_BASE_TX_MSK   (((1U << RF_ADPLL_LF_BETA_BASE_TX_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_TX_POS)
#define RF_ADPLL_LF_BETA_BASE_TX_UMSK  (~(((1U << RF_ADPLL_LF_BETA_BASE_TX_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_TX_POS))
#define RF_ADPLL_LF_ALPHA_FAST_TX      RF_ADPLL_LF_ALPHA_FAST_TX
#define RF_ADPLL_LF_ALPHA_FAST_TX_POS  (20U)
#define RF_ADPLL_LF_ALPHA_FAST_TX_LEN  (2U)
#define RF_ADPLL_LF_ALPHA_FAST_TX_MSK  (((1U << RF_ADPLL_LF_ALPHA_FAST_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_TX_POS)
#define RF_ADPLL_LF_ALPHA_FAST_TX_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_FAST_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_TX_POS))
#define RF_ADPLL_LF_ALPHA_EXP_TX       RF_ADPLL_LF_ALPHA_EXP_TX
#define RF_ADPLL_LF_ALPHA_EXP_TX_POS   (24U)
#define RF_ADPLL_LF_ALPHA_EXP_TX_LEN   (3U)
#define RF_ADPLL_LF_ALPHA_EXP_TX_MSK   (((1U << RF_ADPLL_LF_ALPHA_EXP_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_TX_POS)
#define RF_ADPLL_LF_ALPHA_EXP_TX_UMSK  (~(((1U << RF_ADPLL_LF_ALPHA_EXP_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_TX_POS))
#define RF_ADPLL_LF_ALPHA_BASE_TX      RF_ADPLL_LF_ALPHA_BASE_TX
#define RF_ADPLL_LF_ALPHA_BASE_TX_POS  (27U)
#define RF_ADPLL_LF_ALPHA_BASE_TX_LEN  (1U)
#define RF_ADPLL_LF_ALPHA_BASE_TX_MSK  (((1U << RF_ADPLL_LF_ALPHA_BASE_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_TX_POS)
#define RF_ADPLL_LF_ALPHA_BASE_TX_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_BASE_TX_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_TX_POS))

/* 0x274 : adpll_lf_rx */
#define RF_ADPLL_LF_RX_OFFSET          (0x274)
#define RF_ADPLL_LF_F_P3_RX            RF_ADPLL_LF_F_P3_RX
#define RF_ADPLL_LF_F_P3_RX_POS        (10U)
#define RF_ADPLL_LF_F_P3_RX_LEN        (2U)
#define RF_ADPLL_LF_F_P3_RX_MSK        (((1U << RF_ADPLL_LF_F_P3_RX_LEN) - 1) << RF_ADPLL_LF_F_P3_RX_POS)
#define RF_ADPLL_LF_F_P3_RX_UMSK       (~(((1U << RF_ADPLL_LF_F_P3_RX_LEN) - 1) << RF_ADPLL_LF_F_P3_RX_POS))
#define RF_ADPLL_LF_BETA_FAST_RX       RF_ADPLL_LF_BETA_FAST_RX
#define RF_ADPLL_LF_BETA_FAST_RX_POS   (13U)
#define RF_ADPLL_LF_BETA_FAST_RX_LEN   (1U)
#define RF_ADPLL_LF_BETA_FAST_RX_MSK   (((1U << RF_ADPLL_LF_BETA_FAST_RX_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_RX_POS)
#define RF_ADPLL_LF_BETA_FAST_RX_UMSK  (~(((1U << RF_ADPLL_LF_BETA_FAST_RX_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_RX_POS))
#define RF_ADPLL_LF_BETA_EXP_RX        RF_ADPLL_LF_BETA_EXP_RX
#define RF_ADPLL_LF_BETA_EXP_RX_POS    (14U)
#define RF_ADPLL_LF_BETA_EXP_RX_LEN    (3U)
#define RF_ADPLL_LF_BETA_EXP_RX_MSK    (((1U << RF_ADPLL_LF_BETA_EXP_RX_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_RX_POS)
#define RF_ADPLL_LF_BETA_EXP_RX_UMSK   (~(((1U << RF_ADPLL_LF_BETA_EXP_RX_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_RX_POS))
#define RF_ADPLL_LF_BETA_BASE_RX       RF_ADPLL_LF_BETA_BASE_RX
#define RF_ADPLL_LF_BETA_BASE_RX_POS   (17U)
#define RF_ADPLL_LF_BETA_BASE_RX_LEN   (2U)
#define RF_ADPLL_LF_BETA_BASE_RX_MSK   (((1U << RF_ADPLL_LF_BETA_BASE_RX_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_RX_POS)
#define RF_ADPLL_LF_BETA_BASE_RX_UMSK  (~(((1U << RF_ADPLL_LF_BETA_BASE_RX_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_RX_POS))
#define RF_ADPLL_LF_ALPHA_FAST_RX      RF_ADPLL_LF_ALPHA_FAST_RX
#define RF_ADPLL_LF_ALPHA_FAST_RX_POS  (20U)
#define RF_ADPLL_LF_ALPHA_FAST_RX_LEN  (2U)
#define RF_ADPLL_LF_ALPHA_FAST_RX_MSK  (((1U << RF_ADPLL_LF_ALPHA_FAST_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_RX_POS)
#define RF_ADPLL_LF_ALPHA_FAST_RX_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_FAST_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_RX_POS))
#define RF_ADPLL_LF_ALPHA_EXP_RX       RF_ADPLL_LF_ALPHA_EXP_RX
#define RF_ADPLL_LF_ALPHA_EXP_RX_POS   (24U)
#define RF_ADPLL_LF_ALPHA_EXP_RX_LEN   (3U)
#define RF_ADPLL_LF_ALPHA_EXP_RX_MSK   (((1U << RF_ADPLL_LF_ALPHA_EXP_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_RX_POS)
#define RF_ADPLL_LF_ALPHA_EXP_RX_UMSK  (~(((1U << RF_ADPLL_LF_ALPHA_EXP_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_RX_POS))
#define RF_ADPLL_LF_ALPHA_BASE_RX      RF_ADPLL_LF_ALPHA_BASE_RX
#define RF_ADPLL_LF_ALPHA_BASE_RX_POS  (27U)
#define RF_ADPLL_LF_ALPHA_BASE_RX_LEN  (1U)
#define RF_ADPLL_LF_ALPHA_BASE_RX_MSK  (((1U << RF_ADPLL_LF_ALPHA_BASE_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_RX_POS)
#define RF_ADPLL_LF_ALPHA_BASE_RX_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_BASE_RX_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_RX_POS))

/* 0x278 : adpll_lf_hw */
#define RF_ADPLL_LF_HW_OFFSET          (0x278)
#define RF_ADPLL_LF_F_P3_HW            RF_ADPLL_LF_F_P3_HW
#define RF_ADPLL_LF_F_P3_HW_POS        (10U)
#define RF_ADPLL_LF_F_P3_HW_LEN        (2U)
#define RF_ADPLL_LF_F_P3_HW_MSK        (((1U << RF_ADPLL_LF_F_P3_HW_LEN) - 1) << RF_ADPLL_LF_F_P3_HW_POS)
#define RF_ADPLL_LF_F_P3_HW_UMSK       (~(((1U << RF_ADPLL_LF_F_P3_HW_LEN) - 1) << RF_ADPLL_LF_F_P3_HW_POS))
#define RF_ADPLL_LF_BETA_FAST_HW       RF_ADPLL_LF_BETA_FAST_HW
#define RF_ADPLL_LF_BETA_FAST_HW_POS   (13U)
#define RF_ADPLL_LF_BETA_FAST_HW_LEN   (1U)
#define RF_ADPLL_LF_BETA_FAST_HW_MSK   (((1U << RF_ADPLL_LF_BETA_FAST_HW_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_HW_POS)
#define RF_ADPLL_LF_BETA_FAST_HW_UMSK  (~(((1U << RF_ADPLL_LF_BETA_FAST_HW_LEN) - 1) << RF_ADPLL_LF_BETA_FAST_HW_POS))
#define RF_ADPLL_LF_BETA_EXP_HW        RF_ADPLL_LF_BETA_EXP_HW
#define RF_ADPLL_LF_BETA_EXP_HW_POS    (14U)
#define RF_ADPLL_LF_BETA_EXP_HW_LEN    (3U)
#define RF_ADPLL_LF_BETA_EXP_HW_MSK    (((1U << RF_ADPLL_LF_BETA_EXP_HW_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_HW_POS)
#define RF_ADPLL_LF_BETA_EXP_HW_UMSK   (~(((1U << RF_ADPLL_LF_BETA_EXP_HW_LEN) - 1) << RF_ADPLL_LF_BETA_EXP_HW_POS))
#define RF_ADPLL_LF_BETA_BASE_HW       RF_ADPLL_LF_BETA_BASE_HW
#define RF_ADPLL_LF_BETA_BASE_HW_POS   (17U)
#define RF_ADPLL_LF_BETA_BASE_HW_LEN   (2U)
#define RF_ADPLL_LF_BETA_BASE_HW_MSK   (((1U << RF_ADPLL_LF_BETA_BASE_HW_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_HW_POS)
#define RF_ADPLL_LF_BETA_BASE_HW_UMSK  (~(((1U << RF_ADPLL_LF_BETA_BASE_HW_LEN) - 1) << RF_ADPLL_LF_BETA_BASE_HW_POS))
#define RF_ADPLL_LF_ALPHA_FAST_HW      RF_ADPLL_LF_ALPHA_FAST_HW
#define RF_ADPLL_LF_ALPHA_FAST_HW_POS  (20U)
#define RF_ADPLL_LF_ALPHA_FAST_HW_LEN  (2U)
#define RF_ADPLL_LF_ALPHA_FAST_HW_MSK  (((1U << RF_ADPLL_LF_ALPHA_FAST_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_HW_POS)
#define RF_ADPLL_LF_ALPHA_FAST_HW_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_FAST_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_FAST_HW_POS))
#define RF_ADPLL_LF_ALPHA_EXP_HW       RF_ADPLL_LF_ALPHA_EXP_HW
#define RF_ADPLL_LF_ALPHA_EXP_HW_POS   (24U)
#define RF_ADPLL_LF_ALPHA_EXP_HW_LEN   (3U)
#define RF_ADPLL_LF_ALPHA_EXP_HW_MSK   (((1U << RF_ADPLL_LF_ALPHA_EXP_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_HW_POS)
#define RF_ADPLL_LF_ALPHA_EXP_HW_UMSK  (~(((1U << RF_ADPLL_LF_ALPHA_EXP_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_EXP_HW_POS))
#define RF_ADPLL_LF_ALPHA_BASE_HW      RF_ADPLL_LF_ALPHA_BASE_HW
#define RF_ADPLL_LF_ALPHA_BASE_HW_POS  (27U)
#define RF_ADPLL_LF_ALPHA_BASE_HW_LEN  (1U)
#define RF_ADPLL_LF_ALPHA_BASE_HW_MSK  (((1U << RF_ADPLL_LF_ALPHA_BASE_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_HW_POS)
#define RF_ADPLL_LF_ALPHA_BASE_HW_UMSK (~(((1U << RF_ADPLL_LF_ALPHA_BASE_HW_LEN) - 1) << RF_ADPLL_LF_ALPHA_BASE_HW_POS))

