bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x27C : adpll_vctrl */
#define RF_ADPLL_VCTRL_OFFSET                (0x27C)
#define RF_SDMOUT_DLY_SEL                    RF_SDMOUT_DLY_SEL
#define RF_SDMOUT_DLY_SEL_POS                (0U)
#define RF_SDMOUT_DLY_SEL_LEN                (2U)
#define RF_SDMOUT_DLY_SEL_MSK                (((1U << RF_SDMOUT_DLY_SEL_LEN) - 1) << RF_SDMOUT_DLY_SEL_POS)
#define RF_SDMOUT_DLY_SEL_UMSK               (~(((1U << RF_SDMOUT_DLY_SEL_LEN) - 1) << RF_SDMOUT_DLY_SEL_POS))
#define RF_SDM_BYPASS                        RF_SDM_BYPASS
#define RF_SDM_BYPASS_POS                    (4U)
#define RF_SDM_BYPASS_LEN                    (1U)
#define RF_SDM_BYPASS_MSK                    (((1U << RF_SDM_BYPASS_LEN) - 1) << RF_SDM_BYPASS_POS)
#define RF_SDM_BYPASS_UMSK                   (~(((1U << RF_SDM_BYPASS_LEN) - 1) << RF_SDM_BYPASS_POS))
#define RF_SDM_DITHER                        RF_SDM_DITHER
#define RF_SDM_DITHER_POS                    (8U)
#define RF_SDM_DITHER_LEN                    (2U)
#define RF_SDM_DITHER_MSK                    (((1U << RF_SDM_DITHER_LEN) - 1) << RF_SDM_DITHER_POS)
#define RF_SDM_DITHER_UMSK                   (~(((1U << RF_SDM_DITHER_LEN) - 1) << RF_SDM_DITHER_POS))
#define RF_SDM_ORDER                         RF_SDM_ORDER
#define RF_SDM_ORDER_POS                     (12U)
#define RF_SDM_ORDER_LEN                     (1U)
#define RF_SDM_ORDER_MSK                     (((1U << RF_SDM_ORDER_LEN) - 1) << RF_SDM_ORDER_POS)
#define RF_SDM_ORDER_UMSK                    (~(((1U << RF_SDM_ORDER_LEN) - 1) << RF_SDM_ORDER_POS))
#define RF_ADPLL_CAPCODE_BYPASS              RF_ADPLL_CAPCODE_BYPASS
#define RF_ADPLL_CAPCODE_BYPASS_POS          (14U)
#define RF_ADPLL_CAPCODE_BYPASS_LEN          (1U)
#define RF_ADPLL_CAPCODE_BYPASS_MSK          (((1U << RF_ADPLL_CAPCODE_BYPASS_LEN) - 1) << RF_ADPLL_CAPCODE_BYPASS_POS)
#define RF_ADPLL_CAPCODE_BYPASS_UMSK         (~(((1U << RF_ADPLL_CAPCODE_BYPASS_LEN) - 1) << RF_ADPLL_CAPCODE_BYPASS_POS))
#define RF_ADPLL_DCO_MASH_BYPASS             RF_ADPLL_DCO_MASH_BYPASS
#define RF_ADPLL_DCO_MASH_BYPASS_POS         (15U)
#define RF_ADPLL_DCO_MASH_BYPASS_LEN         (1U)
#define RF_ADPLL_DCO_MASH_BYPASS_MSK         (((1U << RF_ADPLL_DCO_MASH_BYPASS_LEN) - 1) << RF_ADPLL_DCO_MASH_BYPASS_POS)
#define RF_ADPLL_DCO_MASH_BYPASS_UMSK        (~(((1U << RF_ADPLL_DCO_MASH_BYPASS_LEN) - 1) << RF_ADPLL_DCO_MASH_BYPASS_POS))
#define RF_ADPLL_FORCE_MOM_HOLD              RF_ADPLL_FORCE_MOM_HOLD
#define RF_ADPLL_FORCE_MOM_HOLD_POS          (16U)
#define RF_ADPLL_FORCE_MOM_HOLD_LEN          (1U)
#define RF_ADPLL_FORCE_MOM_HOLD_MSK          (((1U << RF_ADPLL_FORCE_MOM_HOLD_LEN) - 1) << RF_ADPLL_FORCE_MOM_HOLD_POS)
#define RF_ADPLL_FORCE_MOM_HOLD_UMSK         (~(((1U << RF_ADPLL_FORCE_MOM_HOLD_LEN) - 1) << RF_ADPLL_FORCE_MOM_HOLD_POS))
#define RF_ADPLL_MOM_UPDATE_PERIOD           RF_ADPLL_MOM_UPDATE_PERIOD
#define RF_ADPLL_MOM_UPDATE_PERIOD_POS       (20U)
#define RF_ADPLL_MOM_UPDATE_PERIOD_LEN       (2U)
#define RF_ADPLL_MOM_UPDATE_PERIOD_MSK       (((1U << RF_ADPLL_MOM_UPDATE_PERIOD_LEN) - 1) << RF_ADPLL_MOM_UPDATE_PERIOD_POS)
#define RF_ADPLL_MOM_UPDATE_PERIOD_UMSK      (~(((1U << RF_ADPLL_MOM_UPDATE_PERIOD_LEN) - 1) << RF_ADPLL_MOM_UPDATE_PERIOD_POS))
#define RF_ADPLL_VCTRL_DET_CONS_EN           RF_ADPLL_VCTRL_DET_CONS_EN
#define RF_ADPLL_VCTRL_DET_CONS_EN_POS       (24U)
#define RF_ADPLL_VCTRL_DET_CONS_EN_LEN       (1U)
#define RF_ADPLL_VCTRL_DET_CONS_EN_MSK       (((1U << RF_ADPLL_VCTRL_DET_CONS_EN_LEN) - 1) << RF_ADPLL_VCTRL_DET_CONS_EN_POS)
#define RF_ADPLL_VCTRL_DET_CONS_EN_UMSK      (~(((1U << RF_ADPLL_VCTRL_DET_CONS_EN_LEN) - 1) << RF_ADPLL_VCTRL_DET_CONS_EN_POS))
#define RF_ADPLL_VCTRL_MONI_WIN_SEL          RF_ADPLL_VCTRL_MONI_WIN_SEL
#define RF_ADPLL_VCTRL_MONI_WIN_SEL_POS      (25U)
#define RF_ADPLL_VCTRL_MONI_WIN_SEL_LEN      (1U)
#define RF_ADPLL_VCTRL_MONI_WIN_SEL_MSK      (((1U << RF_ADPLL_VCTRL_MONI_WIN_SEL_LEN) - 1) << RF_ADPLL_VCTRL_MONI_WIN_SEL_POS)
#define RF_ADPLL_VCTRL_MONI_WIN_SEL_UMSK     (~(((1U << RF_ADPLL_VCTRL_MONI_WIN_SEL_LEN) - 1) << RF_ADPLL_VCTRL_MONI_WIN_SEL_POS))
#define RF_ADPLL_VCTRL_LOCK_WIN_SEL          RF_ADPLL_VCTRL_LOCK_WIN_SEL
#define RF_ADPLL_VCTRL_LOCK_WIN_SEL_POS      (26U)
#define RF_ADPLL_VCTRL_LOCK_WIN_SEL_LEN      (1U)
#define RF_ADPLL_VCTRL_LOCK_WIN_SEL_MSK      (((1U << RF_ADPLL_VCTRL_LOCK_WIN_SEL_LEN) - 1) << RF_ADPLL_VCTRL_LOCK_WIN_SEL_POS)
#define RF_ADPLL_VCTRL_LOCK_WIN_SEL_UMSK     (~(((1U << RF_ADPLL_VCTRL_LOCK_WIN_SEL_LEN) - 1) << RF_ADPLL_VCTRL_LOCK_WIN_SEL_POS))
#define RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN      RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN
#define RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_POS  (27U)
#define RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_LEN  (1U)
#define RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_MSK  (((1U << RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_LEN) - 1) << RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_POS)
#define RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_UMSK (~(((1U << RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_LEN) - 1) << RF_ADPLL_VCTRL_RANGE_SEL_EXT_EN_POS))

/* 0x280 : adpll_lms */
#define RF_ADPLL_LMS_OFFSET                 (0x280)
#define RF_ADPLL_PHA_CANCEL_DELAY           RF_ADPLL_PHA_CANCEL_DELAY
#define RF_ADPLL_PHA_CANCEL_DELAY_POS       (0U)
#define RF_ADPLL_PHA_CANCEL_DELAY_LEN       (2U)
#define RF_ADPLL_PHA_CANCEL_DELAY_MSK       (((1U << RF_ADPLL_PHA_CANCEL_DELAY_LEN) - 1) << RF_ADPLL_PHA_CANCEL_DELAY_POS)
#define RF_ADPLL_PHA_CANCEL_DELAY_UMSK      (~(((1U << RF_ADPLL_PHA_CANCEL_DELAY_LEN) - 1) << RF_ADPLL_PHA_CANCEL_DELAY_POS))
#define RF_ADPLL_PHA_CANCEL_EN              RF_ADPLL_PHA_CANCEL_EN
#define RF_ADPLL_PHA_CANCEL_EN_POS          (4U)
#define RF_ADPLL_PHA_CANCEL_EN_LEN          (1U)
#define RF_ADPLL_PHA_CANCEL_EN_MSK          (((1U << RF_ADPLL_PHA_CANCEL_EN_LEN) - 1) << RF_ADPLL_PHA_CANCEL_EN_POS)
#define RF_ADPLL_PHA_CANCEL_EN_UMSK         (~(((1U << RF_ADPLL_PHA_CANCEL_EN_LEN) - 1) << RF_ADPLL_PHA_CANCEL_EN_POS))
#define RF_ADPLL_LMS_Q_DELAY                RF_ADPLL_LMS_Q_DELAY
#define RF_ADPLL_LMS_Q_DELAY_POS            (8U)
#define RF_ADPLL_LMS_Q_DELAY_LEN            (2U)
#define RF_ADPLL_LMS_Q_DELAY_MSK            (((1U << RF_ADPLL_LMS_Q_DELAY_LEN) - 1) << RF_ADPLL_LMS_Q_DELAY_POS)
#define RF_ADPLL_LMS_Q_DELAY_UMSK           (~(((1U << RF_ADPLL_LMS_Q_DELAY_LEN) - 1) << RF_ADPLL_LMS_Q_DELAY_POS))
#define RF_ADPLL_PHA_PRBS_SEL               RF_ADPLL_PHA_PRBS_SEL
#define RF_ADPLL_PHA_PRBS_SEL_POS           (10U)
#define RF_ADPLL_PHA_PRBS_SEL_LEN           (2U)
#define RF_ADPLL_PHA_PRBS_SEL_MSK           (((1U << RF_ADPLL_PHA_PRBS_SEL_LEN) - 1) << RF_ADPLL_PHA_PRBS_SEL_POS)
#define RF_ADPLL_PHA_PRBS_SEL_UMSK          (~(((1U << RF_ADPLL_PHA_PRBS_SEL_LEN) - 1) << RF_ADPLL_PHA_PRBS_SEL_POS))
#define RF_ADPLL_LMS_STEP_ENLARGE           RF_ADPLL_LMS_STEP_ENLARGE
#define RF_ADPLL_LMS_STEP_ENLARGE_POS       (12U)
#define RF_ADPLL_LMS_STEP_ENLARGE_LEN       (1U)
#define RF_ADPLL_LMS_STEP_ENLARGE_MSK       (((1U << RF_ADPLL_LMS_STEP_ENLARGE_LEN) - 1) << RF_ADPLL_LMS_STEP_ENLARGE_POS)
#define RF_ADPLL_LMS_STEP_ENLARGE_UMSK      (~(((1U << RF_ADPLL_LMS_STEP_ENLARGE_LEN) - 1) << RF_ADPLL_LMS_STEP_ENLARGE_POS))
#define RF_ADPLL_PHA_DITHER_EN              RF_ADPLL_PHA_DITHER_EN
#define RF_ADPLL_PHA_DITHER_EN_POS          (13U)
#define RF_ADPLL_PHA_DITHER_EN_LEN          (1U)
#define RF_ADPLL_PHA_DITHER_EN_MSK          (((1U << RF_ADPLL_PHA_DITHER_EN_LEN) - 1) << RF_ADPLL_PHA_DITHER_EN_POS)
#define RF_ADPLL_PHA_DITHER_EN_UMSK         (~(((1U << RF_ADPLL_PHA_DITHER_EN_LEN) - 1) << RF_ADPLL_PHA_DITHER_EN_POS))
#define RF_ADPLL_PHA_DEM_EN                 RF_ADPLL_PHA_DEM_EN
#define RF_ADPLL_PHA_DEM_EN_POS             (14U)
#define RF_ADPLL_PHA_DEM_EN_LEN             (1U)
#define RF_ADPLL_PHA_DEM_EN_MSK             (((1U << RF_ADPLL_PHA_DEM_EN_LEN) - 1) << RF_ADPLL_PHA_DEM_EN_POS)
#define RF_ADPLL_PHA_DEM_EN_UMSK            (~(((1U << RF_ADPLL_PHA_DEM_EN_LEN) - 1) << RF_ADPLL_PHA_DEM_EN_POS))
#define RF_ADPLL_SDM_DITHER_PRBS_EN         RF_ADPLL_SDM_DITHER_PRBS_EN
#define RF_ADPLL_SDM_DITHER_PRBS_EN_POS     (15U)
#define RF_ADPLL_SDM_DITHER_PRBS_EN_LEN     (1U)
#define RF_ADPLL_SDM_DITHER_PRBS_EN_MSK     (((1U << RF_ADPLL_SDM_DITHER_PRBS_EN_LEN) - 1) << RF_ADPLL_SDM_DITHER_PRBS_EN_POS)
#define RF_ADPLL_SDM_DITHER_PRBS_EN_UMSK    (~(((1U << RF_ADPLL_SDM_DITHER_PRBS_EN_LEN) - 1) << RF_ADPLL_SDM_DITHER_PRBS_EN_POS))
#define RF_ADPLL_LMS_STEP                   RF_ADPLL_LMS_STEP
#define RF_ADPLL_LMS_STEP_POS               (16U)
#define RF_ADPLL_LMS_STEP_LEN               (2U)
#define RF_ADPLL_LMS_STEP_MSK               (((1U << RF_ADPLL_LMS_STEP_LEN) - 1) << RF_ADPLL_LMS_STEP_POS)
#define RF_ADPLL_LMS_STEP_UMSK              (~(((1U << RF_ADPLL_LMS_STEP_LEN) - 1) << RF_ADPLL_LMS_STEP_POS))
#define RF_ADPLL_SDM_DITHER_EN_CTRL_HW      RF_ADPLL_SDM_DITHER_EN_CTRL_HW
#define RF_ADPLL_SDM_DITHER_EN_CTRL_HW_POS  (18U)
#define RF_ADPLL_SDM_DITHER_EN_CTRL_HW_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_CTRL_HW_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_CTRL_HW_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_CTRL_HW_POS)
#define RF_ADPLL_SDM_DITHER_EN_CTRL_HW_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_CTRL_HW_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_CTRL_HW_POS))
#define RF_ADPLL_SDM_DITHER_EN              RF_ADPLL_SDM_DITHER_EN
#define RF_ADPLL_SDM_DITHER_EN_POS          (19U)
#define RF_ADPLL_SDM_DITHER_EN_LEN          (1U)
#define RF_ADPLL_SDM_DITHER_EN_MSK          (((1U << RF_ADPLL_SDM_DITHER_EN_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_POS)
#define RF_ADPLL_SDM_DITHER_EN_UMSK         (~(((1U << RF_ADPLL_SDM_DITHER_EN_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_POS))
#define RF_ADPLL_LMS_EXT_VALUE              RF_ADPLL_LMS_EXT_VALUE
#define RF_ADPLL_LMS_EXT_VALUE_POS          (20U)
#define RF_ADPLL_LMS_EXT_VALUE_LEN          (9U)
#define RF_ADPLL_LMS_EXT_VALUE_MSK          (((1U << RF_ADPLL_LMS_EXT_VALUE_LEN) - 1) << RF_ADPLL_LMS_EXT_VALUE_POS)
#define RF_ADPLL_LMS_EXT_VALUE_UMSK         (~(((1U << RF_ADPLL_LMS_EXT_VALUE_LEN) - 1) << RF_ADPLL_LMS_EXT_VALUE_POS))
#define RF_ADPLL_LMS_EXT_VALUE_EN           RF_ADPLL_LMS_EXT_VALUE_EN
#define RF_ADPLL_LMS_EXT_VALUE_EN_POS       (29U)
#define RF_ADPLL_LMS_EXT_VALUE_EN_LEN       (1U)
#define RF_ADPLL_LMS_EXT_VALUE_EN_MSK       (((1U << RF_ADPLL_LMS_EXT_VALUE_EN_LEN) - 1) << RF_ADPLL_LMS_EXT_VALUE_EN_POS)
#define RF_ADPLL_LMS_EXT_VALUE_EN_UMSK      (~(((1U << RF_ADPLL_LMS_EXT_VALUE_EN_LEN) - 1) << RF_ADPLL_LMS_EXT_VALUE_EN_POS))
#define RF_ADPLL_FREF_DIV2_EN               RF_ADPLL_FREF_DIV2_EN
#define RF_ADPLL_FREF_DIV2_EN_POS           (31U)
#define RF_ADPLL_FREF_DIV2_EN_LEN           (1U)
#define RF_ADPLL_FREF_DIV2_EN_MSK           (((1U << RF_ADPLL_FREF_DIV2_EN_LEN) - 1) << RF_ADPLL_FREF_DIV2_EN_POS)
#define RF_ADPLL_FREF_DIV2_EN_UMSK          (~(((1U << RF_ADPLL_FREF_DIV2_EN_LEN) - 1) << RF_ADPLL_FREF_DIV2_EN_POS))

/* 0x284 : adpll_spd */
#define RF_ADPLL_SPD_OFFSET                      (0x284)
#define RF_ADPLL_SPD_IN_RANGE_DELAY              RF_ADPLL_SPD_IN_RANGE_DELAY
#define RF_ADPLL_SPD_IN_RANGE_DELAY_POS          (0U)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_LEN          (2U)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_MSK          (((1U << RF_ADPLL_SPD_IN_RANGE_DELAY_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_DELAY_POS)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_UMSK         (~(((1U << RF_ADPLL_SPD_IN_RANGE_DELAY_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_DELAY_POS))
#define RF_ADPLL_SPD_OUT_RANGE_DELAY             RF_ADPLL_SPD_OUT_RANGE_DELAY
#define RF_ADPLL_SPD_OUT_RANGE_DELAY_POS         (4U)
#define RF_ADPLL_SPD_OUT_RANGE_DELAY_LEN         (1U)
#define RF_ADPLL_SPD_OUT_RANGE_DELAY_MSK         (((1U << RF_ADPLL_SPD_OUT_RANGE_DELAY_LEN) - 1) << RF_ADPLL_SPD_OUT_RANGE_DELAY_POS)
#define RF_ADPLL_SPD_OUT_RANGE_DELAY_UMSK        (~(((1U << RF_ADPLL_SPD_OUT_RANGE_DELAY_LEN) - 1) << RF_ADPLL_SPD_OUT_RANGE_DELAY_POS))
#define RF_ADPLL_SPD_IN_RANGE_CONS               RF_ADPLL_SPD_IN_RANGE_CONS
#define RF_ADPLL_SPD_IN_RANGE_CONS_POS           (8U)
#define RF_ADPLL_SPD_IN_RANGE_CONS_LEN           (2U)
#define RF_ADPLL_SPD_IN_RANGE_CONS_MSK           (((1U << RF_ADPLL_SPD_IN_RANGE_CONS_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_CONS_POS)
#define RF_ADPLL_SPD_IN_RANGE_CONS_UMSK          (~(((1U << RF_ADPLL_SPD_IN_RANGE_CONS_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_CONS_POS))
#define RF_ADPLL_COARSE_PATH_TURNOFF             RF_ADPLL_COARSE_PATH_TURNOFF
#define RF_ADPLL_COARSE_PATH_TURNOFF_POS         (10U)
#define RF_ADPLL_COARSE_PATH_TURNOFF_LEN         (2U)
#define RF_ADPLL_COARSE_PATH_TURNOFF_MSK         (((1U << RF_ADPLL_COARSE_PATH_TURNOFF_LEN) - 1) << RF_ADPLL_COARSE_PATH_TURNOFF_POS)
#define RF_ADPLL_COARSE_PATH_TURNOFF_UMSK        (~(((1U << RF_ADPLL_COARSE_PATH_TURNOFF_LEN) - 1) << RF_ADPLL_COARSE_PATH_TURNOFF_POS))
#define RF_ADPLL_SPD_THRESHOLD                   RF_ADPLL_SPD_THRESHOLD
#define RF_ADPLL_SPD_THRESHOLD_POS               (12U)
#define RF_ADPLL_SPD_THRESHOLD_LEN               (2U)
#define RF_ADPLL_SPD_THRESHOLD_MSK               (((1U << RF_ADPLL_SPD_THRESHOLD_LEN) - 1) << RF_ADPLL_SPD_THRESHOLD_POS)
#define RF_ADPLL_SPD_THRESHOLD_UMSK              (~(((1U << RF_ADPLL_SPD_THRESHOLD_LEN) - 1) << RF_ADPLL_SPD_THRESHOLD_POS))
#define RF_ADPLL_COARSE_IN_RANGE_CONS            RF_ADPLL_COARSE_IN_RANGE_CONS
#define RF_ADPLL_COARSE_IN_RANGE_CONS_POS        (14U)
#define RF_ADPLL_COARSE_IN_RANGE_CONS_LEN        (2U)
#define RF_ADPLL_COARSE_IN_RANGE_CONS_MSK        (((1U << RF_ADPLL_COARSE_IN_RANGE_CONS_LEN) - 1) << RF_ADPLL_COARSE_IN_RANGE_CONS_POS)
#define RF_ADPLL_COARSE_IN_RANGE_CONS_UMSK       (~(((1U << RF_ADPLL_COARSE_IN_RANGE_CONS_LEN) - 1) << RF_ADPLL_COARSE_IN_RANGE_CONS_POS))
#define RF_ADPLL_SPD_GAIN                        RF_ADPLL_SPD_GAIN
#define RF_ADPLL_SPD_GAIN_POS                    (16U)
#define RF_ADPLL_SPD_GAIN_LEN                    (2U)
#define RF_ADPLL_SPD_GAIN_MSK                    (((1U << RF_ADPLL_SPD_GAIN_LEN) - 1) << RF_ADPLL_SPD_GAIN_POS)
#define RF_ADPLL_SPD_GAIN_UMSK                   (~(((1U << RF_ADPLL_SPD_GAIN_LEN) - 1) << RF_ADPLL_SPD_GAIN_POS))
#define RF_ADPLL_COARSE_GAIN                     RF_ADPLL_COARSE_GAIN
#define RF_ADPLL_COARSE_GAIN_POS                 (18U)
#define RF_ADPLL_COARSE_GAIN_LEN                 (2U)
#define RF_ADPLL_COARSE_GAIN_MSK                 (((1U << RF_ADPLL_COARSE_GAIN_LEN) - 1) << RF_ADPLL_COARSE_GAIN_POS)
#define RF_ADPLL_COARSE_GAIN_UMSK                (~(((1U << RF_ADPLL_COARSE_GAIN_LEN) - 1) << RF_ADPLL_COARSE_GAIN_POS))
#define RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW      RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW
#define RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_POS  (20U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_LEN  (1U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_MSK  (((1U << RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_POS)
#define RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_UMSK (~(((1U << RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_CTRL_HW_POS))
#define RF_ADPLL_FORCE_LF_FAST_MODE              RF_ADPLL_FORCE_LF_FAST_MODE
#define RF_ADPLL_FORCE_LF_FAST_MODE_POS          (21U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_LEN          (1U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_MSK          (((1U << RF_ADPLL_FORCE_LF_FAST_MODE_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_POS)
#define RF_ADPLL_FORCE_LF_FAST_MODE_UMSK         (~(((1U << RF_ADPLL_FORCE_LF_FAST_MODE_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_POS))
#define RF_ADPLL_FORCE_LF_FAST_MODE_HW           RF_ADPLL_FORCE_LF_FAST_MODE_HW
#define RF_ADPLL_FORCE_LF_FAST_MODE_HW_POS       (22U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_HW_LEN       (1U)
#define RF_ADPLL_FORCE_LF_FAST_MODE_HW_MSK       (((1U << RF_ADPLL_FORCE_LF_FAST_MODE_HW_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_HW_POS)
#define RF_ADPLL_FORCE_LF_FAST_MODE_HW_UMSK      (~(((1U << RF_ADPLL_FORCE_LF_FAST_MODE_HW_LEN) - 1) << RF_ADPLL_FORCE_LF_FAST_MODE_HW_POS))
#define RF_ADPLL_COARSE_PHAERR_EN                RF_ADPLL_COARSE_PHAERR_EN
#define RF_ADPLL_COARSE_PHAERR_EN_POS            (23U)
#define RF_ADPLL_COARSE_PHAERR_EN_LEN            (1U)
#define RF_ADPLL_COARSE_PHAERR_EN_MSK            (((1U << RF_ADPLL_COARSE_PHAERR_EN_LEN) - 1) << RF_ADPLL_COARSE_PHAERR_EN_POS)
#define RF_ADPLL_COARSE_PHAERR_EN_UMSK           (~(((1U << RF_ADPLL_COARSE_PHAERR_EN_LEN) - 1) << RF_ADPLL_COARSE_PHAERR_EN_POS))
#define RF_ADPLL_COARSE_PATH_OFFTIME_SEL         RF_ADPLL_COARSE_PATH_OFFTIME_SEL
#define RF_ADPLL_COARSE_PATH_OFFTIME_SEL_POS     (24U)
#define RF_ADPLL_COARSE_PATH_OFFTIME_SEL_LEN     (1U)
#define RF_ADPLL_COARSE_PATH_OFFTIME_SEL_MSK     (((1U << RF_ADPLL_COARSE_PATH_OFFTIME_SEL_LEN) - 1) << RF_ADPLL_COARSE_PATH_OFFTIME_SEL_POS)
#define RF_ADPLL_COARSE_PATH_OFFTIME_SEL_UMSK    (~(((1U << RF_ADPLL_COARSE_PATH_OFFTIME_SEL_LEN) - 1) << RF_ADPLL_COARSE_PATH_OFFTIME_SEL_POS))
#define RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT        RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT
#define RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_POS    (25U)
#define RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_LEN    (2U)
#define RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_MSK    (((1U << RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_LEN) - 1) << RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_POS)
#define RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_UMSK   (~(((1U << RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_LEN) - 1) << RF_ADPLL_SPD_OUTRANGE_DLY_SEL_EXT_POS))
#define RF_ADPLL_SPD_LMS_SSTP_WIN_SEL            RF_ADPLL_SPD_LMS_SSTP_WIN_SEL
#define RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_POS        (27U)
#define RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_LEN        (1U)
#define RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_MSK        (((1U << RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_LEN) - 1) << RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_POS)
#define RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_UMSK       (~(((1U << RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_LEN) - 1) << RF_ADPLL_SPD_LMS_SSTP_WIN_SEL_POS))
#define RF_ADPLL_FORCE_COARSE_PATH_ON            RF_ADPLL_FORCE_COARSE_PATH_ON
#define RF_ADPLL_FORCE_COARSE_PATH_ON_POS        (28U)
#define RF_ADPLL_FORCE_COARSE_PATH_ON_LEN        (1U)
#define RF_ADPLL_FORCE_COARSE_PATH_ON_MSK        (((1U << RF_ADPLL_FORCE_COARSE_PATH_ON_LEN) - 1) << RF_ADPLL_FORCE_COARSE_PATH_ON_POS)
#define RF_ADPLL_FORCE_COARSE_PATH_ON_UMSK       (~(((1U << RF_ADPLL_FORCE_COARSE_PATH_ON_LEN) - 1) << RF_ADPLL_FORCE_COARSE_PATH_ON_POS))
#define RF_ADPLL_COARSEPHA_DLY_SEL               RF_ADPLL_COARSEPHA_DLY_SEL
#define RF_ADPLL_COARSEPHA_DLY_SEL_POS           (29U)
#define RF_ADPLL_COARSEPHA_DLY_SEL_LEN           (1U)
#define RF_ADPLL_COARSEPHA_DLY_SEL_MSK           (((1U << RF_ADPLL_COARSEPHA_DLY_SEL_LEN) - 1) << RF_ADPLL_COARSEPHA_DLY_SEL_POS)
#define RF_ADPLL_COARSEPHA_DLY_SEL_UMSK          (~(((1U << RF_ADPLL_COARSEPHA_DLY_SEL_LEN) - 1) << RF_ADPLL_COARSEPHA_DLY_SEL_POS))
#define RF_ADPLL_SPD_IN_RANGE_DELAY_1            RF_ADPLL_SPD_IN_RANGE_DELAY_1
#define RF_ADPLL_SPD_IN_RANGE_DELAY_1_POS        (30U)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_1_LEN        (2U)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_1_MSK        (((1U << RF_ADPLL_SPD_IN_RANGE_DELAY_1_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_DELAY_1_POS)
#define RF_ADPLL_SPD_IN_RANGE_DELAY_1_UMSK       (~(((1U << RF_ADPLL_SPD_IN_RANGE_DELAY_1_LEN) - 1) << RF_ADPLL_SPD_IN_RANGE_DELAY_1_POS))

