bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x288 : fcal */
#define RF_FCAL_OFFSET                    (0x288)
#define RF_FCAL_DIV_RATIO_ADJ_EN          RF_FCAL_DIV_RATIO_ADJ_EN
#define RF_FCAL_DIV_RATIO_ADJ_EN_POS      (0U)
#define RF_FCAL_DIV_RATIO_ADJ_EN_LEN      (1U)
#define RF_FCAL_DIV_RATIO_ADJ_EN_MSK      (((1U << RF_FCAL_DIV_RATIO_ADJ_EN_LEN) - 1) << RF_FCAL_DIV_RATIO_ADJ_EN_POS)
#define RF_FCAL_DIV_RATIO_ADJ_EN_UMSK     (~(((1U << RF_FCAL_DIV_RATIO_ADJ_EN_LEN) - 1) << RF_FCAL_DIV_RATIO_ADJ_EN_POS))
#define RF_FCAL_COARSE_PHA_THRESHOLD      RF_FCAL_COARSE_PHA_THRESHOLD
#define RF_FCAL_COARSE_PHA_THRESHOLD_POS  (1U)
#define RF_FCAL_COARSE_PHA_THRESHOLD_LEN  (2U)
#define RF_FCAL_COARSE_PHA_THRESHOLD_MSK  (((1U << RF_FCAL_COARSE_PHA_THRESHOLD_LEN) - 1) << RF_FCAL_COARSE_PHA_THRESHOLD_POS)
#define RF_FCAL_COARSE_PHA_THRESHOLD_UMSK (~(((1U << RF_FCAL_COARSE_PHA_THRESHOLD_LEN) - 1) << RF_FCAL_COARSE_PHA_THRESHOLD_POS))
#define RF_FCAL_MOM_TOGGLE_CNT            RF_FCAL_MOM_TOGGLE_CNT
#define RF_FCAL_MOM_TOGGLE_CNT_POS        (3U)
#define RF_FCAL_MOM_TOGGLE_CNT_LEN        (1U)
#define RF_FCAL_MOM_TOGGLE_CNT_MSK        (((1U << RF_FCAL_MOM_TOGGLE_CNT_LEN) - 1) << RF_FCAL_MOM_TOGGLE_CNT_POS)
#define RF_FCAL_MOM_TOGGLE_CNT_UMSK       (~(((1U << RF_FCAL_MOM_TOGGLE_CNT_LEN) - 1) << RF_FCAL_MOM_TOGGLE_CNT_POS))
#define RF_FCAL_CLK_PERIOD                RF_FCAL_CLK_PERIOD
#define RF_FCAL_CLK_PERIOD_POS            (4U)
#define RF_FCAL_CLK_PERIOD_LEN            (2U)
#define RF_FCAL_CLK_PERIOD_MSK            (((1U << RF_FCAL_CLK_PERIOD_LEN) - 1) << RF_FCAL_CLK_PERIOD_POS)
#define RF_FCAL_CLK_PERIOD_UMSK           (~(((1U << RF_FCAL_CLK_PERIOD_LEN) - 1) << RF_FCAL_CLK_PERIOD_POS))
#define RF_FCAL_MODE                      RF_FCAL_MODE
#define RF_FCAL_MODE_POS                  (6U)
#define RF_FCAL_MODE_LEN                  (2U)
#define RF_FCAL_MODE_MSK                  (((1U << RF_FCAL_MODE_LEN) - 1) << RF_FCAL_MODE_POS)
#define RF_FCAL_MODE_UMSK                 (~(((1U << RF_FCAL_MODE_LEN) - 1) << RF_FCAL_MODE_POS))
#define RF_FCAL_MOM_INI_EXT               RF_FCAL_MOM_INI_EXT
#define RF_FCAL_MOM_INI_EXT_POS           (16U)
#define RF_FCAL_MOM_INI_EXT_LEN           (8U)
#define RF_FCAL_MOM_INI_EXT_MSK           (((1U << RF_FCAL_MOM_INI_EXT_LEN) - 1) << RF_FCAL_MOM_INI_EXT_POS)
#define RF_FCAL_MOM_INI_EXT_UMSK          (~(((1U << RF_FCAL_MOM_INI_EXT_LEN) - 1) << RF_FCAL_MOM_INI_EXT_POS))

/* 0x28C : adpll_polarity */
#define RF_ADPLL_POLARITY_OFFSET      (0x28C)
#define RF_ADPLL_LP_MOM_POLARITY      RF_ADPLL_LP_MOM_POLARITY
#define RF_ADPLL_LP_MOM_POLARITY_POS  (8U)
#define RF_ADPLL_LP_MOM_POLARITY_LEN  (1U)
#define RF_ADPLL_LP_MOM_POLARITY_MSK  (((1U << RF_ADPLL_LP_MOM_POLARITY_LEN) - 1) << RF_ADPLL_LP_MOM_POLARITY_POS)
#define RF_ADPLL_LP_MOM_POLARITY_UMSK (~(((1U << RF_ADPLL_LP_MOM_POLARITY_LEN) - 1) << RF_ADPLL_LP_MOM_POLARITY_POS))
#define RF_ADPLL_LMS_POLARITY         RF_ADPLL_LMS_POLARITY
#define RF_ADPLL_LMS_POLARITY_POS     (12U)
#define RF_ADPLL_LMS_POLARITY_LEN     (1U)
#define RF_ADPLL_LMS_POLARITY_MSK     (((1U << RF_ADPLL_LMS_POLARITY_LEN) - 1) << RF_ADPLL_LMS_POLARITY_POS)
#define RF_ADPLL_LMS_POLARITY_UMSK    (~(((1U << RF_ADPLL_LMS_POLARITY_LEN) - 1) << RF_ADPLL_LMS_POLARITY_POS))
#define RF_ADPLL_FCAL_POLARITY        RF_ADPLL_FCAL_POLARITY
#define RF_ADPLL_FCAL_POLARITY_POS    (16U)
#define RF_ADPLL_FCAL_POLARITY_LEN    (1U)
#define RF_ADPLL_FCAL_POLARITY_MSK    (((1U << RF_ADPLL_FCAL_POLARITY_LEN) - 1) << RF_ADPLL_FCAL_POLARITY_POS)
#define RF_ADPLL_FCAL_POLARITY_UMSK   (~(((1U << RF_ADPLL_FCAL_POLARITY_LEN) - 1) << RF_ADPLL_FCAL_POLARITY_POS))
#define RF_ADPLL_LP_POLARITY          RF_ADPLL_LP_POLARITY
#define RF_ADPLL_LP_POLARITY_POS      (20U)
#define RF_ADPLL_LP_POLARITY_LEN      (1U)
#define RF_ADPLL_LP_POLARITY_MSK      (((1U << RF_ADPLL_LP_POLARITY_LEN) - 1) << RF_ADPLL_LP_POLARITY_POS)
#define RF_ADPLL_LP_POLARITY_UMSK     (~(((1U << RF_ADPLL_LP_POLARITY_LEN) - 1) << RF_ADPLL_LP_POLARITY_POS))

/* 0x290 : adpll_output */
#define RF_ADPLL_OUTPUT_OFFSET            (0x290)
#define RF_ADPLL_UNLOCK_INTRPT            RF_ADPLL_UNLOCK_INTRPT
#define RF_ADPLL_UNLOCK_INTRPT_POS        (0U)
#define RF_ADPLL_UNLOCK_INTRPT_LEN        (1U)
#define RF_ADPLL_UNLOCK_INTRPT_MSK        (((1U << RF_ADPLL_UNLOCK_INTRPT_LEN) - 1) << RF_ADPLL_UNLOCK_INTRPT_POS)
#define RF_ADPLL_UNLOCK_INTRPT_UMSK       (~(((1U << RF_ADPLL_UNLOCK_INTRPT_LEN) - 1) << RF_ADPLL_UNLOCK_INTRPT_POS))
#define RF_ADPLL_LO_LOCK                  RF_ADPLL_LO_LOCK
#define RF_ADPLL_LO_LOCK_POS              (1U)
#define RF_ADPLL_LO_LOCK_LEN              (1U)
#define RF_ADPLL_LO_LOCK_MSK              (((1U << RF_ADPLL_LO_LOCK_LEN) - 1) << RF_ADPLL_LO_LOCK_POS)
#define RF_ADPLL_LO_LOCK_UMSK             (~(((1U << RF_ADPLL_LO_LOCK_LEN) - 1) << RF_ADPLL_LO_LOCK_POS))
#define RF_ADPLL_FSM_STATE                RF_ADPLL_FSM_STATE
#define RF_ADPLL_FSM_STATE_POS            (3U)
#define RF_ADPLL_FSM_STATE_LEN            (4U)
#define RF_ADPLL_FSM_STATE_MSK            (((1U << RF_ADPLL_FSM_STATE_LEN) - 1) << RF_ADPLL_FSM_STATE_POS)
#define RF_ADPLL_FSM_STATE_UMSK           (~(((1U << RF_ADPLL_FSM_STATE_LEN) - 1) << RF_ADPLL_FSM_STATE_POS))
#define RF_ADPLL_SPD_UNLOCK_SIGN          RF_ADPLL_SPD_UNLOCK_SIGN
#define RF_ADPLL_SPD_UNLOCK_SIGN_POS      (7U)
#define RF_ADPLL_SPD_UNLOCK_SIGN_LEN      (1U)
#define RF_ADPLL_SPD_UNLOCK_SIGN_MSK      (((1U << RF_ADPLL_SPD_UNLOCK_SIGN_LEN) - 1) << RF_ADPLL_SPD_UNLOCK_SIGN_POS)
#define RF_ADPLL_SPD_UNLOCK_SIGN_UMSK     (~(((1U << RF_ADPLL_SPD_UNLOCK_SIGN_LEN) - 1) << RF_ADPLL_SPD_UNLOCK_SIGN_POS))
#define RF_ADPLL_VCTRL_OUT_RANGE_FSM      RF_ADPLL_VCTRL_OUT_RANGE_FSM
#define RF_ADPLL_VCTRL_OUT_RANGE_FSM_POS  (8U)
#define RF_ADPLL_VCTRL_OUT_RANGE_FSM_LEN  (1U)
#define RF_ADPLL_VCTRL_OUT_RANGE_FSM_MSK  (((1U << RF_ADPLL_VCTRL_OUT_RANGE_FSM_LEN) - 1) << RF_ADPLL_VCTRL_OUT_RANGE_FSM_POS)
#define RF_ADPLL_VCTRL_OUT_RANGE_FSM_UMSK (~(((1U << RF_ADPLL_VCTRL_OUT_RANGE_FSM_LEN) - 1) << RF_ADPLL_VCTRL_OUT_RANGE_FSM_POS))
#define RF_ADPLL_MOM_UPDATE_FAIL_FSM      RF_ADPLL_MOM_UPDATE_FAIL_FSM
#define RF_ADPLL_MOM_UPDATE_FAIL_FSM_POS  (9U)
#define RF_ADPLL_MOM_UPDATE_FAIL_FSM_LEN  (1U)
#define RF_ADPLL_MOM_UPDATE_FAIL_FSM_MSK  (((1U << RF_ADPLL_MOM_UPDATE_FAIL_FSM_LEN) - 1) << RF_ADPLL_MOM_UPDATE_FAIL_FSM_POS)
#define RF_ADPLL_MOM_UPDATE_FAIL_FSM_UMSK (~(((1U << RF_ADPLL_MOM_UPDATE_FAIL_FSM_LEN) - 1) << RF_ADPLL_MOM_UPDATE_FAIL_FSM_POS))
#define RF_ADPLL_MOM_UPDATE_OU_FSM        RF_ADPLL_MOM_UPDATE_OU_FSM
#define RF_ADPLL_MOM_UPDATE_OU_FSM_POS    (10U)
#define RF_ADPLL_MOM_UPDATE_OU_FSM_LEN    (1U)
#define RF_ADPLL_MOM_UPDATE_OU_FSM_MSK    (((1U << RF_ADPLL_MOM_UPDATE_OU_FSM_LEN) - 1) << RF_ADPLL_MOM_UPDATE_OU_FSM_POS)
#define RF_ADPLL_MOM_UPDATE_OU_FSM_UMSK   (~(((1U << RF_ADPLL_MOM_UPDATE_OU_FSM_LEN) - 1) << RF_ADPLL_MOM_UPDATE_OU_FSM_POS))
#define RF_ADPLL_SPD_UNLOCK_FSM           RF_ADPLL_SPD_UNLOCK_FSM
#define RF_ADPLL_SPD_UNLOCK_FSM_POS       (11U)
#define RF_ADPLL_SPD_UNLOCK_FSM_LEN       (1U)
#define RF_ADPLL_SPD_UNLOCK_FSM_MSK       (((1U << RF_ADPLL_SPD_UNLOCK_FSM_LEN) - 1) << RF_ADPLL_SPD_UNLOCK_FSM_POS)
#define RF_ADPLL_SPD_UNLOCK_FSM_UMSK      (~(((1U << RF_ADPLL_SPD_UNLOCK_FSM_LEN) - 1) << RF_ADPLL_SPD_UNLOCK_FSM_POS))
#define RF_ADPLL_SPD_LOCK_FSM             RF_ADPLL_SPD_LOCK_FSM
#define RF_ADPLL_SPD_LOCK_FSM_POS         (12U)
#define RF_ADPLL_SPD_LOCK_FSM_LEN         (1U)
#define RF_ADPLL_SPD_LOCK_FSM_MSK         (((1U << RF_ADPLL_SPD_LOCK_FSM_LEN) - 1) << RF_ADPLL_SPD_LOCK_FSM_POS)
#define RF_ADPLL_SPD_LOCK_FSM_UMSK        (~(((1U << RF_ADPLL_SPD_LOCK_FSM_LEN) - 1) << RF_ADPLL_SPD_LOCK_FSM_POS))
#define RF_ADPLL_FCAL_DONE_FSM            RF_ADPLL_FCAL_DONE_FSM
#define RF_ADPLL_FCAL_DONE_FSM_POS        (13U)
#define RF_ADPLL_FCAL_DONE_FSM_LEN        (1U)
#define RF_ADPLL_FCAL_DONE_FSM_MSK        (((1U << RF_ADPLL_FCAL_DONE_FSM_LEN) - 1) << RF_ADPLL_FCAL_DONE_FSM_POS)
#define RF_ADPLL_FCAL_DONE_FSM_UMSK       (~(((1U << RF_ADPLL_FCAL_DONE_FSM_LEN) - 1) << RF_ADPLL_FCAL_DONE_FSM_POS))
#define RF_ADPLL_CAPCODE_OUT_RANGE        RF_ADPLL_CAPCODE_OUT_RANGE
#define RF_ADPLL_CAPCODE_OUT_RANGE_POS    (14U)
#define RF_ADPLL_CAPCODE_OUT_RANGE_LEN    (1U)
#define RF_ADPLL_CAPCODE_OUT_RANGE_MSK    (((1U << RF_ADPLL_CAPCODE_OUT_RANGE_LEN) - 1) << RF_ADPLL_CAPCODE_OUT_RANGE_POS)
#define RF_ADPLL_CAPCODE_OUT_RANGE_UMSK   (~(((1U << RF_ADPLL_CAPCODE_OUT_RANGE_LEN) - 1) << RF_ADPLL_CAPCODE_OUT_RANGE_POS))
#define RF_ADPLL_MOM_UPDATE_TOTAL_OU      RF_ADPLL_MOM_UPDATE_TOTAL_OU
#define RF_ADPLL_MOM_UPDATE_TOTAL_OU_POS  (15U)
#define RF_ADPLL_MOM_UPDATE_TOTAL_OU_LEN  (2U)
#define RF_ADPLL_MOM_UPDATE_TOTAL_OU_MSK  (((1U << RF_ADPLL_MOM_UPDATE_TOTAL_OU_LEN) - 1) << RF_ADPLL_MOM_UPDATE_TOTAL_OU_POS)
#define RF_ADPLL_MOM_UPDATE_TOTAL_OU_UMSK (~(((1U << RF_ADPLL_MOM_UPDATE_TOTAL_OU_LEN) - 1) << RF_ADPLL_MOM_UPDATE_TOTAL_OU_POS))
#define RF_ADPLL_CAPCODE_UD               RF_ADPLL_CAPCODE_UD
#define RF_ADPLL_CAPCODE_UD_POS           (17U)
#define RF_ADPLL_CAPCODE_UD_LEN           (1U)
#define RF_ADPLL_CAPCODE_UD_MSK           (((1U << RF_ADPLL_CAPCODE_UD_LEN) - 1) << RF_ADPLL_CAPCODE_UD_POS)
#define RF_ADPLL_CAPCODE_UD_UMSK          (~(((1U << RF_ADPLL_CAPCODE_UD_LEN) - 1) << RF_ADPLL_CAPCODE_UD_POS))
#define RF_ADPLL_VCTRL_DET_DONE           RF_ADPLL_VCTRL_DET_DONE
#define RF_ADPLL_VCTRL_DET_DONE_POS       (18U)
#define RF_ADPLL_VCTRL_DET_DONE_LEN       (1U)
#define RF_ADPLL_VCTRL_DET_DONE_MSK       (((1U << RF_ADPLL_VCTRL_DET_DONE_LEN) - 1) << RF_ADPLL_VCTRL_DET_DONE_POS)
#define RF_ADPLL_VCTRL_DET_DONE_UMSK      (~(((1U << RF_ADPLL_VCTRL_DET_DONE_LEN) - 1) << RF_ADPLL_VCTRL_DET_DONE_POS))
#define RF_ADPLL_FREQERR_SIGN             RF_ADPLL_FREQERR_SIGN
#define RF_ADPLL_FREQERR_SIGN_POS         (19U)
#define RF_ADPLL_FREQERR_SIGN_LEN         (1U)
#define RF_ADPLL_FREQERR_SIGN_MSK         (((1U << RF_ADPLL_FREQERR_SIGN_LEN) - 1) << RF_ADPLL_FREQERR_SIGN_POS)
#define RF_ADPLL_FREQERR_SIGN_UMSK        (~(((1U << RF_ADPLL_FREQERR_SIGN_LEN) - 1) << RF_ADPLL_FREQERR_SIGN_POS))
#define RF_ADPLL_FREQERR_OU               RF_ADPLL_FREQERR_OU
#define RF_ADPLL_FREQERR_OU_POS           (20U)
#define RF_ADPLL_FREQERR_OU_LEN           (1U)
#define RF_ADPLL_FREQERR_OU_MSK           (((1U << RF_ADPLL_FREQERR_OU_LEN) - 1) << RF_ADPLL_FREQERR_OU_POS)
#define RF_ADPLL_FREQERR_OU_UMSK          (~(((1U << RF_ADPLL_FREQERR_OU_LEN) - 1) << RF_ADPLL_FREQERR_OU_POS))
#define RF_ADPLL_FREQERR_DET_DONE         RF_ADPLL_FREQERR_DET_DONE
#define RF_ADPLL_FREQERR_DET_DONE_POS     (21U)
#define RF_ADPLL_FREQERR_DET_DONE_LEN     (1U)
#define RF_ADPLL_FREQERR_DET_DONE_MSK     (((1U << RF_ADPLL_FREQERR_DET_DONE_LEN) - 1) << RF_ADPLL_FREQERR_DET_DONE_POS)
#define RF_ADPLL_FREQERR_DET_DONE_UMSK    (~(((1U << RF_ADPLL_FREQERR_DET_DONE_LEN) - 1) << RF_ADPLL_FREQERR_DET_DONE_POS))

