bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x294 : adpll_reserved */
#define RF_ADPLL_RESERVED_OFFSET (0x294)
#define RF_ADPLL_RESV1           RF_ADPLL_RESV1
#define RF_ADPLL_RESV1_POS       (0U)
#define RF_ADPLL_RESV1_LEN       (16U)
#define RF_ADPLL_RESV1_MSK       (((1U << RF_ADPLL_RESV1_LEN) - 1) << RF_ADPLL_RESV1_POS)
#define RF_ADPLL_RESV1_UMSK      (~(((1U << RF_ADPLL_RESV1_LEN) - 1) << RF_ADPLL_RESV1_POS))
#define RF_ADPLL_RESV0           RF_ADPLL_RESV0
#define RF_ADPLL_RESV0_POS       (16U)
#define RF_ADPLL_RESV0_LEN       (16U)
#define RF_ADPLL_RESV0_MSK       (((1U << RF_ADPLL_RESV0_LEN) - 1) << RF_ADPLL_RESV0_POS)
#define RF_ADPLL_RESV0_UMSK      (~(((1U << RF_ADPLL_RESV0_LEN) - 1) << RF_ADPLL_RESV0_POS))

/* 0x298 : rf_reserved */
#define RF_RESERVED_OFFSET (0x298)
#define RF_RESV1           RF_RESV1
#define RF_RESV1_POS       (0U)
#define RF_RESV1_LEN       (16U)
#define RF_RESV1_MSK       (((1U << RF_RESV1_LEN) - 1) << RF_RESV1_POS)
#define RF_RESV1_UMSK      (~(((1U << RF_RESV1_LEN) - 1) << RF_RESV1_POS))
#define RF_RESV0           RF_RESV0
#define RF_RESV0_POS       (16U)
#define RF_RESV0_LEN       (16U)
#define RF_RESV0_MSK       (((1U << RF_RESV0_LEN) - 1) << RF_RESV0_POS)
#define RF_RESV0_UMSK      (~(((1U << RF_RESV0_LEN) - 1) << RF_RESV0_POS))

/* 0x29C : rf_reserved_2 */
#define RF_RESERVED_2_OFFSET (0x29C)
#define RF_RESV              RF_RESV
#define RF_RESV_POS          (0U)
#define RF_RESV_LEN          (32U)
#define RF_RESV_MSK          (((1U << RF_RESV_LEN) - 1) << RF_RESV_POS)
#define RF_RESV_UMSK         (~(((1U << RF_RESV_LEN) - 1) << RF_RESV_POS))

/* 0x300 : rbb_gain_ctrl0 */
#define RF_RBB_GAIN_CTRL0_OFFSET        (0x300)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW0      RF_GAIN_CTRL0_ROSDAC_Q_BW0
#define RF_GAIN_CTRL0_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL0_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL0_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL0_ROSDAC_I_BW0      RF_GAIN_CTRL0_ROSDAC_I_BW0
#define RF_GAIN_CTRL0_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL0_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL0_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL0_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL0_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL0_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL0_ROSDAC_Q_BW1      RF_GAIN_CTRL0_ROSDAC_Q_BW1
#define RF_GAIN_CTRL0_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL0_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL0_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL0_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL0_ROSDAC_I_BW1      RF_GAIN_CTRL0_ROSDAC_I_BW1
#define RF_GAIN_CTRL0_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL0_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL0_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL0_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL0_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL0_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL0_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL0_G_RBB2            RF_GAIN_CTRL0_G_RBB2
#define RF_GAIN_CTRL0_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL0_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL0_G_RBB2_MSK        (((1U << RF_GAIN_CTRL0_G_RBB2_LEN) - 1) << RF_GAIN_CTRL0_G_RBB2_POS)
#define RF_GAIN_CTRL0_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL0_G_RBB2_LEN) - 1) << RF_GAIN_CTRL0_G_RBB2_POS))
#define RF_GAIN_CTRL0_G_RBB1            RF_GAIN_CTRL0_G_RBB1
#define RF_GAIN_CTRL0_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL0_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL0_G_RBB1_MSK        (((1U << RF_GAIN_CTRL0_G_RBB1_LEN) - 1) << RF_GAIN_CTRL0_G_RBB1_POS)
#define RF_GAIN_CTRL0_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL0_G_RBB1_LEN) - 1) << RF_GAIN_CTRL0_G_RBB1_POS))

/* 0x304 : rbb_gain_ctrl1 */
#define RF_RBB_GAIN_CTRL1_OFFSET        (0x304)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW0      RF_GAIN_CTRL1_ROSDAC_Q_BW0
#define RF_GAIN_CTRL1_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL1_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL1_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL1_ROSDAC_I_BW0      RF_GAIN_CTRL1_ROSDAC_I_BW0
#define RF_GAIN_CTRL1_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL1_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL1_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL1_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL1_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL1_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL1_ROSDAC_Q_BW1      RF_GAIN_CTRL1_ROSDAC_Q_BW1
#define RF_GAIN_CTRL1_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL1_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL1_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL1_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL1_ROSDAC_I_BW1      RF_GAIN_CTRL1_ROSDAC_I_BW1
#define RF_GAIN_CTRL1_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL1_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL1_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL1_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL1_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL1_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL1_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL1_G_RBB2            RF_GAIN_CTRL1_G_RBB2
#define RF_GAIN_CTRL1_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL1_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL1_G_RBB2_MSK        (((1U << RF_GAIN_CTRL1_G_RBB2_LEN) - 1) << RF_GAIN_CTRL1_G_RBB2_POS)
#define RF_GAIN_CTRL1_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL1_G_RBB2_LEN) - 1) << RF_GAIN_CTRL1_G_RBB2_POS))
#define RF_GAIN_CTRL1_G_RBB1            RF_GAIN_CTRL1_G_RBB1
#define RF_GAIN_CTRL1_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL1_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL1_G_RBB1_MSK        (((1U << RF_GAIN_CTRL1_G_RBB1_LEN) - 1) << RF_GAIN_CTRL1_G_RBB1_POS)
#define RF_GAIN_CTRL1_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL1_G_RBB1_LEN) - 1) << RF_GAIN_CTRL1_G_RBB1_POS))

/* 0x308 : rbb_gain_ctrl2 */
#define RF_RBB_GAIN_CTRL2_OFFSET        (0x308)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW0      RF_GAIN_CTRL2_ROSDAC_Q_BW0
#define RF_GAIN_CTRL2_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL2_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL2_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL2_ROSDAC_I_BW0      RF_GAIN_CTRL2_ROSDAC_I_BW0
#define RF_GAIN_CTRL2_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL2_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL2_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL2_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL2_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL2_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL2_ROSDAC_Q_BW1      RF_GAIN_CTRL2_ROSDAC_Q_BW1
#define RF_GAIN_CTRL2_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL2_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL2_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL2_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL2_ROSDAC_I_BW1      RF_GAIN_CTRL2_ROSDAC_I_BW1
#define RF_GAIN_CTRL2_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL2_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL2_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL2_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL2_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL2_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL2_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL2_G_RBB2            RF_GAIN_CTRL2_G_RBB2
#define RF_GAIN_CTRL2_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL2_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL2_G_RBB2_MSK        (((1U << RF_GAIN_CTRL2_G_RBB2_LEN) - 1) << RF_GAIN_CTRL2_G_RBB2_POS)
#define RF_GAIN_CTRL2_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL2_G_RBB2_LEN) - 1) << RF_GAIN_CTRL2_G_RBB2_POS))
#define RF_GAIN_CTRL2_G_RBB1            RF_GAIN_CTRL2_G_RBB1
#define RF_GAIN_CTRL2_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL2_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL2_G_RBB1_MSK        (((1U << RF_GAIN_CTRL2_G_RBB1_LEN) - 1) << RF_GAIN_CTRL2_G_RBB1_POS)
#define RF_GAIN_CTRL2_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL2_G_RBB1_LEN) - 1) << RF_GAIN_CTRL2_G_RBB1_POS))

/* 0x30C : rbb_gain_ctrl3 */
#define RF_RBB_GAIN_CTRL3_OFFSET        (0x30C)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW0      RF_GAIN_CTRL3_ROSDAC_Q_BW0
#define RF_GAIN_CTRL3_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL3_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL3_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL3_ROSDAC_I_BW0      RF_GAIN_CTRL3_ROSDAC_I_BW0
#define RF_GAIN_CTRL3_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL3_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL3_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL3_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL3_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL3_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL3_ROSDAC_Q_BW1      RF_GAIN_CTRL3_ROSDAC_Q_BW1
#define RF_GAIN_CTRL3_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL3_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL3_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL3_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL3_ROSDAC_I_BW1      RF_GAIN_CTRL3_ROSDAC_I_BW1
#define RF_GAIN_CTRL3_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL3_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL3_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL3_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL3_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL3_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL3_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL3_G_RBB2            RF_GAIN_CTRL3_G_RBB2
#define RF_GAIN_CTRL3_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL3_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL3_G_RBB2_MSK        (((1U << RF_GAIN_CTRL3_G_RBB2_LEN) - 1) << RF_GAIN_CTRL3_G_RBB2_POS)
#define RF_GAIN_CTRL3_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL3_G_RBB2_LEN) - 1) << RF_GAIN_CTRL3_G_RBB2_POS))
#define RF_GAIN_CTRL3_G_RBB1            RF_GAIN_CTRL3_G_RBB1
#define RF_GAIN_CTRL3_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL3_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL3_G_RBB1_MSK        (((1U << RF_GAIN_CTRL3_G_RBB1_LEN) - 1) << RF_GAIN_CTRL3_G_RBB1_POS)
#define RF_GAIN_CTRL3_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL3_G_RBB1_LEN) - 1) << RF_GAIN_CTRL3_G_RBB1_POS))

/* 0x310 : rbb_gain_ctrl4 */
#define RF_RBB_GAIN_CTRL4_OFFSET        (0x310)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW0      RF_GAIN_CTRL4_ROSDAC_Q_BW0
#define RF_GAIN_CTRL4_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL4_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL4_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL4_ROSDAC_I_BW0      RF_GAIN_CTRL4_ROSDAC_I_BW0
#define RF_GAIN_CTRL4_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL4_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL4_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL4_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL4_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL4_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL4_ROSDAC_Q_BW1      RF_GAIN_CTRL4_ROSDAC_Q_BW1
#define RF_GAIN_CTRL4_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL4_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL4_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL4_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL4_ROSDAC_I_BW1      RF_GAIN_CTRL4_ROSDAC_I_BW1
#define RF_GAIN_CTRL4_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL4_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL4_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL4_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL4_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL4_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL4_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL4_G_RBB2            RF_GAIN_CTRL4_G_RBB2
#define RF_GAIN_CTRL4_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL4_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL4_G_RBB2_MSK        (((1U << RF_GAIN_CTRL4_G_RBB2_LEN) - 1) << RF_GAIN_CTRL4_G_RBB2_POS)
#define RF_GAIN_CTRL4_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL4_G_RBB2_LEN) - 1) << RF_GAIN_CTRL4_G_RBB2_POS))
#define RF_GAIN_CTRL4_G_RBB1            RF_GAIN_CTRL4_G_RBB1
#define RF_GAIN_CTRL4_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL4_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL4_G_RBB1_MSK        (((1U << RF_GAIN_CTRL4_G_RBB1_LEN) - 1) << RF_GAIN_CTRL4_G_RBB1_POS)
#define RF_GAIN_CTRL4_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL4_G_RBB1_LEN) - 1) << RF_GAIN_CTRL4_G_RBB1_POS))

/* 0x314 : rbb_gain_ctrl5 */
#define RF_RBB_GAIN_CTRL5_OFFSET        (0x314)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW0      RF_GAIN_CTRL5_ROSDAC_Q_BW0
#define RF_GAIN_CTRL5_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL5_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL5_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL5_ROSDAC_I_BW0      RF_GAIN_CTRL5_ROSDAC_I_BW0
#define RF_GAIN_CTRL5_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL5_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL5_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL5_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL5_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL5_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL5_ROSDAC_Q_BW1      RF_GAIN_CTRL5_ROSDAC_Q_BW1
#define RF_GAIN_CTRL5_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL5_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL5_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL5_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL5_ROSDAC_I_BW1      RF_GAIN_CTRL5_ROSDAC_I_BW1
#define RF_GAIN_CTRL5_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL5_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL5_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL5_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL5_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL5_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL5_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL5_G_RBB2            RF_GAIN_CTRL5_G_RBB2
#define RF_GAIN_CTRL5_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL5_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL5_G_RBB2_MSK        (((1U << RF_GAIN_CTRL5_G_RBB2_LEN) - 1) << RF_GAIN_CTRL5_G_RBB2_POS)
#define RF_GAIN_CTRL5_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL5_G_RBB2_LEN) - 1) << RF_GAIN_CTRL5_G_RBB2_POS))
#define RF_GAIN_CTRL5_G_RBB1            RF_GAIN_CTRL5_G_RBB1
#define RF_GAIN_CTRL5_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL5_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL5_G_RBB1_MSK        (((1U << RF_GAIN_CTRL5_G_RBB1_LEN) - 1) << RF_GAIN_CTRL5_G_RBB1_POS)
#define RF_GAIN_CTRL5_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL5_G_RBB1_LEN) - 1) << RF_GAIN_CTRL5_G_RBB1_POS))

