bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x318 : rbb_gain_ctrl6 */
#define RF_RBB_GAIN_CTRL6_OFFSET        (0x318)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW0      RF_GAIN_CTRL6_ROSDAC_Q_BW0
#define RF_GAIN_CTRL6_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL6_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL6_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL6_ROSDAC_I_BW0      RF_GAIN_CTRL6_ROSDAC_I_BW0
#define RF_GAIN_CTRL6_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL6_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL6_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL6_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL6_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL6_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL6_ROSDAC_Q_BW1      RF_GAIN_CTRL6_ROSDAC_Q_BW1
#define RF_GAIN_CTRL6_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL6_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL6_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL6_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL6_ROSDAC_I_BW1      RF_GAIN_CTRL6_ROSDAC_I_BW1
#define RF_GAIN_CTRL6_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL6_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL6_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL6_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL6_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL6_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL6_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL6_G_RBB2            RF_GAIN_CTRL6_G_RBB2
#define RF_GAIN_CTRL6_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL6_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL6_G_RBB2_MSK        (((1U << RF_GAIN_CTRL6_G_RBB2_LEN) - 1) << RF_GAIN_CTRL6_G_RBB2_POS)
#define RF_GAIN_CTRL6_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL6_G_RBB2_LEN) - 1) << RF_GAIN_CTRL6_G_RBB2_POS))
#define RF_GAIN_CTRL6_G_RBB1            RF_GAIN_CTRL6_G_RBB1
#define RF_GAIN_CTRL6_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL6_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL6_G_RBB1_MSK        (((1U << RF_GAIN_CTRL6_G_RBB1_LEN) - 1) << RF_GAIN_CTRL6_G_RBB1_POS)
#define RF_GAIN_CTRL6_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL6_G_RBB1_LEN) - 1) << RF_GAIN_CTRL6_G_RBB1_POS))

/* 0x31C : rbb_gain_ctrl7 */
#define RF_RBB_GAIN_CTRL7_OFFSET        (0x31C)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW0      RF_GAIN_CTRL7_ROSDAC_Q_BW0
#define RF_GAIN_CTRL7_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL7_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL7_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL7_ROSDAC_I_BW0      RF_GAIN_CTRL7_ROSDAC_I_BW0
#define RF_GAIN_CTRL7_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL7_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL7_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL7_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL7_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL7_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL7_ROSDAC_Q_BW1      RF_GAIN_CTRL7_ROSDAC_Q_BW1
#define RF_GAIN_CTRL7_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL7_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL7_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL7_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL7_ROSDAC_I_BW1      RF_GAIN_CTRL7_ROSDAC_I_BW1
#define RF_GAIN_CTRL7_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL7_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL7_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL7_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL7_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL7_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL7_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL7_G_RBB2            RF_GAIN_CTRL7_G_RBB2
#define RF_GAIN_CTRL7_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL7_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL7_G_RBB2_MSK        (((1U << RF_GAIN_CTRL7_G_RBB2_LEN) - 1) << RF_GAIN_CTRL7_G_RBB2_POS)
#define RF_GAIN_CTRL7_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL7_G_RBB2_LEN) - 1) << RF_GAIN_CTRL7_G_RBB2_POS))
#define RF_GAIN_CTRL7_G_RBB1            RF_GAIN_CTRL7_G_RBB1
#define RF_GAIN_CTRL7_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL7_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL7_G_RBB1_MSK        (((1U << RF_GAIN_CTRL7_G_RBB1_LEN) - 1) << RF_GAIN_CTRL7_G_RBB1_POS)
#define RF_GAIN_CTRL7_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL7_G_RBB1_LEN) - 1) << RF_GAIN_CTRL7_G_RBB1_POS))

/* 0x320 : rbb_gain_ctrl8 */
#define RF_RBB_GAIN_CTRL8_OFFSET        (0x320)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW0      RF_GAIN_CTRL8_ROSDAC_Q_BW0
#define RF_GAIN_CTRL8_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL8_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL8_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL8_ROSDAC_I_BW0      RF_GAIN_CTRL8_ROSDAC_I_BW0
#define RF_GAIN_CTRL8_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL8_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL8_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL8_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL8_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL8_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL8_ROSDAC_Q_BW1      RF_GAIN_CTRL8_ROSDAC_Q_BW1
#define RF_GAIN_CTRL8_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL8_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL8_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL8_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL8_ROSDAC_I_BW1      RF_GAIN_CTRL8_ROSDAC_I_BW1
#define RF_GAIN_CTRL8_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL8_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL8_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL8_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL8_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL8_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL8_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL8_G_RBB2            RF_GAIN_CTRL8_G_RBB2
#define RF_GAIN_CTRL8_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL8_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL8_G_RBB2_MSK        (((1U << RF_GAIN_CTRL8_G_RBB2_LEN) - 1) << RF_GAIN_CTRL8_G_RBB2_POS)
#define RF_GAIN_CTRL8_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL8_G_RBB2_LEN) - 1) << RF_GAIN_CTRL8_G_RBB2_POS))
#define RF_GAIN_CTRL8_G_RBB1            RF_GAIN_CTRL8_G_RBB1
#define RF_GAIN_CTRL8_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL8_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL8_G_RBB1_MSK        (((1U << RF_GAIN_CTRL8_G_RBB1_LEN) - 1) << RF_GAIN_CTRL8_G_RBB1_POS)
#define RF_GAIN_CTRL8_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL8_G_RBB1_LEN) - 1) << RF_GAIN_CTRL8_G_RBB1_POS))

/* 0x324 : rbb_gain_ctrl9 */
#define RF_RBB_GAIN_CTRL9_OFFSET        (0x324)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW0      RF_GAIN_CTRL9_ROSDAC_Q_BW0
#define RF_GAIN_CTRL9_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL9_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL9_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL9_ROSDAC_I_BW0      RF_GAIN_CTRL9_ROSDAC_I_BW0
#define RF_GAIN_CTRL9_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL9_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL9_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL9_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL9_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL9_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL9_ROSDAC_Q_BW1      RF_GAIN_CTRL9_ROSDAC_Q_BW1
#define RF_GAIN_CTRL9_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL9_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL9_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL9_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL9_ROSDAC_I_BW1      RF_GAIN_CTRL9_ROSDAC_I_BW1
#define RF_GAIN_CTRL9_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL9_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL9_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL9_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL9_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL9_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL9_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL9_G_RBB2            RF_GAIN_CTRL9_G_RBB2
#define RF_GAIN_CTRL9_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL9_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL9_G_RBB2_MSK        (((1U << RF_GAIN_CTRL9_G_RBB2_LEN) - 1) << RF_GAIN_CTRL9_G_RBB2_POS)
#define RF_GAIN_CTRL9_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL9_G_RBB2_LEN) - 1) << RF_GAIN_CTRL9_G_RBB2_POS))
#define RF_GAIN_CTRL9_G_RBB1            RF_GAIN_CTRL9_G_RBB1
#define RF_GAIN_CTRL9_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL9_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL9_G_RBB1_MSK        (((1U << RF_GAIN_CTRL9_G_RBB1_LEN) - 1) << RF_GAIN_CTRL9_G_RBB1_POS)
#define RF_GAIN_CTRL9_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL9_G_RBB1_LEN) - 1) << RF_GAIN_CTRL9_G_RBB1_POS))

