bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x328 : rbb_gain_ctrl10 */
#define RF_RBB_GAIN_CTRL10_OFFSET        (0x328)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW0      RF_GAIN_CTRL10_ROSDAC_Q_BW0
#define RF_GAIN_CTRL10_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL10_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL10_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL10_ROSDAC_I_BW0      RF_GAIN_CTRL10_ROSDAC_I_BW0
#define RF_GAIN_CTRL10_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL10_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL10_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL10_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL10_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL10_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL10_ROSDAC_Q_BW1      RF_GAIN_CTRL10_ROSDAC_Q_BW1
#define RF_GAIN_CTRL10_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL10_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL10_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL10_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL10_ROSDAC_I_BW1      RF_GAIN_CTRL10_ROSDAC_I_BW1
#define RF_GAIN_CTRL10_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL10_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL10_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL10_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL10_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL10_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL10_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL10_G_RBB2            RF_GAIN_CTRL10_G_RBB2
#define RF_GAIN_CTRL10_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL10_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL10_G_RBB2_MSK        (((1U << RF_GAIN_CTRL10_G_RBB2_LEN) - 1) << RF_GAIN_CTRL10_G_RBB2_POS)
#define RF_GAIN_CTRL10_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL10_G_RBB2_LEN) - 1) << RF_GAIN_CTRL10_G_RBB2_POS))
#define RF_GAIN_CTRL10_G_RBB1            RF_GAIN_CTRL10_G_RBB1
#define RF_GAIN_CTRL10_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL10_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL10_G_RBB1_MSK        (((1U << RF_GAIN_CTRL10_G_RBB1_LEN) - 1) << RF_GAIN_CTRL10_G_RBB1_POS)
#define RF_GAIN_CTRL10_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL10_G_RBB1_LEN) - 1) << RF_GAIN_CTRL10_G_RBB1_POS))

/* 0x32C : rbb_gain_ctrl11 */
#define RF_RBB_GAIN_CTRL11_OFFSET        (0x32C)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW0      RF_GAIN_CTRL11_ROSDAC_Q_BW0
#define RF_GAIN_CTRL11_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL11_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL11_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL11_ROSDAC_I_BW0      RF_GAIN_CTRL11_ROSDAC_I_BW0
#define RF_GAIN_CTRL11_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL11_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL11_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL11_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL11_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL11_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL11_ROSDAC_Q_BW1      RF_GAIN_CTRL11_ROSDAC_Q_BW1
#define RF_GAIN_CTRL11_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL11_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL11_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL11_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL11_ROSDAC_I_BW1      RF_GAIN_CTRL11_ROSDAC_I_BW1
#define RF_GAIN_CTRL11_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL11_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL11_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL11_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL11_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL11_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL11_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL11_G_RBB2            RF_GAIN_CTRL11_G_RBB2
#define RF_GAIN_CTRL11_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL11_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL11_G_RBB2_MSK        (((1U << RF_GAIN_CTRL11_G_RBB2_LEN) - 1) << RF_GAIN_CTRL11_G_RBB2_POS)
#define RF_GAIN_CTRL11_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL11_G_RBB2_LEN) - 1) << RF_GAIN_CTRL11_G_RBB2_POS))
#define RF_GAIN_CTRL11_G_RBB1            RF_GAIN_CTRL11_G_RBB1
#define RF_GAIN_CTRL11_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL11_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL11_G_RBB1_MSK        (((1U << RF_GAIN_CTRL11_G_RBB1_LEN) - 1) << RF_GAIN_CTRL11_G_RBB1_POS)
#define RF_GAIN_CTRL11_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL11_G_RBB1_LEN) - 1) << RF_GAIN_CTRL11_G_RBB1_POS))

/* 0x330 : rbb_gain_ctrl12 */
#define RF_RBB_GAIN_CTRL12_OFFSET        (0x330)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW0      RF_GAIN_CTRL12_ROSDAC_Q_BW0
#define RF_GAIN_CTRL12_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL12_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL12_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL12_ROSDAC_I_BW0      RF_GAIN_CTRL12_ROSDAC_I_BW0
#define RF_GAIN_CTRL12_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL12_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL12_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL12_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL12_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL12_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL12_ROSDAC_Q_BW1      RF_GAIN_CTRL12_ROSDAC_Q_BW1
#define RF_GAIN_CTRL12_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL12_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL12_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL12_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL12_ROSDAC_I_BW1      RF_GAIN_CTRL12_ROSDAC_I_BW1
#define RF_GAIN_CTRL12_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL12_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL12_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL12_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL12_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL12_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL12_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL12_G_RBB2            RF_GAIN_CTRL12_G_RBB2
#define RF_GAIN_CTRL12_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL12_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL12_G_RBB2_MSK        (((1U << RF_GAIN_CTRL12_G_RBB2_LEN) - 1) << RF_GAIN_CTRL12_G_RBB2_POS)
#define RF_GAIN_CTRL12_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL12_G_RBB2_LEN) - 1) << RF_GAIN_CTRL12_G_RBB2_POS))
#define RF_GAIN_CTRL12_G_RBB1            RF_GAIN_CTRL12_G_RBB1
#define RF_GAIN_CTRL12_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL12_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL12_G_RBB1_MSK        (((1U << RF_GAIN_CTRL12_G_RBB1_LEN) - 1) << RF_GAIN_CTRL12_G_RBB1_POS)
#define RF_GAIN_CTRL12_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL12_G_RBB1_LEN) - 1) << RF_GAIN_CTRL12_G_RBB1_POS))

/* 0x334 : rbb_gain_ctrl13 */
#define RF_RBB_GAIN_CTRL13_OFFSET        (0x334)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW0      RF_GAIN_CTRL13_ROSDAC_Q_BW0
#define RF_GAIN_CTRL13_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL13_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL13_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL13_ROSDAC_I_BW0      RF_GAIN_CTRL13_ROSDAC_I_BW0
#define RF_GAIN_CTRL13_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL13_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL13_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL13_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL13_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL13_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL13_ROSDAC_Q_BW1      RF_GAIN_CTRL13_ROSDAC_Q_BW1
#define RF_GAIN_CTRL13_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL13_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL13_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL13_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL13_ROSDAC_I_BW1      RF_GAIN_CTRL13_ROSDAC_I_BW1
#define RF_GAIN_CTRL13_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL13_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL13_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL13_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL13_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL13_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL13_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL13_G_RBB2            RF_GAIN_CTRL13_G_RBB2
#define RF_GAIN_CTRL13_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL13_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL13_G_RBB2_MSK        (((1U << RF_GAIN_CTRL13_G_RBB2_LEN) - 1) << RF_GAIN_CTRL13_G_RBB2_POS)
#define RF_GAIN_CTRL13_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL13_G_RBB2_LEN) - 1) << RF_GAIN_CTRL13_G_RBB2_POS))
#define RF_GAIN_CTRL13_G_RBB1            RF_GAIN_CTRL13_G_RBB1
#define RF_GAIN_CTRL13_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL13_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL13_G_RBB1_MSK        (((1U << RF_GAIN_CTRL13_G_RBB1_LEN) - 1) << RF_GAIN_CTRL13_G_RBB1_POS)
#define RF_GAIN_CTRL13_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL13_G_RBB1_LEN) - 1) << RF_GAIN_CTRL13_G_RBB1_POS))

/* 0x338 : rbb_gain_ctrl14 */
#define RF_RBB_GAIN_CTRL14_OFFSET        (0x338)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW0      RF_GAIN_CTRL14_ROSDAC_Q_BW0
#define RF_GAIN_CTRL14_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL14_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL14_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL14_ROSDAC_I_BW0      RF_GAIN_CTRL14_ROSDAC_I_BW0
#define RF_GAIN_CTRL14_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL14_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL14_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL14_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL14_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL14_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL14_ROSDAC_Q_BW1      RF_GAIN_CTRL14_ROSDAC_Q_BW1
#define RF_GAIN_CTRL14_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL14_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL14_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL14_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL14_ROSDAC_I_BW1      RF_GAIN_CTRL14_ROSDAC_I_BW1
#define RF_GAIN_CTRL14_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL14_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL14_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL14_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL14_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL14_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL14_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL14_G_RBB2            RF_GAIN_CTRL14_G_RBB2
#define RF_GAIN_CTRL14_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL14_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL14_G_RBB2_MSK        (((1U << RF_GAIN_CTRL14_G_RBB2_LEN) - 1) << RF_GAIN_CTRL14_G_RBB2_POS)
#define RF_GAIN_CTRL14_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL14_G_RBB2_LEN) - 1) << RF_GAIN_CTRL14_G_RBB2_POS))
#define RF_GAIN_CTRL14_G_RBB1            RF_GAIN_CTRL14_G_RBB1
#define RF_GAIN_CTRL14_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL14_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL14_G_RBB1_MSK        (((1U << RF_GAIN_CTRL14_G_RBB1_LEN) - 1) << RF_GAIN_CTRL14_G_RBB1_POS)
#define RF_GAIN_CTRL14_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL14_G_RBB1_LEN) - 1) << RF_GAIN_CTRL14_G_RBB1_POS))

/* 0x33C : rbb_gain_ctrl15 */
#define RF_RBB_GAIN_CTRL15_OFFSET        (0x33C)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW0      RF_GAIN_CTRL15_ROSDAC_Q_BW0
#define RF_GAIN_CTRL15_ROSDAC_Q_BW0_POS  (0U)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW0_LEN  (6U)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW0_MSK  (((1U << RF_GAIN_CTRL15_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_Q_BW0_POS)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW0_UMSK (~(((1U << RF_GAIN_CTRL15_ROSDAC_Q_BW0_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_Q_BW0_POS))
#define RF_GAIN_CTRL15_ROSDAC_I_BW0      RF_GAIN_CTRL15_ROSDAC_I_BW0
#define RF_GAIN_CTRL15_ROSDAC_I_BW0_POS  (6U)
#define RF_GAIN_CTRL15_ROSDAC_I_BW0_LEN  (6U)
#define RF_GAIN_CTRL15_ROSDAC_I_BW0_MSK  (((1U << RF_GAIN_CTRL15_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_I_BW0_POS)
#define RF_GAIN_CTRL15_ROSDAC_I_BW0_UMSK (~(((1U << RF_GAIN_CTRL15_ROSDAC_I_BW0_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_I_BW0_POS))
#define RF_GAIN_CTRL15_ROSDAC_Q_BW1      RF_GAIN_CTRL15_ROSDAC_Q_BW1
#define RF_GAIN_CTRL15_ROSDAC_Q_BW1_POS  (12U)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW1_LEN  (6U)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW1_MSK  (((1U << RF_GAIN_CTRL15_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_Q_BW1_POS)
#define RF_GAIN_CTRL15_ROSDAC_Q_BW1_UMSK (~(((1U << RF_GAIN_CTRL15_ROSDAC_Q_BW1_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_Q_BW1_POS))
#define RF_GAIN_CTRL15_ROSDAC_I_BW1      RF_GAIN_CTRL15_ROSDAC_I_BW1
#define RF_GAIN_CTRL15_ROSDAC_I_BW1_POS  (18U)
#define RF_GAIN_CTRL15_ROSDAC_I_BW1_LEN  (6U)
#define RF_GAIN_CTRL15_ROSDAC_I_BW1_MSK  (((1U << RF_GAIN_CTRL15_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_I_BW1_POS)
#define RF_GAIN_CTRL15_ROSDAC_I_BW1_UMSK (~(((1U << RF_GAIN_CTRL15_ROSDAC_I_BW1_LEN) - 1) << RF_GAIN_CTRL15_ROSDAC_I_BW1_POS))
#define RF_GAIN_CTRL15_G_RBB2            RF_GAIN_CTRL15_G_RBB2
#define RF_GAIN_CTRL15_G_RBB2_POS        (24U)
#define RF_GAIN_CTRL15_G_RBB2_LEN        (3U)
#define RF_GAIN_CTRL15_G_RBB2_MSK        (((1U << RF_GAIN_CTRL15_G_RBB2_LEN) - 1) << RF_GAIN_CTRL15_G_RBB2_POS)
#define RF_GAIN_CTRL15_G_RBB2_UMSK       (~(((1U << RF_GAIN_CTRL15_G_RBB2_LEN) - 1) << RF_GAIN_CTRL15_G_RBB2_POS))
#define RF_GAIN_CTRL15_G_RBB1            RF_GAIN_CTRL15_G_RBB1
#define RF_GAIN_CTRL15_G_RBB1_POS        (28U)
#define RF_GAIN_CTRL15_G_RBB1_LEN        (2U)
#define RF_GAIN_CTRL15_G_RBB1_MSK        (((1U << RF_GAIN_CTRL15_G_RBB1_LEN) - 1) << RF_GAIN_CTRL15_G_RBB1_POS)
#define RF_GAIN_CTRL15_G_RBB1_UMSK       (~(((1U << RF_GAIN_CTRL15_G_RBB1_LEN) - 1) << RF_GAIN_CTRL15_G_RBB1_POS))

