bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x400 : acal_config */
#define RF_ACAL_CONFIG_OFFSET (0x400)
#define RF_VCO_IDAC_LL        RF_VCO_IDAC_LL
#define RF_VCO_IDAC_LL_POS    (0U)
#define RF_VCO_IDAC_LL_LEN    (6U)
#define RF_VCO_IDAC_LL_MSK    (((1U << RF_VCO_IDAC_LL_LEN) - 1) << RF_VCO_IDAC_LL_POS)
#define RF_VCO_IDAC_LL_UMSK   (~(((1U << RF_VCO_IDAC_LL_LEN) - 1) << RF_VCO_IDAC_LL_POS))
#define RF_VCO_IDAC_LH        RF_VCO_IDAC_LH
#define RF_VCO_IDAC_LH_POS    (8U)
#define RF_VCO_IDAC_LH_LEN    (6U)
#define RF_VCO_IDAC_LH_MSK    (((1U << RF_VCO_IDAC_LH_LEN) - 1) << RF_VCO_IDAC_LH_POS)
#define RF_VCO_IDAC_LH_UMSK   (~(((1U << RF_VCO_IDAC_LH_LEN) - 1) << RF_VCO_IDAC_LH_POS))
#define RF_VCO_IDAC_HL        RF_VCO_IDAC_HL
#define RF_VCO_IDAC_HL_POS    (16U)
#define RF_VCO_IDAC_HL_LEN    (6U)
#define RF_VCO_IDAC_HL_MSK    (((1U << RF_VCO_IDAC_HL_LEN) - 1) << RF_VCO_IDAC_HL_POS)
#define RF_VCO_IDAC_HL_UMSK   (~(((1U << RF_VCO_IDAC_HL_LEN) - 1) << RF_VCO_IDAC_HL_POS))
#define RF_VCO_IDAC_HH        RF_VCO_IDAC_HH
#define RF_VCO_IDAC_HH_POS    (24U)
#define RF_VCO_IDAC_HH_LEN    (6U)
#define RF_VCO_IDAC_HH_MSK    (((1U << RF_VCO_IDAC_HH_LEN) - 1) << RF_VCO_IDAC_HH_POS)
#define RF_VCO_IDAC_HH_UMSK   (~(((1U << RF_VCO_IDAC_HH_LEN) - 1) << RF_VCO_IDAC_HH_POS))

/* 0x404 : lo_config_2402 */
#define RF_LO_CONFIG_2402_OFFSET         (0x404)
#define RF_KCAL_RATIO_2402               RF_KCAL_RATIO_2402
#define RF_KCAL_RATIO_2402_POS           (0U)
#define RF_KCAL_RATIO_2402_LEN           (10U)
#define RF_KCAL_RATIO_2402_MSK           (((1U << RF_KCAL_RATIO_2402_LEN) - 1) << RF_KCAL_RATIO_2402_POS)
#define RF_KCAL_RATIO_2402_UMSK          (~(((1U << RF_KCAL_RATIO_2402_LEN) - 1) << RF_KCAL_RATIO_2402_POS))
#define RF_ADPLL_SDM_DITHER_EN_2402      RF_ADPLL_SDM_DITHER_EN_2402
#define RF_ADPLL_SDM_DITHER_EN_2402_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2402_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2402_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2402_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2402_POS)
#define RF_ADPLL_SDM_DITHER_EN_2402_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2402_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2402_POS))

/* 0x408 : lo_config_2404 */
#define RF_LO_CONFIG_2404_OFFSET         (0x408)
#define RF_KCAL_RATIO_2404               RF_KCAL_RATIO_2404
#define RF_KCAL_RATIO_2404_POS           (0U)
#define RF_KCAL_RATIO_2404_LEN           (10U)
#define RF_KCAL_RATIO_2404_MSK           (((1U << RF_KCAL_RATIO_2404_LEN) - 1) << RF_KCAL_RATIO_2404_POS)
#define RF_KCAL_RATIO_2404_UMSK          (~(((1U << RF_KCAL_RATIO_2404_LEN) - 1) << RF_KCAL_RATIO_2404_POS))
#define RF_ADPLL_SDM_DITHER_EN_2404      RF_ADPLL_SDM_DITHER_EN_2404
#define RF_ADPLL_SDM_DITHER_EN_2404_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2404_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2404_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2404_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2404_POS)
#define RF_ADPLL_SDM_DITHER_EN_2404_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2404_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2404_POS))

/* 0x40C : lo_config_2406 */
#define RF_LO_CONFIG_2406_OFFSET         (0x40C)
#define RF_KCAL_RATIO_2406               RF_KCAL_RATIO_2406
#define RF_KCAL_RATIO_2406_POS           (0U)
#define RF_KCAL_RATIO_2406_LEN           (10U)
#define RF_KCAL_RATIO_2406_MSK           (((1U << RF_KCAL_RATIO_2406_LEN) - 1) << RF_KCAL_RATIO_2406_POS)
#define RF_KCAL_RATIO_2406_UMSK          (~(((1U << RF_KCAL_RATIO_2406_LEN) - 1) << RF_KCAL_RATIO_2406_POS))
#define RF_ADPLL_SDM_DITHER_EN_2406      RF_ADPLL_SDM_DITHER_EN_2406
#define RF_ADPLL_SDM_DITHER_EN_2406_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2406_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2406_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2406_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2406_POS)
#define RF_ADPLL_SDM_DITHER_EN_2406_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2406_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2406_POS))

/* 0x410 : lo_config_2408 */
#define RF_LO_CONFIG_2408_OFFSET         (0x410)
#define RF_KCAL_RATIO_2408               RF_KCAL_RATIO_2408
#define RF_KCAL_RATIO_2408_POS           (0U)
#define RF_KCAL_RATIO_2408_LEN           (10U)
#define RF_KCAL_RATIO_2408_MSK           (((1U << RF_KCAL_RATIO_2408_LEN) - 1) << RF_KCAL_RATIO_2408_POS)
#define RF_KCAL_RATIO_2408_UMSK          (~(((1U << RF_KCAL_RATIO_2408_LEN) - 1) << RF_KCAL_RATIO_2408_POS))
#define RF_ADPLL_SDM_DITHER_EN_2408      RF_ADPLL_SDM_DITHER_EN_2408
#define RF_ADPLL_SDM_DITHER_EN_2408_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2408_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2408_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2408_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2408_POS)
#define RF_ADPLL_SDM_DITHER_EN_2408_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2408_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2408_POS))

/* 0x414 : lo_config_2410 */
#define RF_LO_CONFIG_2410_OFFSET         (0x414)
#define RF_KCAL_RATIO_2410               RF_KCAL_RATIO_2410
#define RF_KCAL_RATIO_2410_POS           (0U)
#define RF_KCAL_RATIO_2410_LEN           (10U)
#define RF_KCAL_RATIO_2410_MSK           (((1U << RF_KCAL_RATIO_2410_LEN) - 1) << RF_KCAL_RATIO_2410_POS)
#define RF_KCAL_RATIO_2410_UMSK          (~(((1U << RF_KCAL_RATIO_2410_LEN) - 1) << RF_KCAL_RATIO_2410_POS))
#define RF_ADPLL_SDM_DITHER_EN_2410      RF_ADPLL_SDM_DITHER_EN_2410
#define RF_ADPLL_SDM_DITHER_EN_2410_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2410_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2410_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2410_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2410_POS)
#define RF_ADPLL_SDM_DITHER_EN_2410_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2410_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2410_POS))

/* 0x418 : lo_config_2412 */
#define RF_LO_CONFIG_2412_OFFSET         (0x418)
#define RF_KCAL_RATIO_2412               RF_KCAL_RATIO_2412
#define RF_KCAL_RATIO_2412_POS           (0U)
#define RF_KCAL_RATIO_2412_LEN           (10U)
#define RF_KCAL_RATIO_2412_MSK           (((1U << RF_KCAL_RATIO_2412_LEN) - 1) << RF_KCAL_RATIO_2412_POS)
#define RF_KCAL_RATIO_2412_UMSK          (~(((1U << RF_KCAL_RATIO_2412_LEN) - 1) << RF_KCAL_RATIO_2412_POS))
#define RF_ADPLL_SDM_DITHER_EN_2412      RF_ADPLL_SDM_DITHER_EN_2412
#define RF_ADPLL_SDM_DITHER_EN_2412_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2412_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2412_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2412_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2412_POS)
#define RF_ADPLL_SDM_DITHER_EN_2412_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2412_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2412_POS))

