bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x41C : lo_config_2414 */
#define RF_LO_CONFIG_2414_OFFSET         (0x41C)
#define RF_KCAL_RATIO_2414               RF_KCAL_RATIO_2414
#define RF_KCAL_RATIO_2414_POS           (0U)
#define RF_KCAL_RATIO_2414_LEN           (10U)
#define RF_KCAL_RATIO_2414_MSK           (((1U << RF_KCAL_RATIO_2414_LEN) - 1) << RF_KCAL_RATIO_2414_POS)
#define RF_KCAL_RATIO_2414_UMSK          (~(((1U << RF_KCAL_RATIO_2414_LEN) - 1) << RF_KCAL_RATIO_2414_POS))
#define RF_ADPLL_SDM_DITHER_EN_2414      RF_ADPLL_SDM_DITHER_EN_2414
#define RF_ADPLL_SDM_DITHER_EN_2414_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2414_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2414_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2414_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2414_POS)
#define RF_ADPLL_SDM_DITHER_EN_2414_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2414_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2414_POS))

/* 0x420 : lo_config_2416 */
#define RF_LO_CONFIG_2416_OFFSET         (0x420)
#define RF_KCAL_RATIO_2416               RF_KCAL_RATIO_2416
#define RF_KCAL_RATIO_2416_POS           (0U)
#define RF_KCAL_RATIO_2416_LEN           (10U)
#define RF_KCAL_RATIO_2416_MSK           (((1U << RF_KCAL_RATIO_2416_LEN) - 1) << RF_KCAL_RATIO_2416_POS)
#define RF_KCAL_RATIO_2416_UMSK          (~(((1U << RF_KCAL_RATIO_2416_LEN) - 1) << RF_KCAL_RATIO_2416_POS))
#define RF_ADPLL_SDM_DITHER_EN_2416      RF_ADPLL_SDM_DITHER_EN_2416
#define RF_ADPLL_SDM_DITHER_EN_2416_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2416_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2416_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2416_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2416_POS)
#define RF_ADPLL_SDM_DITHER_EN_2416_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2416_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2416_POS))

/* 0x424 : lo_config_2418 */
#define RF_LO_CONFIG_2418_OFFSET         (0x424)
#define RF_KCAL_RATIO_2418               RF_KCAL_RATIO_2418
#define RF_KCAL_RATIO_2418_POS           (0U)
#define RF_KCAL_RATIO_2418_LEN           (10U)
#define RF_KCAL_RATIO_2418_MSK           (((1U << RF_KCAL_RATIO_2418_LEN) - 1) << RF_KCAL_RATIO_2418_POS)
#define RF_KCAL_RATIO_2418_UMSK          (~(((1U << RF_KCAL_RATIO_2418_LEN) - 1) << RF_KCAL_RATIO_2418_POS))
#define RF_ADPLL_SDM_DITHER_EN_2418      RF_ADPLL_SDM_DITHER_EN_2418
#define RF_ADPLL_SDM_DITHER_EN_2418_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2418_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2418_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2418_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2418_POS)
#define RF_ADPLL_SDM_DITHER_EN_2418_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2418_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2418_POS))

/* 0x428 : lo_config_2420 */
#define RF_LO_CONFIG_2420_OFFSET         (0x428)
#define RF_KCAL_RATIO_2420               RF_KCAL_RATIO_2420
#define RF_KCAL_RATIO_2420_POS           (0U)
#define RF_KCAL_RATIO_2420_LEN           (10U)
#define RF_KCAL_RATIO_2420_MSK           (((1U << RF_KCAL_RATIO_2420_LEN) - 1) << RF_KCAL_RATIO_2420_POS)
#define RF_KCAL_RATIO_2420_UMSK          (~(((1U << RF_KCAL_RATIO_2420_LEN) - 1) << RF_KCAL_RATIO_2420_POS))
#define RF_ADPLL_SDM_DITHER_EN_2420      RF_ADPLL_SDM_DITHER_EN_2420
#define RF_ADPLL_SDM_DITHER_EN_2420_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2420_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2420_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2420_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2420_POS)
#define RF_ADPLL_SDM_DITHER_EN_2420_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2420_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2420_POS))

/* 0x42C : lo_config_2422 */
#define RF_LO_CONFIG_2422_OFFSET         (0x42C)
#define RF_KCAL_RATIO_2422               RF_KCAL_RATIO_2422
#define RF_KCAL_RATIO_2422_POS           (0U)
#define RF_KCAL_RATIO_2422_LEN           (10U)
#define RF_KCAL_RATIO_2422_MSK           (((1U << RF_KCAL_RATIO_2422_LEN) - 1) << RF_KCAL_RATIO_2422_POS)
#define RF_KCAL_RATIO_2422_UMSK          (~(((1U << RF_KCAL_RATIO_2422_LEN) - 1) << RF_KCAL_RATIO_2422_POS))
#define RF_ADPLL_SDM_DITHER_EN_2422      RF_ADPLL_SDM_DITHER_EN_2422
#define RF_ADPLL_SDM_DITHER_EN_2422_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2422_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2422_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2422_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2422_POS)
#define RF_ADPLL_SDM_DITHER_EN_2422_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2422_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2422_POS))

/* 0x430 : lo_config_2424 */
#define RF_LO_CONFIG_2424_OFFSET         (0x430)
#define RF_KCAL_RATIO_2424               RF_KCAL_RATIO_2424
#define RF_KCAL_RATIO_2424_POS           (0U)
#define RF_KCAL_RATIO_2424_LEN           (10U)
#define RF_KCAL_RATIO_2424_MSK           (((1U << RF_KCAL_RATIO_2424_LEN) - 1) << RF_KCAL_RATIO_2424_POS)
#define RF_KCAL_RATIO_2424_UMSK          (~(((1U << RF_KCAL_RATIO_2424_LEN) - 1) << RF_KCAL_RATIO_2424_POS))
#define RF_ADPLL_SDM_DITHER_EN_2424      RF_ADPLL_SDM_DITHER_EN_2424
#define RF_ADPLL_SDM_DITHER_EN_2424_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2424_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2424_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2424_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2424_POS)
#define RF_ADPLL_SDM_DITHER_EN_2424_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2424_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2424_POS))

/* 0x434 : lo_config_2426 */
#define RF_LO_CONFIG_2426_OFFSET         (0x434)
#define RF_KCAL_RATIO_2426               RF_KCAL_RATIO_2426
#define RF_KCAL_RATIO_2426_POS           (0U)
#define RF_KCAL_RATIO_2426_LEN           (10U)
#define RF_KCAL_RATIO_2426_MSK           (((1U << RF_KCAL_RATIO_2426_LEN) - 1) << RF_KCAL_RATIO_2426_POS)
#define RF_KCAL_RATIO_2426_UMSK          (~(((1U << RF_KCAL_RATIO_2426_LEN) - 1) << RF_KCAL_RATIO_2426_POS))
#define RF_ADPLL_SDM_DITHER_EN_2426      RF_ADPLL_SDM_DITHER_EN_2426
#define RF_ADPLL_SDM_DITHER_EN_2426_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2426_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2426_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2426_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2426_POS)
#define RF_ADPLL_SDM_DITHER_EN_2426_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2426_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2426_POS))

