bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x438 : lo_config_2428 */
#define RF_LO_CONFIG_2428_OFFSET         (0x438)
#define RF_KCAL_RATIO_2428               RF_KCAL_RATIO_2428
#define RF_KCAL_RATIO_2428_POS           (0U)
#define RF_KCAL_RATIO_2428_LEN           (10U)
#define RF_KCAL_RATIO_2428_MSK           (((1U << RF_KCAL_RATIO_2428_LEN) - 1) << RF_KCAL_RATIO_2428_POS)
#define RF_KCAL_RATIO_2428_UMSK          (~(((1U << RF_KCAL_RATIO_2428_LEN) - 1) << RF_KCAL_RATIO_2428_POS))
#define RF_ADPLL_SDM_DITHER_EN_2428      RF_ADPLL_SDM_DITHER_EN_2428
#define RF_ADPLL_SDM_DITHER_EN_2428_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2428_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2428_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2428_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2428_POS)
#define RF_ADPLL_SDM_DITHER_EN_2428_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2428_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2428_POS))

/* 0x43C : lo_config_2430 */
#define RF_LO_CONFIG_2430_OFFSET         (0x43C)
#define RF_KCAL_RATIO_2430               RF_KCAL_RATIO_2430
#define RF_KCAL_RATIO_2430_POS           (0U)
#define RF_KCAL_RATIO_2430_LEN           (10U)
#define RF_KCAL_RATIO_2430_MSK           (((1U << RF_KCAL_RATIO_2430_LEN) - 1) << RF_KCAL_RATIO_2430_POS)
#define RF_KCAL_RATIO_2430_UMSK          (~(((1U << RF_KCAL_RATIO_2430_LEN) - 1) << RF_KCAL_RATIO_2430_POS))
#define RF_ADPLL_SDM_DITHER_EN_2430      RF_ADPLL_SDM_DITHER_EN_2430
#define RF_ADPLL_SDM_DITHER_EN_2430_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2430_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2430_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2430_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2430_POS)
#define RF_ADPLL_SDM_DITHER_EN_2430_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2430_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2430_POS))

/* 0x440 : lo_config_2432 */
#define RF_LO_CONFIG_2432_OFFSET         (0x440)
#define RF_KCAL_RATIO_2432               RF_KCAL_RATIO_2432
#define RF_KCAL_RATIO_2432_POS           (0U)
#define RF_KCAL_RATIO_2432_LEN           (10U)
#define RF_KCAL_RATIO_2432_MSK           (((1U << RF_KCAL_RATIO_2432_LEN) - 1) << RF_KCAL_RATIO_2432_POS)
#define RF_KCAL_RATIO_2432_UMSK          (~(((1U << RF_KCAL_RATIO_2432_LEN) - 1) << RF_KCAL_RATIO_2432_POS))
#define RF_ADPLL_SDM_DITHER_EN_2432      RF_ADPLL_SDM_DITHER_EN_2432
#define RF_ADPLL_SDM_DITHER_EN_2432_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2432_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2432_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2432_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2432_POS)
#define RF_ADPLL_SDM_DITHER_EN_2432_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2432_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2432_POS))

/* 0x444 : lo_config_2434 */
#define RF_LO_CONFIG_2434_OFFSET         (0x444)
#define RF_KCAL_RATIO_2434               RF_KCAL_RATIO_2434
#define RF_KCAL_RATIO_2434_POS           (0U)
#define RF_KCAL_RATIO_2434_LEN           (10U)
#define RF_KCAL_RATIO_2434_MSK           (((1U << RF_KCAL_RATIO_2434_LEN) - 1) << RF_KCAL_RATIO_2434_POS)
#define RF_KCAL_RATIO_2434_UMSK          (~(((1U << RF_KCAL_RATIO_2434_LEN) - 1) << RF_KCAL_RATIO_2434_POS))
#define RF_ADPLL_SDM_DITHER_EN_2434      RF_ADPLL_SDM_DITHER_EN_2434
#define RF_ADPLL_SDM_DITHER_EN_2434_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2434_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2434_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2434_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2434_POS)
#define RF_ADPLL_SDM_DITHER_EN_2434_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2434_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2434_POS))

/* 0x448 : lo_config_2436 */
#define RF_LO_CONFIG_2436_OFFSET         (0x448)
#define RF_KCAL_RATIO_2436               RF_KCAL_RATIO_2436
#define RF_KCAL_RATIO_2436_POS           (0U)
#define RF_KCAL_RATIO_2436_LEN           (10U)
#define RF_KCAL_RATIO_2436_MSK           (((1U << RF_KCAL_RATIO_2436_LEN) - 1) << RF_KCAL_RATIO_2436_POS)
#define RF_KCAL_RATIO_2436_UMSK          (~(((1U << RF_KCAL_RATIO_2436_LEN) - 1) << RF_KCAL_RATIO_2436_POS))
#define RF_ADPLL_SDM_DITHER_EN_2436      RF_ADPLL_SDM_DITHER_EN_2436
#define RF_ADPLL_SDM_DITHER_EN_2436_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2436_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2436_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2436_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2436_POS)
#define RF_ADPLL_SDM_DITHER_EN_2436_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2436_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2436_POS))

/* 0x44C : lo_config_2438 */
#define RF_LO_CONFIG_2438_OFFSET         (0x44C)
#define RF_KCAL_RATIO_2438               RF_KCAL_RATIO_2438
#define RF_KCAL_RATIO_2438_POS           (0U)
#define RF_KCAL_RATIO_2438_LEN           (10U)
#define RF_KCAL_RATIO_2438_MSK           (((1U << RF_KCAL_RATIO_2438_LEN) - 1) << RF_KCAL_RATIO_2438_POS)
#define RF_KCAL_RATIO_2438_UMSK          (~(((1U << RF_KCAL_RATIO_2438_LEN) - 1) << RF_KCAL_RATIO_2438_POS))
#define RF_ADPLL_SDM_DITHER_EN_2438      RF_ADPLL_SDM_DITHER_EN_2438
#define RF_ADPLL_SDM_DITHER_EN_2438_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2438_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2438_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2438_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2438_POS)
#define RF_ADPLL_SDM_DITHER_EN_2438_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2438_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2438_POS))

/* 0x450 : lo_config_2440 */
#define RF_LO_CONFIG_2440_OFFSET         (0x450)
#define RF_KCAL_RATIO_2440               RF_KCAL_RATIO_2440
#define RF_KCAL_RATIO_2440_POS           (0U)
#define RF_KCAL_RATIO_2440_LEN           (10U)
#define RF_KCAL_RATIO_2440_MSK           (((1U << RF_KCAL_RATIO_2440_LEN) - 1) << RF_KCAL_RATIO_2440_POS)
#define RF_KCAL_RATIO_2440_UMSK          (~(((1U << RF_KCAL_RATIO_2440_LEN) - 1) << RF_KCAL_RATIO_2440_POS))
#define RF_ADPLL_SDM_DITHER_EN_2440      RF_ADPLL_SDM_DITHER_EN_2440
#define RF_ADPLL_SDM_DITHER_EN_2440_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2440_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2440_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2440_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2440_POS)
#define RF_ADPLL_SDM_DITHER_EN_2440_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2440_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2440_POS))

/* 0x454 : lo_config_2442 */
#define RF_LO_CONFIG_2442_OFFSET         (0x454)
#define RF_KCAL_RATIO_2442               RF_KCAL_RATIO_2442
#define RF_KCAL_RATIO_2442_POS           (0U)
#define RF_KCAL_RATIO_2442_LEN           (10U)
#define RF_KCAL_RATIO_2442_MSK           (((1U << RF_KCAL_RATIO_2442_LEN) - 1) << RF_KCAL_RATIO_2442_POS)
#define RF_KCAL_RATIO_2442_UMSK          (~(((1U << RF_KCAL_RATIO_2442_LEN) - 1) << RF_KCAL_RATIO_2442_POS))
#define RF_ADPLL_SDM_DITHER_EN_2442      RF_ADPLL_SDM_DITHER_EN_2442
#define RF_ADPLL_SDM_DITHER_EN_2442_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2442_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2442_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2442_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2442_POS)
#define RF_ADPLL_SDM_DITHER_EN_2442_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2442_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2442_POS))

