bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x458 : lo_config_2444 */
#define RF_LO_CONFIG_2444_OFFSET         (0x458)
#define RF_KCAL_RATIO_2444               RF_KCAL_RATIO_2444
#define RF_KCAL_RATIO_2444_POS           (0U)
#define RF_KCAL_RATIO_2444_LEN           (10U)
#define RF_KCAL_RATIO_2444_MSK           (((1U << RF_KCAL_RATIO_2444_LEN) - 1) << RF_KCAL_RATIO_2444_POS)
#define RF_KCAL_RATIO_2444_UMSK          (~(((1U << RF_KCAL_RATIO_2444_LEN) - 1) << RF_KCAL_RATIO_2444_POS))
#define RF_ADPLL_SDM_DITHER_EN_2444      RF_ADPLL_SDM_DITHER_EN_2444
#define RF_ADPLL_SDM_DITHER_EN_2444_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2444_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2444_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2444_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2444_POS)
#define RF_ADPLL_SDM_DITHER_EN_2444_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2444_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2444_POS))

/* 0x45C : lo_config_2446 */
#define RF_LO_CONFIG_2446_OFFSET         (0x45C)
#define RF_KCAL_RATIO_2446               RF_KCAL_RATIO_2446
#define RF_KCAL_RATIO_2446_POS           (0U)
#define RF_KCAL_RATIO_2446_LEN           (10U)
#define RF_KCAL_RATIO_2446_MSK           (((1U << RF_KCAL_RATIO_2446_LEN) - 1) << RF_KCAL_RATIO_2446_POS)
#define RF_KCAL_RATIO_2446_UMSK          (~(((1U << RF_KCAL_RATIO_2446_LEN) - 1) << RF_KCAL_RATIO_2446_POS))
#define RF_ADPLL_SDM_DITHER_EN_2446      RF_ADPLL_SDM_DITHER_EN_2446
#define RF_ADPLL_SDM_DITHER_EN_2446_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2446_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2446_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2446_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2446_POS)
#define RF_ADPLL_SDM_DITHER_EN_2446_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2446_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2446_POS))

/* 0x460 : lo_config_2448 */
#define RF_LO_CONFIG_2448_OFFSET         (0x460)
#define RF_KCAL_RATIO_2448               RF_KCAL_RATIO_2448
#define RF_KCAL_RATIO_2448_POS           (0U)
#define RF_KCAL_RATIO_2448_LEN           (10U)
#define RF_KCAL_RATIO_2448_MSK           (((1U << RF_KCAL_RATIO_2448_LEN) - 1) << RF_KCAL_RATIO_2448_POS)
#define RF_KCAL_RATIO_2448_UMSK          (~(((1U << RF_KCAL_RATIO_2448_LEN) - 1) << RF_KCAL_RATIO_2448_POS))
#define RF_ADPLL_SDM_DITHER_EN_2448      RF_ADPLL_SDM_DITHER_EN_2448
#define RF_ADPLL_SDM_DITHER_EN_2448_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2448_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2448_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2448_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2448_POS)
#define RF_ADPLL_SDM_DITHER_EN_2448_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2448_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2448_POS))

/* 0x464 : lo_config_2450 */
#define RF_LO_CONFIG_2450_OFFSET         (0x464)
#define RF_KCAL_RATIO_2450               RF_KCAL_RATIO_2450
#define RF_KCAL_RATIO_2450_POS           (0U)
#define RF_KCAL_RATIO_2450_LEN           (10U)
#define RF_KCAL_RATIO_2450_MSK           (((1U << RF_KCAL_RATIO_2450_LEN) - 1) << RF_KCAL_RATIO_2450_POS)
#define RF_KCAL_RATIO_2450_UMSK          (~(((1U << RF_KCAL_RATIO_2450_LEN) - 1) << RF_KCAL_RATIO_2450_POS))
#define RF_ADPLL_SDM_DITHER_EN_2450      RF_ADPLL_SDM_DITHER_EN_2450
#define RF_ADPLL_SDM_DITHER_EN_2450_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2450_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2450_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2450_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2450_POS)
#define RF_ADPLL_SDM_DITHER_EN_2450_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2450_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2450_POS))

/* 0x468 : lo_config_2452 */
#define RF_LO_CONFIG_2452_OFFSET         (0x468)
#define RF_KCAL_RATIO_2452               RF_KCAL_RATIO_2452
#define RF_KCAL_RATIO_2452_POS           (0U)
#define RF_KCAL_RATIO_2452_LEN           (10U)
#define RF_KCAL_RATIO_2452_MSK           (((1U << RF_KCAL_RATIO_2452_LEN) - 1) << RF_KCAL_RATIO_2452_POS)
#define RF_KCAL_RATIO_2452_UMSK          (~(((1U << RF_KCAL_RATIO_2452_LEN) - 1) << RF_KCAL_RATIO_2452_POS))
#define RF_ADPLL_SDM_DITHER_EN_2452      RF_ADPLL_SDM_DITHER_EN_2452
#define RF_ADPLL_SDM_DITHER_EN_2452_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2452_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2452_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2452_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2452_POS)
#define RF_ADPLL_SDM_DITHER_EN_2452_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2452_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2452_POS))

/* 0x46C : lo_config_2454 */
#define RF_LO_CONFIG_2454_OFFSET         (0x46C)
#define RF_KCAL_RATIO_2454               RF_KCAL_RATIO_2454
#define RF_KCAL_RATIO_2454_POS           (0U)
#define RF_KCAL_RATIO_2454_LEN           (10U)
#define RF_KCAL_RATIO_2454_MSK           (((1U << RF_KCAL_RATIO_2454_LEN) - 1) << RF_KCAL_RATIO_2454_POS)
#define RF_KCAL_RATIO_2454_UMSK          (~(((1U << RF_KCAL_RATIO_2454_LEN) - 1) << RF_KCAL_RATIO_2454_POS))
#define RF_ADPLL_SDM_DITHER_EN_2454      RF_ADPLL_SDM_DITHER_EN_2454
#define RF_ADPLL_SDM_DITHER_EN_2454_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2454_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2454_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2454_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2454_POS)
#define RF_ADPLL_SDM_DITHER_EN_2454_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2454_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2454_POS))

/* 0x470 : lo_config_2456 */
#define RF_LO_CONFIG_2456_OFFSET         (0x470)
#define RF_KCAL_RATIO_2456               RF_KCAL_RATIO_2456
#define RF_KCAL_RATIO_2456_POS           (0U)
#define RF_KCAL_RATIO_2456_LEN           (10U)
#define RF_KCAL_RATIO_2456_MSK           (((1U << RF_KCAL_RATIO_2456_LEN) - 1) << RF_KCAL_RATIO_2456_POS)
#define RF_KCAL_RATIO_2456_UMSK          (~(((1U << RF_KCAL_RATIO_2456_LEN) - 1) << RF_KCAL_RATIO_2456_POS))
#define RF_ADPLL_SDM_DITHER_EN_2456      RF_ADPLL_SDM_DITHER_EN_2456
#define RF_ADPLL_SDM_DITHER_EN_2456_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2456_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2456_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2456_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2456_POS)
#define RF_ADPLL_SDM_DITHER_EN_2456_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2456_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2456_POS))

/* 0x474 : lo_config_2458 */
#define RF_LO_CONFIG_2458_OFFSET         (0x474)
#define RF_KCAL_RATIO_2458               RF_KCAL_RATIO_2458
#define RF_KCAL_RATIO_2458_POS           (0U)
#define RF_KCAL_RATIO_2458_LEN           (10U)
#define RF_KCAL_RATIO_2458_MSK           (((1U << RF_KCAL_RATIO_2458_LEN) - 1) << RF_KCAL_RATIO_2458_POS)
#define RF_KCAL_RATIO_2458_UMSK          (~(((1U << RF_KCAL_RATIO_2458_LEN) - 1) << RF_KCAL_RATIO_2458_POS))
#define RF_ADPLL_SDM_DITHER_EN_2458      RF_ADPLL_SDM_DITHER_EN_2458
#define RF_ADPLL_SDM_DITHER_EN_2458_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2458_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2458_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2458_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2458_POS)
#define RF_ADPLL_SDM_DITHER_EN_2458_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2458_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2458_POS))

/* 0x478 : lo_config_2460 */
#define RF_LO_CONFIG_2460_OFFSET         (0x478)
#define RF_KCAL_RATIO_2460               RF_KCAL_RATIO_2460
#define RF_KCAL_RATIO_2460_POS           (0U)
#define RF_KCAL_RATIO_2460_LEN           (10U)
#define RF_KCAL_RATIO_2460_MSK           (((1U << RF_KCAL_RATIO_2460_LEN) - 1) << RF_KCAL_RATIO_2460_POS)
#define RF_KCAL_RATIO_2460_UMSK          (~(((1U << RF_KCAL_RATIO_2460_LEN) - 1) << RF_KCAL_RATIO_2460_POS))
#define RF_ADPLL_SDM_DITHER_EN_2460      RF_ADPLL_SDM_DITHER_EN_2460
#define RF_ADPLL_SDM_DITHER_EN_2460_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2460_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2460_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2460_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2460_POS)
#define RF_ADPLL_SDM_DITHER_EN_2460_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2460_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2460_POS))

