bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x47C : lo_config_2462 */
#define RF_LO_CONFIG_2462_OFFSET         (0x47C)
#define RF_KCAL_RATIO_2462               RF_KCAL_RATIO_2462
#define RF_KCAL_RATIO_2462_POS           (0U)
#define RF_KCAL_RATIO_2462_LEN           (10U)
#define RF_KCAL_RATIO_2462_MSK           (((1U << RF_KCAL_RATIO_2462_LEN) - 1) << RF_KCAL_RATIO_2462_POS)
#define RF_KCAL_RATIO_2462_UMSK          (~(((1U << RF_KCAL_RATIO_2462_LEN) - 1) << RF_KCAL_RATIO_2462_POS))
#define RF_ADPLL_SDM_DITHER_EN_2462      RF_ADPLL_SDM_DITHER_EN_2462
#define RF_ADPLL_SDM_DITHER_EN_2462_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2462_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2462_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2462_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2462_POS)
#define RF_ADPLL_SDM_DITHER_EN_2462_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2462_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2462_POS))

/* 0x480 : lo_config_2464 */
#define RF_LO_CONFIG_2464_OFFSET         (0x480)
#define RF_KCAL_RATIO_2464               RF_KCAL_RATIO_2464
#define RF_KCAL_RATIO_2464_POS           (0U)
#define RF_KCAL_RATIO_2464_LEN           (10U)
#define RF_KCAL_RATIO_2464_MSK           (((1U << RF_KCAL_RATIO_2464_LEN) - 1) << RF_KCAL_RATIO_2464_POS)
#define RF_KCAL_RATIO_2464_UMSK          (~(((1U << RF_KCAL_RATIO_2464_LEN) - 1) << RF_KCAL_RATIO_2464_POS))
#define RF_ADPLL_SDM_DITHER_EN_2464      RF_ADPLL_SDM_DITHER_EN_2464
#define RF_ADPLL_SDM_DITHER_EN_2464_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2464_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2464_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2464_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2464_POS)
#define RF_ADPLL_SDM_DITHER_EN_2464_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2464_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2464_POS))

/* 0x484 : lo_config_2466 */
#define RF_LO_CONFIG_2466_OFFSET         (0x484)
#define RF_KCAL_RATIO_2466               RF_KCAL_RATIO_2466
#define RF_KCAL_RATIO_2466_POS           (0U)
#define RF_KCAL_RATIO_2466_LEN           (10U)
#define RF_KCAL_RATIO_2466_MSK           (((1U << RF_KCAL_RATIO_2466_LEN) - 1) << RF_KCAL_RATIO_2466_POS)
#define RF_KCAL_RATIO_2466_UMSK          (~(((1U << RF_KCAL_RATIO_2466_LEN) - 1) << RF_KCAL_RATIO_2466_POS))
#define RF_ADPLL_SDM_DITHER_EN_2466      RF_ADPLL_SDM_DITHER_EN_2466
#define RF_ADPLL_SDM_DITHER_EN_2466_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2466_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2466_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2466_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2466_POS)
#define RF_ADPLL_SDM_DITHER_EN_2466_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2466_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2466_POS))

/* 0x488 : lo_config_2468 */
#define RF_LO_CONFIG_2468_OFFSET         (0x488)
#define RF_KCAL_RATIO_2468               RF_KCAL_RATIO_2468
#define RF_KCAL_RATIO_2468_POS           (0U)
#define RF_KCAL_RATIO_2468_LEN           (10U)
#define RF_KCAL_RATIO_2468_MSK           (((1U << RF_KCAL_RATIO_2468_LEN) - 1) << RF_KCAL_RATIO_2468_POS)
#define RF_KCAL_RATIO_2468_UMSK          (~(((1U << RF_KCAL_RATIO_2468_LEN) - 1) << RF_KCAL_RATIO_2468_POS))
#define RF_ADPLL_SDM_DITHER_EN_2468      RF_ADPLL_SDM_DITHER_EN_2468
#define RF_ADPLL_SDM_DITHER_EN_2468_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2468_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2468_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2468_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2468_POS)
#define RF_ADPLL_SDM_DITHER_EN_2468_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2468_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2468_POS))

/* 0x48C : lo_config_2470 */
#define RF_LO_CONFIG_2470_OFFSET         (0x48C)
#define RF_KCAL_RATIO_2470               RF_KCAL_RATIO_2470
#define RF_KCAL_RATIO_2470_POS           (0U)
#define RF_KCAL_RATIO_2470_LEN           (10U)
#define RF_KCAL_RATIO_2470_MSK           (((1U << RF_KCAL_RATIO_2470_LEN) - 1) << RF_KCAL_RATIO_2470_POS)
#define RF_KCAL_RATIO_2470_UMSK          (~(((1U << RF_KCAL_RATIO_2470_LEN) - 1) << RF_KCAL_RATIO_2470_POS))
#define RF_ADPLL_SDM_DITHER_EN_2470      RF_ADPLL_SDM_DITHER_EN_2470
#define RF_ADPLL_SDM_DITHER_EN_2470_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2470_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2470_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2470_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2470_POS)
#define RF_ADPLL_SDM_DITHER_EN_2470_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2470_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2470_POS))

/* 0x490 : lo_config_2472 */
#define RF_LO_CONFIG_2472_OFFSET         (0x490)
#define RF_KCAL_RATIO_2472               RF_KCAL_RATIO_2472
#define RF_KCAL_RATIO_2472_POS           (0U)
#define RF_KCAL_RATIO_2472_LEN           (10U)
#define RF_KCAL_RATIO_2472_MSK           (((1U << RF_KCAL_RATIO_2472_LEN) - 1) << RF_KCAL_RATIO_2472_POS)
#define RF_KCAL_RATIO_2472_UMSK          (~(((1U << RF_KCAL_RATIO_2472_LEN) - 1) << RF_KCAL_RATIO_2472_POS))
#define RF_ADPLL_SDM_DITHER_EN_2472      RF_ADPLL_SDM_DITHER_EN_2472
#define RF_ADPLL_SDM_DITHER_EN_2472_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2472_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2472_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2472_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2472_POS)
#define RF_ADPLL_SDM_DITHER_EN_2472_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2472_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2472_POS))

/* 0x494 : lo_config_2474 */
#define RF_LO_CONFIG_2474_OFFSET         (0x494)
#define RF_KCAL_RATIO_2474               RF_KCAL_RATIO_2474
#define RF_KCAL_RATIO_2474_POS           (0U)
#define RF_KCAL_RATIO_2474_LEN           (10U)
#define RF_KCAL_RATIO_2474_MSK           (((1U << RF_KCAL_RATIO_2474_LEN) - 1) << RF_KCAL_RATIO_2474_POS)
#define RF_KCAL_RATIO_2474_UMSK          (~(((1U << RF_KCAL_RATIO_2474_LEN) - 1) << RF_KCAL_RATIO_2474_POS))
#define RF_ADPLL_SDM_DITHER_EN_2474      RF_ADPLL_SDM_DITHER_EN_2474
#define RF_ADPLL_SDM_DITHER_EN_2474_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2474_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2474_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2474_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2474_POS)
#define RF_ADPLL_SDM_DITHER_EN_2474_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2474_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2474_POS))

/* 0x498 : lo_config_2476 */
#define RF_LO_CONFIG_2476_OFFSET         (0x498)
#define RF_KCAL_RATIO_2476               RF_KCAL_RATIO_2476
#define RF_KCAL_RATIO_2476_POS           (0U)
#define RF_KCAL_RATIO_2476_LEN           (10U)
#define RF_KCAL_RATIO_2476_MSK           (((1U << RF_KCAL_RATIO_2476_LEN) - 1) << RF_KCAL_RATIO_2476_POS)
#define RF_KCAL_RATIO_2476_UMSK          (~(((1U << RF_KCAL_RATIO_2476_LEN) - 1) << RF_KCAL_RATIO_2476_POS))
#define RF_ADPLL_SDM_DITHER_EN_2476      RF_ADPLL_SDM_DITHER_EN_2476
#define RF_ADPLL_SDM_DITHER_EN_2476_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2476_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2476_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2476_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2476_POS)
#define RF_ADPLL_SDM_DITHER_EN_2476_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2476_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2476_POS))

