bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x49C : lo_config_2478 */
#define RF_LO_CONFIG_2478_OFFSET         (0x49C)
#define RF_KCAL_RATIO_2478               RF_KCAL_RATIO_2478
#define RF_KCAL_RATIO_2478_POS           (0U)
#define RF_KCAL_RATIO_2478_LEN           (10U)
#define RF_KCAL_RATIO_2478_MSK           (((1U << RF_KCAL_RATIO_2478_LEN) - 1) << RF_KCAL_RATIO_2478_POS)
#define RF_KCAL_RATIO_2478_UMSK          (~(((1U << RF_KCAL_RATIO_2478_LEN) - 1) << RF_KCAL_RATIO_2478_POS))
#define RF_ADPLL_SDM_DITHER_EN_2478      RF_ADPLL_SDM_DITHER_EN_2478
#define RF_ADPLL_SDM_DITHER_EN_2478_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2478_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2478_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2478_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2478_POS)
#define RF_ADPLL_SDM_DITHER_EN_2478_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2478_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2478_POS))

/* 0x4A0 : lo_config_2480 */
#define RF_LO_CONFIG_2480_OFFSET         (0x4A0)
#define RF_KCAL_RATIO_2480               RF_KCAL_RATIO_2480
#define RF_KCAL_RATIO_2480_POS           (0U)
#define RF_KCAL_RATIO_2480_LEN           (10U)
#define RF_KCAL_RATIO_2480_MSK           (((1U << RF_KCAL_RATIO_2480_LEN) - 1) << RF_KCAL_RATIO_2480_POS)
#define RF_KCAL_RATIO_2480_UMSK          (~(((1U << RF_KCAL_RATIO_2480_LEN) - 1) << RF_KCAL_RATIO_2480_POS))
#define RF_ADPLL_SDM_DITHER_EN_2480      RF_ADPLL_SDM_DITHER_EN_2480
#define RF_ADPLL_SDM_DITHER_EN_2480_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2480_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2480_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2480_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2480_POS)
#define RF_ADPLL_SDM_DITHER_EN_2480_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2480_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2480_POS))

/* 0x4A4 : lo_config_2405 */
#define RF_LO_CONFIG_2405_OFFSET         (0x4A4)
#define RF_KCAL_RATIO_2405               RF_KCAL_RATIO_2405
#define RF_KCAL_RATIO_2405_POS           (0U)
#define RF_KCAL_RATIO_2405_LEN           (10U)
#define RF_KCAL_RATIO_2405_MSK           (((1U << RF_KCAL_RATIO_2405_LEN) - 1) << RF_KCAL_RATIO_2405_POS)
#define RF_KCAL_RATIO_2405_UMSK          (~(((1U << RF_KCAL_RATIO_2405_LEN) - 1) << RF_KCAL_RATIO_2405_POS))
#define RF_ADPLL_SDM_DITHER_EN_2405      RF_ADPLL_SDM_DITHER_EN_2405
#define RF_ADPLL_SDM_DITHER_EN_2405_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2405_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2405_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2405_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2405_POS)
#define RF_ADPLL_SDM_DITHER_EN_2405_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2405_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2405_POS))

/* 0x4A8 : lo_config_2415 */
#define RF_LO_CONFIG_2415_OFFSET         (0x4A8)
#define RF_KCAL_RATIO_2415               RF_KCAL_RATIO_2415
#define RF_KCAL_RATIO_2415_POS           (0U)
#define RF_KCAL_RATIO_2415_LEN           (10U)
#define RF_KCAL_RATIO_2415_MSK           (((1U << RF_KCAL_RATIO_2415_LEN) - 1) << RF_KCAL_RATIO_2415_POS)
#define RF_KCAL_RATIO_2415_UMSK          (~(((1U << RF_KCAL_RATIO_2415_LEN) - 1) << RF_KCAL_RATIO_2415_POS))
#define RF_ADPLL_SDM_DITHER_EN_2415      RF_ADPLL_SDM_DITHER_EN_2415
#define RF_ADPLL_SDM_DITHER_EN_2415_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2415_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2415_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2415_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2415_POS)
#define RF_ADPLL_SDM_DITHER_EN_2415_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2415_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2415_POS))

/* 0x4AC : lo_config_2425 */
#define RF_LO_CONFIG_2425_OFFSET         (0x4AC)
#define RF_KCAL_RATIO_2425               RF_KCAL_RATIO_2425
#define RF_KCAL_RATIO_2425_POS           (0U)
#define RF_KCAL_RATIO_2425_LEN           (10U)
#define RF_KCAL_RATIO_2425_MSK           (((1U << RF_KCAL_RATIO_2425_LEN) - 1) << RF_KCAL_RATIO_2425_POS)
#define RF_KCAL_RATIO_2425_UMSK          (~(((1U << RF_KCAL_RATIO_2425_LEN) - 1) << RF_KCAL_RATIO_2425_POS))
#define RF_ADPLL_SDM_DITHER_EN_2425      RF_ADPLL_SDM_DITHER_EN_2425
#define RF_ADPLL_SDM_DITHER_EN_2425_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2425_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2425_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2425_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2425_POS)
#define RF_ADPLL_SDM_DITHER_EN_2425_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2425_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2425_POS))

/* 0x4B0 : lo_config_2435 */
#define RF_LO_CONFIG_2435_OFFSET         (0x4B0)
#define RF_KCAL_RATIO_2435               RF_KCAL_RATIO_2435
#define RF_KCAL_RATIO_2435_POS           (0U)
#define RF_KCAL_RATIO_2435_LEN           (10U)
#define RF_KCAL_RATIO_2435_MSK           (((1U << RF_KCAL_RATIO_2435_LEN) - 1) << RF_KCAL_RATIO_2435_POS)
#define RF_KCAL_RATIO_2435_UMSK          (~(((1U << RF_KCAL_RATIO_2435_LEN) - 1) << RF_KCAL_RATIO_2435_POS))
#define RF_ADPLL_SDM_DITHER_EN_2435      RF_ADPLL_SDM_DITHER_EN_2435
#define RF_ADPLL_SDM_DITHER_EN_2435_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2435_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2435_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2435_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2435_POS)
#define RF_ADPLL_SDM_DITHER_EN_2435_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2435_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2435_POS))

/* 0x4B4 : lo_config_2445 */
#define RF_LO_CONFIG_2445_OFFSET         (0x4B4)
#define RF_KCAL_RATIO_2445               RF_KCAL_RATIO_2445
#define RF_KCAL_RATIO_2445_POS           (0U)
#define RF_KCAL_RATIO_2445_LEN           (10U)
#define RF_KCAL_RATIO_2445_MSK           (((1U << RF_KCAL_RATIO_2445_LEN) - 1) << RF_KCAL_RATIO_2445_POS)
#define RF_KCAL_RATIO_2445_UMSK          (~(((1U << RF_KCAL_RATIO_2445_LEN) - 1) << RF_KCAL_RATIO_2445_POS))
#define RF_ADPLL_SDM_DITHER_EN_2445      RF_ADPLL_SDM_DITHER_EN_2445
#define RF_ADPLL_SDM_DITHER_EN_2445_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2445_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2445_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2445_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2445_POS)
#define RF_ADPLL_SDM_DITHER_EN_2445_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2445_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2445_POS))

