bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x4B8 : lo_config_2455 */
#define RF_LO_CONFIG_2455_OFFSET         (0x4B8)
#define RF_KCAL_RATIO_2455               RF_KCAL_RATIO_2455
#define RF_KCAL_RATIO_2455_POS           (0U)
#define RF_KCAL_RATIO_2455_LEN           (10U)
#define RF_KCAL_RATIO_2455_MSK           (((1U << RF_KCAL_RATIO_2455_LEN) - 1) << RF_KCAL_RATIO_2455_POS)
#define RF_KCAL_RATIO_2455_UMSK          (~(((1U << RF_KCAL_RATIO_2455_LEN) - 1) << RF_KCAL_RATIO_2455_POS))
#define RF_ADPLL_SDM_DITHER_EN_2455      RF_ADPLL_SDM_DITHER_EN_2455
#define RF_ADPLL_SDM_DITHER_EN_2455_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2455_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2455_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2455_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2455_POS)
#define RF_ADPLL_SDM_DITHER_EN_2455_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2455_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2455_POS))

/* 0x4BC : lo_config_2465 */
#define RF_LO_CONFIG_2465_OFFSET         (0x4BC)
#define RF_KCAL_RATIO_2465               RF_KCAL_RATIO_2465
#define RF_KCAL_RATIO_2465_POS           (0U)
#define RF_KCAL_RATIO_2465_LEN           (10U)
#define RF_KCAL_RATIO_2465_MSK           (((1U << RF_KCAL_RATIO_2465_LEN) - 1) << RF_KCAL_RATIO_2465_POS)
#define RF_KCAL_RATIO_2465_UMSK          (~(((1U << RF_KCAL_RATIO_2465_LEN) - 1) << RF_KCAL_RATIO_2465_POS))
#define RF_ADPLL_SDM_DITHER_EN_2465      RF_ADPLL_SDM_DITHER_EN_2465
#define RF_ADPLL_SDM_DITHER_EN_2465_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2465_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2465_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2465_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2465_POS)
#define RF_ADPLL_SDM_DITHER_EN_2465_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2465_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2465_POS))

/* 0x4C0 : lo_config_2475 */
#define RF_LO_CONFIG_2475_OFFSET         (0x4C0)
#define RF_KCAL_RATIO_2475               RF_KCAL_RATIO_2475
#define RF_KCAL_RATIO_2475_POS           (0U)
#define RF_KCAL_RATIO_2475_LEN           (10U)
#define RF_KCAL_RATIO_2475_MSK           (((1U << RF_KCAL_RATIO_2475_LEN) - 1) << RF_KCAL_RATIO_2475_POS)
#define RF_KCAL_RATIO_2475_UMSK          (~(((1U << RF_KCAL_RATIO_2475_LEN) - 1) << RF_KCAL_RATIO_2475_POS))
#define RF_ADPLL_SDM_DITHER_EN_2475      RF_ADPLL_SDM_DITHER_EN_2475
#define RF_ADPLL_SDM_DITHER_EN_2475_POS  (12U)
#define RF_ADPLL_SDM_DITHER_EN_2475_LEN  (1U)
#define RF_ADPLL_SDM_DITHER_EN_2475_MSK  (((1U << RF_ADPLL_SDM_DITHER_EN_2475_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2475_POS)
#define RF_ADPLL_SDM_DITHER_EN_2475_UMSK (~(((1U << RF_ADPLL_SDM_DITHER_EN_2475_LEN) - 1) << RF_ADPLL_SDM_DITHER_EN_2475_POS))

/* 0x500 : dg_testbus_0 */
#define RF_DG_TESTBUS_0_OFFSET (0x500)
#define RF_TESTBUS_READ        RF_TESTBUS_READ
#define RF_TESTBUS_READ_POS    (0U)
#define RF_TESTBUS_READ_LEN    (32U)
#define RF_TESTBUS_READ_MSK    (((1U << RF_TESTBUS_READ_LEN) - 1) << RF_TESTBUS_READ_POS)
#define RF_TESTBUS_READ_UMSK   (~(((1U << RF_TESTBUS_READ_LEN) - 1) << RF_TESTBUS_READ_POS))

/* 0x504 : dg_testbus_1 */
#define RF_DG_TESTBUS_1_OFFSET (0x504)
#define RF_TESTBUS_SEL         RF_TESTBUS_SEL
#define RF_TESTBUS_SEL_POS     (0U)
#define RF_TESTBUS_SEL_LEN     (4U)
#define RF_TESTBUS_SEL_MSK     (((1U << RF_TESTBUS_SEL_LEN) - 1) << RF_TESTBUS_SEL_POS)
#define RF_TESTBUS_SEL_UMSK    (~(((1U << RF_TESTBUS_SEL_LEN) - 1) << RF_TESTBUS_SEL_POS))

/* 0x508 : dg_ppud_0 */
#define RF_DG_PPUD_0_OFFSET     (0x508)
#define RF_PPUD_CNT2            RF_PPUD_CNT2
#define RF_PPUD_CNT2_POS        (16U)
#define RF_PPUD_CNT2_LEN        (9U)
#define RF_PPUD_CNT2_MSK        (((1U << RF_PPUD_CNT2_LEN) - 1) << RF_PPUD_CNT2_POS)
#define RF_PPUD_CNT2_UMSK       (~(((1U << RF_PPUD_CNT2_LEN) - 1) << RF_PPUD_CNT2_POS))
#define RF_PPUD_CNT1            RF_PPUD_CNT1
#define RF_PPUD_CNT1_POS        (25U)
#define RF_PPUD_CNT1_LEN        (5U)
#define RF_PPUD_CNT1_MSK        (((1U << RF_PPUD_CNT1_LEN) - 1) << RF_PPUD_CNT1_POS)
#define RF_PPUD_CNT1_UMSK       (~(((1U << RF_PPUD_CNT1_LEN) - 1) << RF_PPUD_CNT1_POS))
#define RF_PPUD_MANAUAL_EN      RF_PPUD_MANAUAL_EN
#define RF_PPUD_MANAUAL_EN_POS  (30U)
#define RF_PPUD_MANAUAL_EN_LEN  (1U)
#define RF_PPUD_MANAUAL_EN_MSK  (((1U << RF_PPUD_MANAUAL_EN_LEN) - 1) << RF_PPUD_MANAUAL_EN_POS)
#define RF_PPUD_MANAUAL_EN_UMSK (~(((1U << RF_PPUD_MANAUAL_EN_LEN) - 1) << RF_PPUD_MANAUAL_EN_POS))

/* 0x50C : rf_top */
#define RF_TOP_OFFSET              (0x50C)
#define RFCKG_AFIFO_ADPLL_INV      RFCKG_AFIFO_ADPLL_INV
#define RFCKG_AFIFO_ADPLL_INV_POS  (0U)
#define RFCKG_AFIFO_ADPLL_INV_LEN  (1U)
#define RFCKG_AFIFO_ADPLL_INV_MSK  (((1U << RFCKG_AFIFO_ADPLL_INV_LEN) - 1) << RFCKG_AFIFO_ADPLL_INV_POS)
#define RFCKG_AFIFO_ADPLL_INV_UMSK (~(((1U << RFCKG_AFIFO_ADPLL_INV_LEN) - 1) << RFCKG_AFIFO_ADPLL_INV_POS))
#define RFCKG_AFIFO_RXADC_INV      RFCKG_AFIFO_RXADC_INV
#define RFCKG_AFIFO_RXADC_INV_POS  (1U)
#define RFCKG_AFIFO_RXADC_INV_LEN  (1U)
#define RFCKG_AFIFO_RXADC_INV_MSK  (((1U << RFCKG_AFIFO_RXADC_INV_LEN) - 1) << RFCKG_AFIFO_RXADC_INV_POS)
#define RFCKG_AFIFO_RXADC_INV_UMSK (~(((1U << RFCKG_AFIFO_RXADC_INV_LEN) - 1) << RFCKG_AFIFO_RXADC_INV_POS))
#define RFCKG_AFIFO_TX_INV         RFCKG_AFIFO_TX_INV
#define RFCKG_AFIFO_TX_INV_POS     (2U)
#define RFCKG_AFIFO_TX_INV_LEN     (1U)
#define RFCKG_AFIFO_TX_INV_MSK     (((1U << RFCKG_AFIFO_TX_INV_LEN) - 1) << RFCKG_AFIFO_TX_INV_POS)
#define RFCKG_AFIFO_TX_INV_UMSK    (~(((1U << RFCKG_AFIFO_TX_INV_LEN) - 1) << RFCKG_AFIFO_TX_INV_POS))
#define RF_MAC_LO_TIME_OFFSET      RF_MAC_LO_TIME_OFFSET
#define RF_MAC_LO_TIME_OFFSET_POS  (16U)
#define RF_MAC_LO_TIME_OFFSET_LEN  (6U)
#define RF_MAC_LO_TIME_OFFSET_MSK  (((1U << RF_MAC_LO_TIME_OFFSET_LEN) - 1) << RF_MAC_LO_TIME_OFFSET_POS)
#define RF_MAC_LO_TIME_OFFSET_UMSK (~(((1U << RF_MAC_LO_TIME_OFFSET_LEN) - 1) << RF_MAC_LO_TIME_OFFSET_POS))
#define RF_RX_MODE_HW              RF_RX_MODE_HW
#define RF_RX_MODE_HW_POS          (22U)
#define RF_RX_MODE_HW_LEN          (2U)
#define RF_RX_MODE_HW_MSK          (((1U << RF_RX_MODE_HW_LEN) - 1) << RF_RX_MODE_HW_POS)
#define RF_RX_MODE_HW_UMSK         (~(((1U << RF_RX_MODE_HW_LEN) - 1) << RF_RX_MODE_HW_POS))
#define RF_RX_MODE_4S              RF_RX_MODE_4S
#define RF_RX_MODE_4S_POS          (24U)
#define RF_RX_MODE_4S_LEN          (2U)
#define RF_RX_MODE_4S_MSK          (((1U << RF_RX_MODE_4S_LEN) - 1) << RF_RX_MODE_4S_POS)
#define RF_RX_MODE_4S_UMSK         (~(((1U << RF_RX_MODE_4S_LEN) - 1) << RF_RX_MODE_4S_POS))
#define RF_RX_MODE_4S_EN           RF_RX_MODE_4S_EN
#define RF_RX_MODE_4S_EN_POS       (26U)
#define RF_RX_MODE_4S_EN_LEN       (1U)
#define RF_RX_MODE_4S_EN_MSK       (((1U << RF_RX_MODE_4S_EN_LEN) - 1) << RF_RX_MODE_4S_EN_POS)
#define RF_RX_MODE_4S_EN_UMSK      (~(((1U << RF_RX_MODE_4S_EN_LEN) - 1) << RF_RX_MODE_4S_EN_POS))
#define RF_RX_EN_4S                RF_RX_EN_4S
#define RF_RX_EN_4S_POS            (28U)
#define RF_RX_EN_4S_LEN            (1U)
#define RF_RX_EN_4S_MSK            (((1U << RF_RX_EN_4S_LEN) - 1) << RF_RX_EN_4S_POS)
#define RF_RX_EN_4S_UMSK           (~(((1U << RF_RX_EN_4S_LEN) - 1) << RF_RX_EN_4S_POS))
#define RF_RX_EN_SRC               RF_RX_EN_SRC
#define RF_RX_EN_SRC_POS           (29U)
#define RF_RX_EN_SRC_LEN           (1U)
#define RF_RX_EN_SRC_MSK           (((1U << RF_RX_EN_SRC_LEN) - 1) << RF_RX_EN_SRC_POS)
#define RF_RX_EN_SRC_UMSK          (~(((1U << RF_RX_EN_SRC_LEN) - 1) << RF_RX_EN_SRC_POS))
#define RF_TX_EN_4S                RF_TX_EN_4S
#define RF_TX_EN_4S_POS            (30U)
#define RF_TX_EN_4S_LEN            (1U)
#define RF_TX_EN_4S_MSK            (((1U << RF_TX_EN_4S_LEN) - 1) << RF_TX_EN_4S_POS)
#define RF_TX_EN_4S_UMSK           (~(((1U << RF_TX_EN_4S_LEN) - 1) << RF_TX_EN_4S_POS))
#define RF_TX_EN_SRC               RF_TX_EN_SRC
#define RF_TX_EN_SRC_POS           (31U)
#define RF_TX_EN_SRC_LEN           (1U)
#define RF_TX_EN_SRC_MSK           (((1U << RF_TX_EN_SRC_LEN) - 1) << RF_TX_EN_SRC_POS)
#define RF_TX_EN_SRC_UMSK          (~(((1U << RF_TX_EN_SRC_LEN) - 1) << RF_TX_EN_SRC_POS))

/* 0x510 : rf_fsm */
#define RF_FSM_OFFSET              (0x510)
#define RF_FSM_LO_TIME             RF_FSM_LO_TIME
#define RF_FSM_LO_TIME_POS         (0U)
#define RF_FSM_LO_TIME_LEN         (12U)
#define RF_FSM_LO_TIME_MSK         (((1U << RF_FSM_LO_TIME_LEN) - 1) << RF_FSM_LO_TIME_POS)
#define RF_FSM_LO_TIME_UMSK        (~(((1U << RF_FSM_LO_TIME_LEN) - 1) << RF_FSM_LO_TIME_POS))
#define RF_FSM_STATE               RF_FSM_STATE
#define RF_FSM_STATE_POS           (12U)
#define RF_FSM_STATE_LEN           (3U)
#define RF_FSM_STATE_MSK           (((1U << RF_FSM_STATE_LEN) - 1) << RF_FSM_STATE_POS)
#define RF_FSM_STATE_UMSK          (~(((1U << RF_FSM_STATE_LEN) - 1) << RF_FSM_STATE_POS))
#define RF_FSM_ST_4S               RF_FSM_ST_4S
#define RF_FSM_ST_4S_POS           (16U)
#define RF_FSM_ST_4S_LEN           (3U)
#define RF_FSM_ST_4S_MSK           (((1U << RF_FSM_ST_4S_LEN) - 1) << RF_FSM_ST_4S_POS)
#define RF_FSM_ST_4S_UMSK          (~(((1U << RF_FSM_ST_4S_LEN) - 1) << RF_FSM_ST_4S_POS))
#define RF_FSM_ST_4S_EN            RF_FSM_ST_4S_EN
#define RF_FSM_ST_4S_EN_POS        (20U)
#define RF_FSM_ST_4S_EN_LEN        (1U)
#define RF_FSM_ST_4S_EN_MSK        (((1U << RF_FSM_ST_4S_EN_LEN) - 1) << RF_FSM_ST_4S_EN_POS)
#define RF_FSM_ST_4S_EN_UMSK       (~(((1U << RF_FSM_ST_4S_EN_LEN) - 1) << RF_FSM_ST_4S_EN_POS))
#define RF_FSM_EN                  RF_FSM_EN
#define RF_FSM_EN_POS              (21U)
#define RF_FSM_EN_LEN              (1U)
#define RF_FSM_EN_MSK              (((1U << RF_FSM_EN_LEN) - 1) << RF_FSM_EN_POS)
#define RF_FSM_EN_UMSK             (~(((1U << RF_FSM_EN_LEN) - 1) << RF_FSM_EN_POS))
#define RF_FSM_RX_AFIFO_4S         RF_FSM_RX_AFIFO_4S
#define RF_FSM_RX_AFIFO_4S_POS     (22U)
#define RF_FSM_RX_AFIFO_4S_LEN     (1U)
#define RF_FSM_RX_AFIFO_4S_MSK     (((1U << RF_FSM_RX_AFIFO_4S_LEN) - 1) << RF_FSM_RX_AFIFO_4S_POS)
#define RF_FSM_RX_AFIFO_4S_UMSK    (~(((1U << RF_FSM_RX_AFIFO_4S_LEN) - 1) << RF_FSM_RX_AFIFO_4S_POS))
#define RF_FSM_RX_AFIFO_4S_EN      RF_FSM_RX_AFIFO_4S_EN
#define RF_FSM_RX_AFIFO_4S_EN_POS  (23U)
#define RF_FSM_RX_AFIFO_4S_EN_LEN  (1U)
#define RF_FSM_RX_AFIFO_4S_EN_MSK  (((1U << RF_FSM_RX_AFIFO_4S_EN_LEN) - 1) << RF_FSM_RX_AFIFO_4S_EN_POS)
#define RF_FSM_RX_AFIFO_4S_EN_UMSK (~(((1U << RF_FSM_RX_AFIFO_4S_EN_LEN) - 1) << RF_FSM_RX_AFIFO_4S_EN_POS))
#define RF_FSM_TX_AFIFO_4S         RF_FSM_TX_AFIFO_4S
#define RF_FSM_TX_AFIFO_4S_POS     (24U)
#define RF_FSM_TX_AFIFO_4S_LEN     (1U)
#define RF_FSM_TX_AFIFO_4S_MSK     (((1U << RF_FSM_TX_AFIFO_4S_LEN) - 1) << RF_FSM_TX_AFIFO_4S_POS)
#define RF_FSM_TX_AFIFO_4S_UMSK    (~(((1U << RF_FSM_TX_AFIFO_4S_LEN) - 1) << RF_FSM_TX_AFIFO_4S_POS))
#define RF_FSM_TX_AFIFO_4S_EN      RF_FSM_TX_AFIFO_4S_EN
#define RF_FSM_TX_AFIFO_4S_EN_POS  (25U)
#define RF_FSM_TX_AFIFO_4S_EN_LEN  (1U)
#define RF_FSM_TX_AFIFO_4S_EN_MSK  (((1U << RF_FSM_TX_AFIFO_4S_EN_LEN) - 1) << RF_FSM_TX_AFIFO_4S_EN_POS)
#define RF_FSM_TX_AFIFO_4S_EN_UMSK (~(((1U << RF_FSM_TX_AFIFO_4S_EN_LEN) - 1) << RF_FSM_TX_AFIFO_4S_EN_POS))
#define RF_FSM_AFIFO_DLY_TIME      RF_FSM_AFIFO_DLY_TIME
#define RF_FSM_AFIFO_DLY_TIME_POS  (26U)
#define RF_FSM_AFIFO_DLY_TIME_LEN  (6U)
#define RF_FSM_AFIFO_DLY_TIME_MSK  (((1U << RF_FSM_AFIFO_DLY_TIME_LEN) - 1) << RF_FSM_AFIFO_DLY_TIME_POS)
#define RF_FSM_AFIFO_DLY_TIME_UMSK (~(((1U << RF_FSM_AFIFO_DLY_TIME_LEN) - 1) << RF_FSM_AFIFO_DLY_TIME_POS))

