bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
/* 0x528 : rf_sram_ctrl0 */
#define RF_SRAM_CTRL0_OFFSET  (0x528)
#define RF_SRAM_DONE          RF_SRAM_DONE
#define RF_SRAM_DONE_POS      (0U)
#define RF_SRAM_DONE_LEN      (1U)
#define RF_SRAM_DONE_MSK      (((1U << RF_SRAM_DONE_LEN) - 1) << RF_SRAM_DONE_POS)
#define RF_SRAM_DONE_UMSK     (~(((1U << RF_SRAM_DONE_LEN) - 1) << RF_SRAM_DONE_POS))
#define RF_SRAM_EN            RF_SRAM_EN
#define RF_SRAM_EN_POS        (1U)
#define RF_SRAM_EN_LEN        (1U)
#define RF_SRAM_EN_MSK        (((1U << RF_SRAM_EN_LEN) - 1) << RF_SRAM_EN_POS)
#define RF_SRAM_EN_UMSK       (~(((1U << RF_SRAM_EN_LEN) - 1) << RF_SRAM_EN_POS))
#define RF_SRAM_LOOP_EN       RF_SRAM_LOOP_EN
#define RF_SRAM_LOOP_EN_POS   (2U)
#define RF_SRAM_LOOP_EN_LEN   (1U)
#define RF_SRAM_LOOP_EN_MSK   (((1U << RF_SRAM_LOOP_EN_LEN) - 1) << RF_SRAM_LOOP_EN_POS)
#define RF_SRAM_LOOP_EN_UMSK  (~(((1U << RF_SRAM_LOOP_EN_LEN) - 1) << RF_SRAM_LOOP_EN_POS))
#define RF_SRAM_STS_CLR       RF_SRAM_STS_CLR
#define RF_SRAM_STS_CLR_POS   (3U)
#define RF_SRAM_STS_CLR_LEN   (1U)
#define RF_SRAM_STS_CLR_MSK   (((1U << RF_SRAM_STS_CLR_LEN) - 1) << RF_SRAM_STS_CLR_POS)
#define RF_SRAM_STS_CLR_UMSK  (~(((1U << RF_SRAM_STS_CLR_LEN) - 1) << RF_SRAM_STS_CLR_POS))
#define RF_SRAM_MODE          RF_SRAM_MODE
#define RF_SRAM_MODE_POS      (4U)
#define RF_SRAM_MODE_LEN      (2U)
#define RF_SRAM_MODE_MSK      (((1U << RF_SRAM_MODE_LEN) - 1) << RF_SRAM_MODE_POS)
#define RF_SRAM_MODE_UMSK     (~(((1U << RF_SRAM_MODE_LEN) - 1) << RF_SRAM_MODE_POS))
#define RF_SRAM_DONE_CNT      RF_SRAM_DONE_CNT
#define RF_SRAM_DONE_CNT_POS  (16U)
#define RF_SRAM_DONE_CNT_LEN  (16U)
#define RF_SRAM_DONE_CNT_MSK  (((1U << RF_SRAM_DONE_CNT_LEN) - 1) << RF_SRAM_DONE_CNT_POS)
#define RF_SRAM_DONE_CNT_UMSK (~(((1U << RF_SRAM_DONE_CNT_LEN) - 1) << RF_SRAM_DONE_CNT_POS))

/* 0x52C : rf_sram_ctrl1 */
#define RF_SRAM_CTRL1_OFFSET    (0x52C)
#define RF_SRAM_ADDR_END        RF_SRAM_ADDR_END
#define RF_SRAM_ADDR_END_POS    (0U)
#define RF_SRAM_ADDR_END_LEN    (16U)
#define RF_SRAM_ADDR_END_MSK    (((1U << RF_SRAM_ADDR_END_LEN) - 1) << RF_SRAM_ADDR_END_POS)
#define RF_SRAM_ADDR_END_UMSK   (~(((1U << RF_SRAM_ADDR_END_LEN) - 1) << RF_SRAM_ADDR_END_POS))
#define RF_SRAM_ADDR_START      RF_SRAM_ADDR_START
#define RF_SRAM_ADDR_START_POS  (16U)
#define RF_SRAM_ADDR_START_LEN  (16U)
#define RF_SRAM_ADDR_START_MSK  (((1U << RF_SRAM_ADDR_START_LEN) - 1) << RF_SRAM_ADDR_START_POS)
#define RF_SRAM_ADDR_START_UMSK (~(((1U << RF_SRAM_ADDR_START_LEN) - 1) << RF_SRAM_ADDR_START_POS))

/* 0x530 : rf_sram_ctrl2 */
#define RF_SRAM_CTRL2_OFFSET (0x530)
#define RF_SRAM_STS          RF_SRAM_STS
#define RF_SRAM_STS_POS      (0U)
#define RF_SRAM_STS_LEN      (32U)
#define RF_SRAM_STS_MSK      (((1U << RF_SRAM_STS_LEN) - 1) << RF_SRAM_STS_POS)
#define RF_SRAM_STS_UMSK     (~(((1U << RF_SRAM_STS_LEN) - 1) << RF_SRAM_STS_POS))

/* 0x534 : rf_test_mode */
#define RF_TEST_MODE_OFFSET       (0x534)
#define RF_DACOUT_HW              RF_DACOUT_HW
#define RF_DACOUT_HW_POS          (0U)
#define RF_DACOUT_HW_LEN          (12U)
#define RF_DACOUT_HW_MSK          (((1U << RF_DACOUT_HW_LEN) - 1) << RF_DACOUT_HW_POS)
#define RF_DACOUT_HW_UMSK         (~(((1U << RF_DACOUT_HW_LEN) - 1) << RF_DACOUT_HW_POS))
#define RF_DACOUT_4S              RF_DACOUT_4S
#define RF_DACOUT_4S_POS          (16U)
#define RF_DACOUT_4S_LEN          (12U)
#define RF_DACOUT_4S_MSK          (((1U << RF_DACOUT_4S_LEN) - 1) << RF_DACOUT_4S_POS)
#define RF_DACOUT_4S_UMSK         (~(((1U << RF_DACOUT_4S_LEN) - 1) << RF_DACOUT_4S_POS))
#define RF_DACOUT_4S_EN           RF_DACOUT_4S_EN
#define RF_DACOUT_4S_EN_POS       (28U)
#define RF_DACOUT_4S_EN_LEN       (1U)
#define RF_DACOUT_4S_EN_MSK       (((1U << RF_DACOUT_4S_EN_LEN) - 1) << RF_DACOUT_4S_EN_POS)
#define RF_DACOUT_4S_EN_UMSK      (~(((1U << RF_DACOUT_4S_EN_LEN) - 1) << RF_DACOUT_4S_EN_POS))
#define RF_DACOUT_4S_SRAM_EN      RF_DACOUT_4S_SRAM_EN
#define RF_DACOUT_4S_SRAM_EN_POS  (29U)
#define RF_DACOUT_4S_SRAM_EN_LEN  (1U)
#define RF_DACOUT_4S_SRAM_EN_MSK  (((1U << RF_DACOUT_4S_SRAM_EN_LEN) - 1) << RF_DACOUT_4S_SRAM_EN_POS)
#define RF_DACOUT_4S_SRAM_EN_UMSK (~(((1U << RF_DACOUT_4S_SRAM_EN_LEN) - 1) << RF_DACOUT_4S_SRAM_EN_POS))
#define RF_TEST_MODE_EN           RF_TEST_MODE_EN
#define RF_TEST_MODE_EN_POS       (30U)
#define RF_TEST_MODE_EN_LEN       (1U)
#define RF_TEST_MODE_EN_MSK       (((1U << RF_TEST_MODE_EN_LEN) - 1) << RF_TEST_MODE_EN_POS)
#define RF_TEST_MODE_EN_UMSK      (~(((1U << RF_TEST_MODE_EN_LEN) - 1) << RF_TEST_MODE_EN_POS))

/* 0x538 : rf_rx_pulse_filter */
#define RF_RX_PULSE_FILTER_OFFSET (0x538)
#define RF_PF_TH2                 RF_PF_TH2
#define RF_PF_TH2_POS             (0U)
#define RF_PF_TH2_LEN             (9U)
#define RF_PF_TH2_MSK             (((1U << RF_PF_TH2_LEN) - 1) << RF_PF_TH2_POS)
#define RF_PF_TH2_UMSK            (~(((1U << RF_PF_TH2_LEN) - 1) << RF_PF_TH2_POS))
#define RF_PF_TH1                 RF_PF_TH1
#define RF_PF_TH1_POS             (10U)
#define RF_PF_TH1_LEN             (9U)
#define RF_PF_TH1_MSK             (((1U << RF_PF_TH1_LEN) - 1) << RF_PF_TH1_POS)
#define RF_PF_TH1_UMSK            (~(((1U << RF_PF_TH1_LEN) - 1) << RF_PF_TH1_POS))
#define RF_PF_EN_Q                RF_PF_EN_Q
#define RF_PF_EN_Q_POS            (20U)
#define RF_PF_EN_Q_LEN            (1U)
#define RF_PF_EN_Q_MSK            (((1U << RF_PF_EN_Q_LEN) - 1) << RF_PF_EN_Q_POS)
#define RF_PF_EN_Q_UMSK           (~(((1U << RF_PF_EN_Q_LEN) - 1) << RF_PF_EN_Q_POS))
#define RF_PF_EN_I                RF_PF_EN_I
#define RF_PF_EN_I_POS            (21U)
#define RF_PF_EN_I_LEN            (1U)
#define RF_PF_EN_I_MSK            (((1U << RF_PF_EN_I_LEN) - 1) << RF_PF_EN_I_POS)
#define RF_PF_EN_I_UMSK           (~(((1U << RF_PF_EN_I_LEN) - 1) << RF_PF_EN_I_POS))

struct rf_reg {
    /* 0x0 : Silicon revision */
    union {
        struct
        {
            uint32_t rf_rev         : 8; /* [ 7: 0],          r,        0x7 */
            uint32_t fw_rev         : 8; /* [15: 8],          r,        0x0 */
            uint32_t hw_rev         : 8; /* [23:16],          r,        0x7 */
            uint32_t reserved_24_31 : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_rev;

