bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x4 : dsp_readback */
    union {
        struct
        {
            uint32_t reserved_0_1       : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t ch_ind_hw          : 7; /* [ 8: 2],          r,        0x0 */
            uint32_t rbb_ind_hw         : 5; /* [13: 9],          r,        0x0 */
            uint32_t rbb_bw_ind_hw      : 1; /* [   14],          r,        0x0 */
            uint32_t reserved_15        : 1; /* [   15],       rsvd,        0x0 */
            uint32_t ch_ind             : 7; /* [22:16],        r/w,        0x0 */
            uint32_t ch_ind_ctrl_hw     : 1; /* [   23],        r/w,        0x1 */
            uint32_t rbb_ind            : 5; /* [28:24],        r/w,        0x0 */
            uint32_t rbb_ind_ctrl_hw    : 1; /* [   29],        r/w,        0x1 */
            uint32_t rbb_bw_ind         : 1; /* [   30],        r/w,        0x0 */
            uint32_t rbb_bw_ind_ctrl_hw : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } dsp_readback;

    /* 0x8 : Control logic switch */
    union {
        struct
        {
            uint32_t pu_ctrl_hw          : 1; /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_2        : 2; /* [ 2: 1],       rsvd,        0x0 */
            uint32_t gain_ctrl_tx_hw     : 1; /* [    3],        r/w,        0x1 */
            uint32_t gain_ctrl_rx_hw     : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rosdac_ctrl_hw      : 1; /* [    8],        r/w,        0x1 */
            uint32_t rosdac_ctrl_rccal   : 1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11      : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t kcal_ratio_ctrl_hw  : 1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t rbb_bw_ctrl_hw      : 1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_19      : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t lo_fcw_ctrl_hw      : 1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t inc_fcal_en_ctrl_hw : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_27      : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t vco_idac_ctrl_hw    : 1; /* [   28],        r/w,        0x1 */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_ctrl_source;

    /* 0xC : rf calibration state enable in full cal list */
    union {
        struct
        {
            uint32_t fcal_state_en       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t acal_state_en       : 1;  /* [    1],        r/w,        0x1 */
            uint32_t kcal_state_en       : 1;  /* [    2],        r/w,        0x1 */
            uint32_t roscal_state_en     : 1;  /* [    3],        r/w,        0x1 */
            uint32_t rccal_state_en      : 1;  /* [    4],        r/w,        0x1 */
            uint32_t inc_fcal_state_en   : 1;  /* [    5],        r/w,        0x1 */
            uint32_t inc_acal_state_en   : 1;  /* [    6],        r/w,        0x1 */
            uint32_t inc_roscal_state_en : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_31       : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_cal_state_ctrl;

    /* 0x10 : Calibration mode register */
    union {
        struct
        {
            uint32_t acal_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3   : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t kcal_en        : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7   : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rccal_en       : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11  : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t inc_acal_en    : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t inc_fcal_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t inc_fcal_en_hw : 1;  /* [   17],          r,        0x0 */
            uint32_t reserved_18_31 : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_cal_switch_ctrl;

    /* 0x14 : rf_cal_status */
    union {
        struct
        {
            uint32_t reserved_0_1          : 2;  /* [ 1: 0],       rsvd,        0x0 */
            uint32_t acal_status           : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t kcal_status           : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t roscal_status         : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t rccal_status          : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_29        : 20; /* [29:10],       rsvd,        0x0 */
            uint32_t dl_rfcal_table_status : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_cal_status;

    /* 0x18 : pu_delay_confg */
    union {
        struct
        {
            uint32_t ppu_lead          : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3      : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t pud_delay         : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_11     : 6;  /* [11: 6],       rsvd,        0x0 */
            uint32_t lo_reset_delay    : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14_15    : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t lo_reset_width    : 2;  /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19    : 2;  /* [19:18],       rsvd,        0x0 */
            uint32_t adpll_reset_width : 2;  /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_31    : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pu_delay_confg;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[228];

    /* 0x100 : Register control of power up signals */
    union {
        struct
        {
            uint32_t lodist_tx_en        : 1; /* [    0],        r/w,        0x0 */
            uint32_t pu_txbuf            : 1; /* [    1],        r/w,        0x0 */
            uint32_t pu_rxbuf            : 1; /* [    2],        r/w,        0x0 */
            uint32_t pu_dtc              : 1; /* [    3],        r/w,        0x0 */
            uint32_t pu_adpll_sfreg      : 1; /* [    4],        r/w,        0x0 */
            uint32_t pu_adpll_adc        : 1; /* [    5],        r/w,        0x0 */
            uint32_t adpll_clk_en        : 1; /* [    6],        r/w,        0x0 */
            uint32_t lotpm_hfp_bypass    : 1; /* [    7],        r/w,        0x1 */
            uint32_t lotpm_lfp_bypass    : 1; /* [    8],        r/w,        0x1 */
            uint32_t lotpm_hfp_clk_en    : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_fbdv_buf         : 1; /* [   10],        r/w,        0x0 */
            uint32_t pu_fbdv             : 1; /* [   11],        r/w,        0x0 */
            uint32_t pu_vco              : 1; /* [   12],        r/w,        0x0 */
            uint32_t pu_vco_ldo          : 1; /* [   13],        r/w,        0x0 */
            uint32_t pu_lodist_body_bias : 1; /* [   14],        r/w,        0x0 */
            uint32_t rxadc_clk_en        : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_rxadc            : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_rosdac           : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_rbb_pkdet        : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_rbb              : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_rmx              : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_lna              : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pa               : 1; /* [   22],        r/w,        0x0 */
            uint32_t rx_bypass_en        : 1; /* [   23],        r/w,        0x1 */
            uint32_t pa_seri_cap_en      : 1; /* [   24],        r/w,        0x1 */
            uint32_t rst_adpll           : 1; /* [   25],        r/w,        0x0 */
            uint32_t rst_lotpm_hfp       : 1; /* [   26],        r/w,        0x0 */
            uint32_t rst_fbdv            : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31      : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_reg;

    /* 0x104 : Power up setting in SB state */
    union {
        struct
        {
            uint32_t lodist_tx_en_sb        : 1; /* [    0],        r/w,        0x0 */
            uint32_t pu_txbuf_sb            : 1; /* [    1],        r/w,        0x0 */
            uint32_t pu_rxbuf_sb            : 1; /* [    2],        r/w,        0x0 */
            uint32_t pu_dtc_sb              : 1; /* [    3],        r/w,        0x0 */
            uint32_t pu_adpll_sfreg_sb      : 1; /* [    4],        r/w,        0x0 */
            uint32_t pu_adpll_adc_sb        : 1; /* [    5],        r/w,        0x0 */
            uint32_t adpll_clk_en_sb        : 1; /* [    6],        r/w,        0x0 */
            uint32_t lotpm_hfp_bypass_sb    : 1; /* [    7],        r/w,        0x1 */
            uint32_t lotpm_lfp_bypass_sb    : 1; /* [    8],        r/w,        0x1 */
            uint32_t lotpm_hfp_clk_en_sb    : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_fbdv_buf_sb         : 1; /* [   10],        r/w,        0x0 */
            uint32_t pu_fbdv_sb             : 1; /* [   11],        r/w,        0x0 */
            uint32_t pu_vco_sb              : 1; /* [   12],        r/w,        0x0 */
            uint32_t pu_vco_ldo_sb          : 1; /* [   13],        r/w,        0x0 */
            uint32_t pu_lodist_body_bias_sb : 1; /* [   14],        r/w,        0x0 */
            uint32_t rxadc_clk_en_sb        : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_rxadc_sb            : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_rosdac_sb           : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_rbb_pkdet_sb        : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_rbb_sb              : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_rmx_sb              : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_lna_sb              : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pa_sb               : 1; /* [   22],        r/w,        0x0 */
            uint32_t rx_bypass_en_sb        : 1; /* [   23],        r/w,        0x1 */
            uint32_t pa_seri_cap_en_sb      : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31         : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_sb;

    /* 0x108 : Power up in LOTX state */
    union {
        struct
        {
            uint32_t lodist_tx_en_lotx        : 1; /* [    0],        r/w,        0x1 */
            uint32_t pu_txbuf_lotx            : 1; /* [    1],        r/w,        0x1 */
            uint32_t pu_rxbuf_lotx            : 1; /* [    2],        r/w,        0x0 */
            uint32_t pu_dtc_lotx              : 1; /* [    3],        r/w,        0x1 */
            uint32_t pu_adpll_sfreg_lotx      : 1; /* [    4],        r/w,        0x1 */
            uint32_t pu_adpll_adc_lotx        : 1; /* [    5],        r/w,        0x1 */
            uint32_t adpll_clk_en_lotx        : 1; /* [    6],        r/w,        0x1 */
            uint32_t lotpm_hfp_bypass_lotx    : 1; /* [    7],        r/w,        0x1 */
            uint32_t lotpm_lfp_bypass_lotx    : 1; /* [    8],        r/w,        0x1 */
            uint32_t lotpm_hfp_clk_en_lotx    : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_fbdv_buf_lotx         : 1; /* [   10],        r/w,        0x1 */
            uint32_t pu_fbdv_lotx             : 1; /* [   11],        r/w,        0x1 */
            uint32_t pu_vco_lotx              : 1; /* [   12],        r/w,        0x1 */
            uint32_t pu_vco_ldo_lotx          : 1; /* [   13],        r/w,        0x1 */
            uint32_t pu_lodist_body_bias_lotx : 1; /* [   14],        r/w,        0x1 */
            uint32_t rxadc_clk_en_lotx        : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_rxadc_lotx            : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_rosdac_lotx           : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_rbb_pkdet_lotx        : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_rbb_lotx              : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_rmx_lotx              : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_lna_lotx              : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pa_lotx               : 1; /* [   22],        r/w,        0x0 */
            uint32_t rx_bypass_en_lotx        : 1; /* [   23],        r/w,        0x1 */
            uint32_t pa_seri_cap_en_lotx      : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31           : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_lotx;

    /* 0x10C : Power up in LORX state */
    union {
        struct
        {
            uint32_t lodist_tx_en_lorx        : 1; /* [    0],        r/w,        0x0 */
            uint32_t pu_txbuf_lorx            : 1; /* [    1],        r/w,        0x0 */
            uint32_t pu_rxbuf_lorx            : 1; /* [    2],        r/w,        0x1 */
            uint32_t pu_dtc_lorx              : 1; /* [    3],        r/w,        0x1 */
            uint32_t pu_adpll_sfreg_lorx      : 1; /* [    4],        r/w,        0x1 */
            uint32_t pu_adpll_adc_lorx        : 1; /* [    5],        r/w,        0x1 */
            uint32_t adpll_clk_en_lorx        : 1; /* [    6],        r/w,        0x1 */
            uint32_t lotpm_hfp_bypass_lorx    : 1; /* [    7],        r/w,        0x1 */
            uint32_t lotpm_lfp_bypass_lorx    : 1; /* [    8],        r/w,        0x1 */
            uint32_t lotpm_hfp_clk_en_lorx    : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_fbdv_buf_lorx         : 1; /* [   10],        r/w,        0x1 */
            uint32_t pu_fbdv_lorx             : 1; /* [   11],        r/w,        0x1 */
            uint32_t pu_vco_lorx              : 1; /* [   12],        r/w,        0x1 */
            uint32_t pu_vco_ldo_lorx          : 1; /* [   13],        r/w,        0x1 */
            uint32_t pu_lodist_body_bias_lorx : 1; /* [   14],        r/w,        0x1 */
            uint32_t rxadc_clk_en_lorx        : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_rxadc_lorx            : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_rosdac_lorx           : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_rbb_pkdet_lorx        : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_rbb_lorx              : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_rmx_lorx              : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_lna_lorx              : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pa_lorx               : 1; /* [   22],        r/w,        0x0 */
            uint32_t rx_bypass_en_lorx        : 1; /* [   23],        r/w,        0x1 */
            uint32_t pa_seri_cap_en_lorx      : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31           : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_lorx;

    /* 0x110 : Power up in TX state */
    union {
        struct
        {
            uint32_t lodist_tx_en_tx        : 1; /* [    0],        r/w,        0x1 */
            uint32_t pu_txbuf_tx            : 1; /* [    1],        r/w,        0x1 */
            uint32_t pu_rxbuf_tx            : 1; /* [    2],        r/w,        0x0 */
            uint32_t pu_dtc_tx              : 1; /* [    3],        r/w,        0x1 */
            uint32_t pu_adpll_sfreg_tx      : 1; /* [    4],        r/w,        0x1 */
            uint32_t pu_adpll_adc_tx        : 1; /* [    5],        r/w,        0x1 */
            uint32_t adpll_clk_en_tx        : 1; /* [    6],        r/w,        0x1 */
            uint32_t lotpm_hfp_bypass_tx    : 1; /* [    7],        r/w,        0x0 */
            uint32_t lotpm_lfp_bypass_tx    : 1; /* [    8],        r/w,        0x0 */
            uint32_t lotpm_hfp_clk_en_tx    : 1; /* [    9],        r/w,        0x1 */
            uint32_t pu_fbdv_buf_tx         : 1; /* [   10],        r/w,        0x1 */
            uint32_t pu_fbdv_tx             : 1; /* [   11],        r/w,        0x1 */
            uint32_t pu_vco_tx              : 1; /* [   12],        r/w,        0x1 */
            uint32_t pu_vco_ldo_tx          : 1; /* [   13],        r/w,        0x1 */
            uint32_t pu_lodist_body_bias_tx : 1; /* [   14],        r/w,        0x1 */
            uint32_t rxadc_clk_en_tx        : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_rxadc_tx            : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_rosdac_tx           : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_rbb_pkdet_tx        : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_rbb_tx              : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_rmx_tx              : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_lna_tx              : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pa_tx               : 1; /* [   22],        r/w,        0x1 */
            uint32_t rx_bypass_en_tx        : 1; /* [   23],        r/w,        0x1 */
            uint32_t pa_seri_cap_en_tx      : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31         : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_tx;

