bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x114 : Power up in RX state */
    union {
        struct
        {
            uint32_t lodist_tx_en_rx        : 1; /* [    0],        r/w,        0x0 */
            uint32_t pu_txbuf_rx            : 1; /* [    1],        r/w,        0x0 */
            uint32_t pu_rxbuf_rx            : 1; /* [    2],        r/w,        0x1 */
            uint32_t pu_dtc_rx              : 1; /* [    3],        r/w,        0x1 */
            uint32_t pu_adpll_sfreg_rx      : 1; /* [    4],        r/w,        0x1 */
            uint32_t pu_adpll_adc_rx        : 1; /* [    5],        r/w,        0x1 */
            uint32_t adpll_clk_en_rx        : 1; /* [    6],        r/w,        0x1 */
            uint32_t lotpm_hfp_bypass_rx    : 1; /* [    7],        r/w,        0x1 */
            uint32_t lotpm_lfp_bypass_rx    : 1; /* [    8],        r/w,        0x1 */
            uint32_t lotpm_hfp_clk_en_rx    : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_fbdv_buf_rx         : 1; /* [   10],        r/w,        0x1 */
            uint32_t pu_fbdv_rx             : 1; /* [   11],        r/w,        0x1 */
            uint32_t pu_vco_rx              : 1; /* [   12],        r/w,        0x1 */
            uint32_t pu_vco_ldo_rx          : 1; /* [   13],        r/w,        0x1 */
            uint32_t pu_lodist_body_bias_rx : 1; /* [   14],        r/w,        0x1 */
            uint32_t rxadc_clk_en_rx        : 1; /* [   15],        r/w,        0x1 */
            uint32_t pu_rxadc_rx            : 1; /* [   16],        r/w,        0x1 */
            uint32_t pu_rosdac_rx           : 1; /* [   17],        r/w,        0x1 */
            uint32_t pu_rbb_pkdet_rx        : 1; /* [   18],        r/w,        0x1 */
            uint32_t pu_rbb_rx              : 1; /* [   19],        r/w,        0x1 */
            uint32_t pu_rmx_rx              : 1; /* [   20],        r/w,        0x1 */
            uint32_t pu_lna_rx              : 1; /* [   21],        r/w,        0x1 */
            uint32_t pu_pa_rx               : 1; /* [   22],        r/w,        0x0 */
            uint32_t rx_bypass_en_rx        : 1; /* [   23],        r/w,        0x0 */
            uint32_t pa_seri_cap_en_rx      : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31         : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_rx;

    /* 0x118 : Hardware read back of power up signals */
    union {
        struct
        {
            uint32_t lodist_tx_en_hw        : 1; /* [    0],          r,        0x0 */
            uint32_t pu_txbuf_hw            : 1; /* [    1],          r,        0x0 */
            uint32_t pu_rxbuf_hw            : 1; /* [    2],          r,        0x0 */
            uint32_t pu_dtc_hw              : 1; /* [    3],          r,        0x0 */
            uint32_t pu_adpll_sfreg_hw      : 1; /* [    4],          r,        0x0 */
            uint32_t pu_adpll_adc_hw        : 1; /* [    5],          r,        0x0 */
            uint32_t adpll_clk_en_hw        : 1; /* [    6],          r,        0x0 */
            uint32_t lotpm_hfp_bypass_hw    : 1; /* [    7],          r,        0x0 */
            uint32_t lotpm_lfp_bypass_hw    : 1; /* [    8],          r,        0x0 */
            uint32_t lotpm_hfp_clk_en_hw    : 1; /* [    9],          r,        0x0 */
            uint32_t pu_fbdv_buf_hw         : 1; /* [   10],          r,        0x0 */
            uint32_t pu_fbdv_hw             : 1; /* [   11],          r,        0x0 */
            uint32_t pu_vco_hw              : 1; /* [   12],          r,        0x0 */
            uint32_t pu_vco_ldo_hw          : 1; /* [   13],          r,        0x0 */
            uint32_t pu_lodist_body_bias_hw : 1; /* [   14],          r,        0x0 */
            uint32_t rxadc_clk_en_hw        : 1; /* [   15],          r,        0x0 */
            uint32_t pu_rxadc_hw            : 1; /* [   16],          r,        0x0 */
            uint32_t pu_rosdac_hw           : 1; /* [   17],          r,        0x0 */
            uint32_t pu_rbb_pkdet_hw        : 1; /* [   18],          r,        0x0 */
            uint32_t pu_rbb_hw              : 1; /* [   19],          r,        0x0 */
            uint32_t pu_rmx_hw              : 1; /* [   20],          r,        0x0 */
            uint32_t pu_lna_hw              : 1; /* [   21],          r,        0x0 */
            uint32_t pu_pa_hw               : 1; /* [   22],          r,        0x0 */
            uint32_t rx_bypass_en_hw        : 1; /* [   23],          r,        0x1 */
            uint32_t pa_seri_cap_en_hw      : 1; /* [   24],          r,        0x1 */
            uint32_t rst_adpll_hw           : 1; /* [   25],          r,        0x0 */
            uint32_t rst_lotpm_hfp_hw       : 1; /* [   26],          r,        0x0 */
            uint32_t rst_fbdv_hw            : 1; /* [   27],          r,        0x0 */
            uint32_t reserved_28_31         : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr_hw;

    /* 0x11C : non_reg_readback */
    union {
        struct
        {
            uint32_t reserved_0_4            : 5;  /* [ 4: 0],       rsvd,        0x0 */
            uint32_t ppu_testbuf_hw          : 1;  /* [    5],          r,        0x0 */
            uint32_t ppu_txbuf_hw            : 1;  /* [    6],          r,        0x0 */
            uint32_t ppu_rxbuf_hw            : 1;  /* [    7],          r,        0x0 */
            uint32_t ppu_adpll_sfreg_hw      : 1;  /* [    8],          r,        0x0 */
            uint32_t ppu_fbdv_hw             : 1;  /* [    9],          r,        0x0 */
            uint32_t pud_vco_hw              : 1;  /* [   10],          r,        0x0 */
            uint32_t ppu_vco_hw              : 1;  /* [   11],          r,        0x0 */
            uint32_t ppu_vco_ldo_hw          : 1;  /* [   12],          r,        0x0 */
            uint32_t ppu_lodist_body_bias_hw : 1;  /* [   13],          r,        0x0 */
            uint32_t reserved_14             : 1;  /* [   14],       rsvd,        0x0 */
            uint32_t ppu_rbb_hw              : 1;  /* [   15],          r,        0x0 */
            uint32_t ppu_lna_hw              : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_31          : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } non_reg_readback;

    /* 0x120 : Register control of TX/RX gain */
    union {
        struct
        {
            uint32_t gc_lna         : 3; /* [ 2: 0],        r/w,        0x7 */
            uint32_t gc_rbb1        : 2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t gc_rbb2        : 3; /* [ 7: 5],        r/w,        0x7 */
            uint32_t rbb_bw         : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11  : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t pa_ref_dac     : 5; /* [16:12],        r/w,       0x1c */
            uint32_t reserved_17_19 : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t pa_inbuf_unit  : 3; /* [22:20],        r/w,        0x7 */
            uint32_t reserved_23_31 : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } trx_gain_bw;

    /* 0x124 : Hardware read back of TX/RX gain */
    union {
        struct
        {
            uint32_t gc_lna_hw        : 3; /* [ 2: 0],          r,        0x0 */
            uint32_t gc_rbb1_hw       : 2; /* [ 4: 3],          r,        0x0 */
            uint32_t gc_rbb2_hw       : 3; /* [ 7: 5],          r,        0x0 */
            uint32_t rbb_bw_hw        : 1; /* [    8],          r,        0x0 */
            uint32_t reserved_9_11    : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t pa_ref_dac_hw    : 5; /* [16:12],          r,        0x0 */
            uint32_t reserved_17_19   : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t pa_inbuf_unit_hw : 3; /* [22:20],          r,        0x7 */
            uint32_t reserved_23_31   : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } trx_gain_bw_hw;

    /* 0x128 : DC Test register 0 */
    union {
        struct
        {
            uint32_t reserved_0_3   : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t dc_tp_out_en   : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t atest_out_en   : 2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t reserved_8_16  : 9; /* [16: 8],       rsvd,        0x0 */
            uint32_t ten_dtc        : 1; /* [   17],        r/w,        0x0 */
            uint32_t ten_rbb        : 1; /* [   18],        r/w,        0x0 */
            uint32_t ten_rbb_actest : 1; /* [   19],        r/w,        0x0 */
            uint32_t ten_adpll_adc  : 1; /* [   20],        r/w,        0x0 */
            uint32_t ten_vco        : 1; /* [   21],        r/w,        0x0 */
            uint32_t ten_rxadc      : 1; /* [   22],        r/w,        0x0 */
            uint32_t ten_rrf1       : 1; /* [   23],        r/w,        0x0 */
            uint32_t ten_rrf0       : 1; /* [   24],        r/w,        0x0 */
            uint32_t ten_pa_1       : 1; /* [   25],        r/w,        0x0 */
            uint32_t ten_pa_0       : 1; /* [   26],        r/w,        0x0 */
            uint32_t ten_lodist     : 1; /* [   27],        r/w,        0x0 */
            uint32_t ten_dll        : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_30 : 2; /* [30:29],       rsvd,        0x0 */
            uint32_t ten_mbg        : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dctest_actest;

