bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x12C : LO Bias Mode registers */
    union {
        struct
        {
            uint32_t dtest_pulldown     : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_22      : 22; /* [22: 1],       rsvd,        0x0 */
            uint32_t dtest_en_rxadc_q   : 1;  /* [   23],        r/w,        0x0 */
            uint32_t dtest_en_rxadc_i   : 1;  /* [   24],        r/w,        0x0 */
            uint32_t dtest_en_adpll_adc : 1;  /* [   25],        r/w,        0x0 */
            uint32_t dtest_en_mod4      : 1;  /* [   26],        r/w,        0x0 */
            uint32_t dtest_en_fref      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t dtest_en_dtc_out   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t dtest_en_dtc_in    : 1;  /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31     : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dtest;

    /* 0x130 : adpll_test */
    union {
        struct
        {
            uint32_t adpll_test_out       : 16; /* [15: 0],          r,        0x0 */
            uint32_t adpll_test_data_sel  : 3;  /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19          : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t adpll_test_start_sel : 2;  /* [21:20],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_test_en        : 1;  /* [   24],        r/w,        0x0 */
            uint32_t adpll_test_start     : 1;  /* [   25],          r,        0x0 */
            uint32_t reserved_26_31       : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_test;

    /* 0x134 : rf_ext_pa */
    union {
        struct
        {
            uint32_t rf_ext_pa_sb   : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t rf_ext_pa_lotx : 5; /* [ 9: 5],        r/w,        0x0 */
            uint32_t rf_ext_pa_tx   : 5; /* [14:10],        r/w,        0x1 */
            uint32_t rf_ext_pa_lorx : 5; /* [19:15],        r/w,        0x0 */
            uint32_t rf_ext_pa_rx   : 5; /* [24:20],        r/w,        0x2 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_ext_pa;

    /* 0x138  reserved */
    uint8_t RESERVED0x138[200];

    /* 0x200 : cip_ldo15 */
    union {
        struct
        {
            uint32_t vg11_sel      : 2;  /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cip_ldo15;

    /* 0x204 : PA register */
    union {
        struct
        {
            uint32_t pa_seri_cs_tx       : 4; /* [ 3: 0],        r/w,        0x6 */
            uint32_t pa_seri_cs_rx       : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t pa_seri_cs_hw       : 4; /* [11: 8],          r,        0x6 */
            uint32_t pa_para_cs          : 4; /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_19      : 4; /* [19:16],       rsvd,        0x0 */
            uint32_t pa_vdd11_sel        : 3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23         : 1; /* [   23],       rsvd,        0x0 */
            uint32_t pa_ldo_bm           : 3; /* [26:24],        r/w,        0x6 */
            uint32_t reserved_27         : 1; /* [   27],       rsvd,        0x0 */
            uint32_t pa_lp_en            : 1; /* [   28],        r/w,        0x0 */
            uint32_t pa_hp_en            : 1; /* [   29],        r/w,        0x0 */
            uint32_t pa_force_short_open : 1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pa;

    /* 0x208 : LNA mixer register */
    union {
        struct
        {
            uint32_t rmx_bm        : 3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t lna_rfb_match : 3; /* [ 5: 3],        r/w,        0x4 */
            uint32_t lna_vdd13_sel : 2; /* [ 7: 6],        r/w,        0x2 */
            uint32_t lna_load_csw  : 4; /* [11: 8],        r/w,        0x7 */
            uint32_t lna_lg_gsel   : 3; /* [14:12],        r/w,        0x1 */
            uint32_t lna_cap_match : 3; /* [17:15],        r/w,        0x0 */
            uint32_t lna_cap_lg    : 2; /* [19:18],        r/w,        0x0 */
            uint32_t lna_bm_lg     : 4; /* [23:20],        r/w,        0x5 */
            uint32_t lna_bm_hg     : 4; /* [27:24],        r/w,        0x5 */
            uint32_t lna_bm_hw     : 4; /* [31:28],          r,        0x5 */
        } BF;
        uint32_t WORD;
    } lna_mx;

    /* 0x20C : rbb_rosdac */
    union {
        struct
        {
            uint32_t rosdac_q_hw    : 6; /* [ 5: 0],          r,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rosdac_i_hw    : 6; /* [13: 8],          r,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rosdac_q       : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rosdac_i       : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_rosdac;

    /* 0x210 : rbb_cap_1 */
    union {
        struct
        {
            uint32_t rbb_cap2_fc_q  : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rbb_cap2_fc_i  : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_q  : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_i  : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_cap_1;

