bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x214 : rbb_cap_2 */
    union {
        struct
        {
            uint32_t rbb_cap2_fc_q_hw : 6; /* [ 5: 0],          r,       0x20 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rbb_cap2_fc_i_hw : 6; /* [13: 8],          r,       0x20 */
            uint32_t reserved_14_15   : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_q_hw : 6; /* [21:16],          r,       0x20 */
            uint32_t reserved_22_23   : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_i_hw : 6; /* [29:24],          r,       0x20 */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_cap_2;

    /* 0x218 : rbb_cap_3 */
    union {
        struct
        {
            uint32_t rbb_cap2_fc_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7      : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rbb_cap2_fc_i_bw0 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15    : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_q_bw0 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23    : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_i_bw0 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_cap_3;

    /* 0x21C : rbb_cap4 */
    union {
        struct
        {
            uint32_t rbb_cap2_fc_q_bw1 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7      : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rbb_cap2_fc_i_bw1 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15    : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_q_bw1 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23    : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_i_bw1 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_cap4;

    /* 0x220 : rbb_rx */
    union {
        struct
        {
            uint32_t rbb_rx2_bw1 : 3; /* [ 2: 0],        r/w,        0x5 */
            uint32_t reserved_3  : 1; /* [    3],       rsvd,        0x0 */
            uint32_t rbb_rx1_bw1 : 3; /* [ 6: 4],        r/w,        0x5 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rbb_rx2_bw0 : 3; /* [10: 8],        r/w,        0x2 */
            uint32_t reserved_11 : 1; /* [   11],       rsvd,        0x0 */
            uint32_t rbb_rx1_bw0 : 3; /* [14:12],        r/w,        0x2 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t rbb_rx2_hw  : 3; /* [18:16],          r,        0x2 */
            uint32_t reserved_19 : 1; /* [   19],       rsvd,        0x0 */
            uint32_t rbb_rx1_hw  : 3; /* [22:20],          r,        0x2 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t rbb_rx2     : 3; /* [26:24],        r/w,        0x5 */
            uint32_t reserved_27 : 1; /* [   27],       rsvd,        0x0 */
            uint32_t rbb_rx1     : 3; /* [30:28],        r/w,        0x5 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_rx;

    /* 0x224 : rbb */
    union {
        struct
        {
            uint32_t pkdet_out_latch            : 1; /* [    0],          r,        0x0 */
            uint32_t pkdet_out_raw              : 1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_3               : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t rbb_pkdet_out_rstn_ctrl_hw : 1; /* [    4],        r/w,        0x1 */
            uint32_t rbb_pkdet_out_rstn_hw      : 1; /* [    5],          r,        0x1 */
            uint32_t rbb_pkdet_out_rstn         : 1; /* [    6],        r/w,        0x1 */
            uint32_t reserved_7                 : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rbb_pkdet_en_ctrl_hw       : 1; /* [    8],        r/w,        0x1 */
            uint32_t rbb_pkdet_en_hw            : 1; /* [    9],          r,        0x0 */
            uint32_t rbb_pkdet_en               : 1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11                : 1; /* [   11],       rsvd,        0x0 */
            uint32_t rbb_pkdet_vth              : 4; /* [15:12],        r/w,        0x5 */
            uint32_t rosdac_range               : 2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18                : 1; /* [   18],       rsvd,        0x0 */
            uint32_t rbb_lpf_en                 : 1; /* [   19],        r/w,        0x0 */
            uint32_t rbb_deq                    : 2; /* [21:20],        r/w,        0x0 */
            uint32_t reserved_22_23             : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_vcm                    : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_27             : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t rbb_bm_op                  : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31             : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb;

    /* 0x228 : rxadc */
    union {
        struct
        {
            uint32_t rxadc_oscal_en      : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3        : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t rxadc_vref_sel      : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rxadc_clk_sync_inv  : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11       : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t rxadc_clk_inv       : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t rxadc_clk_div_sel   : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19      : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t rxadc_glitch_remove : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t rxadc_dly_ctrl      : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31      : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxadc;

