bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x22C : rxadc_readback */
    union {
        struct
        {
            uint32_t rxadc_dout_q   : 9; /* [ 8: 0],          r,      0x100 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t rxadc_dout_i   : 9; /* [24:16],          r,      0x100 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxadc_readback;

    /* 0x230 : rf_adc_osdata */
    union {
        struct
        {
            uint32_t rxadc_os_q     : 9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t rxadc_os_i     : 9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_adc_osdata;

    /* 0x234 : testbuf */
    union {
        struct
        {
            uint32_t testbuf_rin    : 1; /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3   : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t testbuf_rfb    : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7   : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t testbuf_op_cc  : 4; /* [11: 8],        r/w,        0xa */
            uint32_t testbuf_boost  : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15 : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t testbuf_bm     : 3; /* [18:16],        r/w,        0x2 */
            uint32_t reserved_19    : 1; /* [   19],       rsvd,        0x0 */
            uint32_t testbuf_vcm    : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t pu_testbuf     : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } testbuf;

    /* 0x238 : vco */
    union {
        struct
        {
            uint32_t vco_short_vbias_filter : 1; /* [    0],        r/w,        0x0 */
            uint32_t vco_short_idac_filter  : 1; /* [    1],        r/w,        0x0 */
            uint32_t vco_modcap_sel         : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t vco_acal_vref          : 3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7             : 1; /* [    7],       rsvd,        0x0 */
            uint32_t vco_vbias              : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_11         : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t vco_idac_boost         : 1; /* [   12],        r/w,        0x0 */
            uint32_t vco_ldo_vsel           : 2; /* [14:13],        r/w,        0x1 */
            uint32_t vco_ldo_bypass         : 1; /* [   15],        r/w,        0x0 */
            uint32_t vco_idac               : 6; /* [21:16],        r/w,       0x18 */
            uint32_t reserved_22_23         : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t vco_idac_hw            : 6; /* [29:24],          r,       0x20 */
            uint32_t reserved_30            : 1; /* [   30],       rsvd,        0x0 */
            uint32_t vco_acal_ud            : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } vco;

    /* 0x23C : lodist */
    union {
        struct
        {
            uint32_t lodist_txbuf_supply_mode  : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3              : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t lodist_rxbuf_supply_mode  : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t lodist_rxbuf_supply_boost : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t lodist_rwell_bias         : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11            : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t lodist_nwell_bias         : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15            : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t lodist_75dc_sel           : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31            : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lodist;

    /* 0x240 : fbdv */
    union {
        struct
        {
            uint32_t fbdv_tpm_clk_sel         : 3; /* [ 2: 0],        r/w,        0x1 */
            uint32_t reserved_3               : 1; /* [    3],       rsvd,        0x0 */
            uint32_t fbdv_adpll_clk_sel       : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7             : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t fbdv_dco_dither_clk_sel  : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11            : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t fbdv_fb_clk_sel          : 1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t fbdv_sample_clk_sel      : 2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19           : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t fbdv_stg_sel             : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23           : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t rst_mmdiv                : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27           : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t lotpm_fmash_clk_polarity : 1; /* [   28],        r/w,        0x0 */
            uint32_t dco_dither_clk_polarity  : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } fbdv;

    /* 0x244 : kcal1 */
    union {
        struct
        {
            uint32_t kcal_div       : 16; /* [15: 0],        r/w,     0x2bc0 */
            uint32_t kcal_cnt_start : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19 : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t kcal_ratio     : 10; /* [29:20],        r/w,      0x355 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } kcal1;

    /* 0x248 : kcal2 */
    union {
        struct
        {
            uint32_t kcal_cnt_op    : 16; /* [15: 0],          r,        0x0 */
            uint32_t kcal_cnt_rdy   : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_19 : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t kcal_ratio_hw  : 10; /* [29:20],          r,      0x355 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } kcal2;

    /* 0x24C : adpll_slope_gen */
    union {
        struct
        {
            uint32_t adpll_slope_gen_r_sel               : 3;  /* [ 2: 0],        r/w,        0x1 */
            uint32_t reserved_3                          : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t adpll_slope_gen_dc_corr             : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t adpll_slope_gen_pulse_width_enhance : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_31                       : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_slope_gen;

