bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x250 : adpll_adc */
    union {
        struct
        {
            uint32_t adpll_adc_vth_bias_mode : 1; /* [    0],        r/w,        0x0 */
            uint32_t adpll_adc_vth_en        : 1; /* [    1],        r/w,        0x0 */
            uint32_t adpll_adc_data_sign_sel : 1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3              : 1; /* [    3],       rsvd,        0x0 */
            uint32_t adpll_adc_vref_fine     : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7            : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t adpll_adc_vref_coarse   : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t reserved_10_11          : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_adc_oscal_en      : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t adpll_adc_clk_sync_inv  : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23          : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t adpll_adc_clk_div_sel   : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27          : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t adpll_adc_clk_inv       : 1; /* [   28],        r/w,        0x0 */
            uint32_t adpll_adc_clk_en        : 1; /* [   29],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_adc;

    /* 0x254 : adpll_dtc */
    union {
        struct
        {
            uint32_t adpll_dtc_bypass      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3          : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t adpll_dtc_r_sel       : 3;  /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7            : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t adpll_dtc_inv_vth_sel : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_31        : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_dtc;

    /* 0x258 : lo_fc_config1 */
    union {
        struct
        {
            uint32_t lo_fcw         : 25; /* [24: 0],        r/w,   0x962000 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_fc_config1;

    /* 0x25C : lo_fcw_config2 */
    union {
        struct
        {
            uint32_t lo_fcw_hw      : 25; /* [24: 0],          r,   0x9b0000 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_fcw_config2;

    /* 0x260 : lo_fcw3 */
    union {
        struct
        {
            uint32_t tx_freq_mod_lp : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t tx_freq_mod_hp : 10; /* [25:16],          r,      0x200 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_fcw3;

    /* 0x264 : lotpm */
    union {
        struct
        {
            uint32_t lotpm_lfp_delay_sel   : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3          : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t lotpm_hfp_delay_fmash : 4;  /* [ 7: 4],        r/w,        0x2 */
            uint32_t lotpm_hfp_delay_fref  : 2;  /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11        : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t lotpm_hfp_polarity    : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15        : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t lotpm_hfp_mash1_sel   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31        : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lotpm;

    /* 0x268 : adpll1 */
    union {
        struct
        {
            uint32_t adpll_lo_unlock_intrpt_clear     : 1; /* [    0],        r/w,        0x0 */
            uint32_t adpll_lo_lock_sel                : 1; /* [    1],        r/w,        0x0 */
            uint32_t adpll_timeout_cnt1_sel           : 1; /* [    2],        r/w,        0x0 */
            uint32_t adpll_timeout_cnt_sel            : 1; /* [    3],        r/w,        0x0 */
            uint32_t adpll_momhold_lmsenb_ext         : 1; /* [    4],        r/w,        0x0 */
            uint32_t adpll_rst_coarse_det_ext         : 1; /* [    5],        r/w,        0x0 */
            uint32_t adpll_rst_spd_det_ext            : 1; /* [    6],        r/w,        0x0 */
            uint32_t adpll_loop_lock_ext              : 1; /* [    7],        r/w,        0x0 */
            uint32_t adpll_fcal_done_ext              : 1; /* [    8],        r/w,        0x0 */
            uint32_t adpll_fcal_start_ext             : 1; /* [    9],        r/w,        0x0 */
            uint32_t adpll_lo_lock_directly           : 1; /* [   10],        r/w,        0x0 */
            uint32_t adpll_lo_fsm_ext                 : 1; /* [   11],        r/w,        0x0 */
            uint32_t adpll_fsm_en                     : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13                      : 1; /* [   13],       rsvd,        0x0 */
            uint32_t adpll_lock_fail_en               : 1; /* [   14],        r/w,        0x0 */
            uint32_t adpll_abnormal_dealed            : 1; /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_17                   : 2; /* [17:16],       rsvd,        0x0 */
            uint32_t adpll_vctrl_det_start_ext        : 1; /* [   18],        r/w,        0x0 */
            uint32_t adpll_vctrl_det_en_ext           : 1; /* [   19],        r/w,        0x0 */
            uint32_t adpll_mom_update_en_ext          : 1; /* [   20],        r/w,        0x0 */
            uint32_t adpll_freqerr_det_start_ext      : 1; /* [   21],        r/w,        0x0 */
            uint32_t adpll_mom_search_en_ext          : 1; /* [   22],        r/w,        0x0 */
            uint32_t adpll_lo_open                    : 1; /* [   23],        r/w,        0x0 */
            uint32_t adpll_sfreg_sel                  : 1; /* [   24],        r/w,        0x0 */
            uint32_t adpll_lo_unlock_intrpt_clear_sel : 1; /* [   25],        r/w,        0x1 */
            uint32_t adpll_force_inc_fcal_en          : 1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31                   : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll1;

