bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x26C : adpll_lf_reg */
    union {
        struct
        {
            uint32_t adpll_lf_vctrl_range_ext : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t adpll_lf_lsb_ext         : 7; /* [ 8: 2],        r/w,       0x40 */
            uint32_t adpll_lf_avg_en          : 1; /* [    9],        r/w,        0x1 */
            uint32_t adpll_lf_f_p3            : 2; /* [11:10],        r/w,        0x1 */
            uint32_t reserved_12              : 1; /* [   12],       rsvd,        0x0 */
            uint32_t adpll_lf_beta_fast       : 1; /* [   13],        r/w,        0x1 */
            uint32_t adpll_lf_beta_exp        : 3; /* [16:14],        r/w,        0x3 */
            uint32_t adpll_lf_beta_base       : 2; /* [18:17],        r/w,        0x3 */
            uint32_t reserved_19              : 1; /* [   19],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_fast      : 2; /* [21:20],        r/w,        0x3 */
            uint32_t reserved_22_23           : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_exp       : 3; /* [26:24],        r/w,        0x2 */
            uint32_t adpll_lf_alpha_base      : 1; /* [   27],        r/w,        0x1 */
            uint32_t adpll_lf_ctrl_hw         : 1; /* [   28],        r/w,        0x1 */
            uint32_t reserved_29_31           : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_lf_reg;

    /* 0x270 : adpll_lf_tx */
    union {
        struct
        {
            uint32_t reserved_0_9           : 10; /* [ 9: 0],       rsvd,        0x0 */
            uint32_t adpll_lf_f_p3_tx       : 2;  /* [11:10],        r/w,        0x1 */
            uint32_t reserved_12            : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t adpll_lf_beta_fast_tx  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t adpll_lf_beta_exp_tx   : 3;  /* [16:14],        r/w,        0x3 */
            uint32_t adpll_lf_beta_base_tx  : 2;  /* [18:17],        r/w,        0x3 */
            uint32_t reserved_19            : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_fast_tx : 2;  /* [21:20],        r/w,        0x3 */
            uint32_t reserved_22_23         : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_exp_tx  : 3;  /* [26:24],        r/w,        0x2 */
            uint32_t adpll_lf_alpha_base_tx : 1;  /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_31         : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_lf_tx;

    /* 0x274 : adpll_lf_rx */
    union {
        struct
        {
            uint32_t reserved_0_9           : 10; /* [ 9: 0],       rsvd,        0x0 */
            uint32_t adpll_lf_f_p3_rx       : 2;  /* [11:10],        r/w,        0x1 */
            uint32_t reserved_12            : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t adpll_lf_beta_fast_rx  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t adpll_lf_beta_exp_rx   : 3;  /* [16:14],        r/w,        0x3 */
            uint32_t adpll_lf_beta_base_rx  : 2;  /* [18:17],        r/w,        0x3 */
            uint32_t reserved_19            : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_fast_rx : 2;  /* [21:20],        r/w,        0x3 */
            uint32_t reserved_22_23         : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_exp_rx  : 3;  /* [26:24],        r/w,        0x2 */
            uint32_t adpll_lf_alpha_base_rx : 1;  /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_31         : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_lf_rx;

    /* 0x278 : adpll_lf_hw */
    union {
        struct
        {
            uint32_t reserved_0_9           : 10; /* [ 9: 0],       rsvd,        0x0 */
            uint32_t adpll_lf_f_p3_hw       : 2;  /* [11:10],          r,        0x1 */
            uint32_t reserved_12            : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t adpll_lf_beta_fast_hw  : 1;  /* [   13],          r,        0x1 */
            uint32_t adpll_lf_beta_exp_hw   : 3;  /* [16:14],          r,        0x3 */
            uint32_t adpll_lf_beta_base_hw  : 2;  /* [18:17],          r,        0x3 */
            uint32_t reserved_19            : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_fast_hw : 2;  /* [21:20],          r,        0x3 */
            uint32_t reserved_22_23         : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_lf_alpha_exp_hw  : 3;  /* [26:24],          r,        0x2 */
            uint32_t adpll_lf_alpha_base_hw : 1;  /* [   27],          r,        0x1 */
            uint32_t reserved_28_31         : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_lf_hw;

    /* 0x27C : adpll_vctrl */
    union {
        struct
        {
            uint32_t sdmout_dly_sel               : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_3                 : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t sdm_bypass                   : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7                 : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t sdm_dither                   : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11               : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t sdm_order                    : 1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13                  : 1; /* [   13],       rsvd,        0x0 */
            uint32_t adpll_capcode_bypass         : 1; /* [   14],        r/w,        0x0 */
            uint32_t adpll_dco_mash_bypass        : 1; /* [   15],        r/w,        0x0 */
            uint32_t adpll_force_mom_hold         : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19               : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t adpll_mom_update_period      : 2; /* [21:20],        r/w,        0x0 */
            uint32_t reserved_22_23               : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t adpll_vctrl_det_cons_en      : 1; /* [   24],        r/w,        0x0 */
            uint32_t adpll_vctrl_moni_win_sel     : 1; /* [   25],        r/w,        0x0 */
            uint32_t adpll_vctrl_lock_win_sel     : 1; /* [   26],        r/w,        0x0 */
            uint32_t adpll_vctrl_range_sel_ext_en : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31               : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_vctrl;

    /* 0x280 : adpll_lms */
    union {
        struct
        {
            uint32_t adpll_pha_cancel_delay      : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_3                : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t adpll_pha_cancel_en         : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7                : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t adpll_lms_q_delay           : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t adpll_pha_prbs_sel          : 2; /* [11:10],        r/w,        0x1 */
            uint32_t adpll_lms_step_enlarge      : 1; /* [   12],        r/w,        0x0 */
            uint32_t adpll_pha_dither_en         : 1; /* [   13],        r/w,        0x0 */
            uint32_t adpll_pha_dem_en            : 1; /* [   14],        r/w,        0x1 */
            uint32_t adpll_sdm_dither_prbs_en    : 1; /* [   15],        r/w,        0x0 */
            uint32_t adpll_lms_step              : 2; /* [17:16],        r/w,        0x2 */
            uint32_t adpll_sdm_dither_en_ctrl_hw : 1; /* [   18],        r/w,        0x1 */
            uint32_t adpll_sdm_dither_en         : 1; /* [   19],        r/w,        0x1 */
            uint32_t adpll_lms_ext_value         : 9; /* [28:20],        r/w,      0x140 */
            uint32_t adpll_lms_ext_value_en      : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30                 : 1; /* [   30],       rsvd,        0x0 */
            uint32_t adpll_fref_div2_en          : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_lms;

    /* 0x284 : adpll_spd */
    union {
        struct
        {
            uint32_t adpll_spd_in_range_delay         : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3                     : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t adpll_spd_out_range_delay        : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7                     : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t adpll_spd_in_range_cons          : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t adpll_coarse_path_turnoff        : 2; /* [11:10],        r/w,        0x2 */
            uint32_t adpll_spd_threshold              : 2; /* [13:12],        r/w,        0x3 */
            uint32_t adpll_coarse_in_range_cons       : 2; /* [15:14],        r/w,        0x3 */
            uint32_t adpll_spd_gain                   : 2; /* [17:16],        r/w,        0x2 */
            uint32_t adpll_coarse_gain                : 2; /* [19:18],        r/w,        0x2 */
            uint32_t adpll_force_lf_fast_mode_ctrl_hw : 1; /* [   20],        r/w,        0x1 */
            uint32_t adpll_force_lf_fast_mode         : 1; /* [   21],        r/w,        0x0 */
            uint32_t adpll_force_lf_fast_mode_hw      : 1; /* [   22],          r,        0x0 */
            uint32_t adpll_coarse_phaerr_en           : 1; /* [   23],        r/w,        0x1 */
            uint32_t adpll_coarse_path_offtime_sel    : 1; /* [   24],        r/w,        0x0 */
            uint32_t adpll_spd_outrange_dly_sel_ext   : 2; /* [26:25],        r/w,        0x1 */
            uint32_t adpll_spd_lms_sstp_win_sel       : 1; /* [   27],        r/w,        0x0 */
            uint32_t adpll_force_coarse_path_on       : 1; /* [   28],        r/w,        0x0 */
            uint32_t adpll_coarsepha_dly_sel          : 1; /* [   29],        r/w,        0x0 */
            uint32_t adpll_spd_in_range_delay_1       : 2; /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } adpll_spd;

