bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x288 : fcal */
    union {
        struct
        {
            uint32_t fcal_div_ratio_adj_en     : 1; /* [    0],        r/w,        0x1 */
            uint32_t fcal_coarse_pha_threshold : 2; /* [ 2: 1],        r/w,        0x1 */
            uint32_t fcal_mom_toggle_cnt       : 1; /* [    3],        r/w,        0x0 */
            uint32_t fcal_clk_period           : 2; /* [ 5: 4],        r/w,        0x2 */
            uint32_t fcal_mode                 : 2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t reserved_8_15             : 8; /* [15: 8],       rsvd,        0x0 */
            uint32_t fcal_mom_ini_ext          : 8; /* [23:16],        r/w,       0x80 */
            uint32_t reserved_24_31            : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } fcal;

    /* 0x28C : adpll_polarity */
    union {
        struct
        {
            uint32_t reserved_0_7          : 8;  /* [ 7: 0],       rsvd,        0x0 */
            uint32_t adpll_lp_mom_polarity : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11         : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t adpll_lms_polarity    : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15        : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t adpll_fcal_polarity   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19        : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t adpll_lp_polarity     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31        : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_polarity;

    /* 0x290 : adpll_output */
    union {
        struct
        {
            uint32_t adpll_unlock_intrpt       : 1;  /* [    0],          r,        0x0 */
            uint32_t adpll_lo_lock             : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2                : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t adpll_fsm_state           : 4;  /* [ 6: 3],          r,        0x0 */
            uint32_t adpll_spd_unlock_sign     : 1;  /* [    7],          r,        0x0 */
            uint32_t adpll_vctrl_out_range_fsm : 1;  /* [    8],          r,        0x0 */
            uint32_t adpll_mom_update_fail_fsm : 1;  /* [    9],          r,        0x0 */
            uint32_t adpll_mom_update_ou_fsm   : 1;  /* [   10],          r,        0x0 */
            uint32_t adpll_spd_unlock_fsm      : 1;  /* [   11],          r,        0x0 */
            uint32_t adpll_spd_lock_fsm        : 1;  /* [   12],          r,        0x0 */
            uint32_t adpll_fcal_done_fsm       : 1;  /* [   13],          r,        0x0 */
            uint32_t adpll_capcode_out_range   : 1;  /* [   14],          r,        0x0 */
            uint32_t adpll_mom_update_total_ou : 2;  /* [16:15],          r,        0x0 */
            uint32_t adpll_capcode_ud          : 1;  /* [   17],          r,        0x0 */
            uint32_t adpll_vctrl_det_done      : 1;  /* [   18],          r,        0x0 */
            uint32_t adpll_freqerr_sign        : 1;  /* [   19],          r,        0x0 */
            uint32_t adpll_freqerr_ou          : 1;  /* [   20],          r,        0x0 */
            uint32_t adpll_freqerr_det_done    : 1;  /* [   21],          r,        0x0 */
            uint32_t reserved_22_31            : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_output;

    /* 0x294 : adpll_reserved */
    union {
        struct
        {
            uint32_t adpll_resv1 : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t adpll_resv0 : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adpll_reserved;

    /* 0x298 : rf_reserved */
    union {
        struct
        {
            uint32_t rf_resv1 : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t rf_resv0 : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_reserved;

    /* 0x29C : rf_reserved_2 */
    union {
        struct
        {
            uint32_t rf_resv : 32; /* [31: 0],        r/w, 0x55555555 */
        } BF;
        uint32_t WORD;
    } rf_reserved_2;

    /* 0x2a0  reserved */
    uint8_t RESERVED0x2a0[96];

    /* 0x300 : rbb_gain_ctrl0 */
    union {
        struct
        {
            uint32_t gain_ctrl0_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl0_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl0_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl0_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl0_g_rbb2       : 3; /* [26:24],        r/w,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl0_g_rbb1       : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl0;

    /* 0x304 : rbb_gain_ctrl1 */
    union {
        struct
        {
            uint32_t gain_ctrl1_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl1_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl1_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl1_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl1_g_rbb2       : 3; /* [26:24],        r/w,        0x1 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl1_g_rbb1       : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl1;

    /* 0x308 : rbb_gain_ctrl2 */
    union {
        struct
        {
            uint32_t gain_ctrl2_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl2_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl2_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl2_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl2_g_rbb2       : 3; /* [26:24],        r/w,        0x2 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl2_g_rbb1       : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl2;

    /* 0x30C : rbb_gain_ctrl3 */
    union {
        struct
        {
            uint32_t gain_ctrl3_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl3_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl3_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl3_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl3_g_rbb2       : 3; /* [26:24],        r/w,        0x3 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl3_g_rbb1       : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl3;

    /* 0x310 : rbb_gain_ctrl4 */
    union {
        struct
        {
            uint32_t gain_ctrl4_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl4_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl4_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl4_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl4_g_rbb2       : 3; /* [26:24],        r/w,        0x1 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl4_g_rbb1       : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl4;

    /* 0x314 : rbb_gain_ctrl5 */
    union {
        struct
        {
            uint32_t gain_ctrl5_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl5_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl5_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl5_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl5_g_rbb2       : 3; /* [26:24],        r/w,        0x2 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl5_g_rbb1       : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl5;

