bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x318 : rbb_gain_ctrl6 */
    union {
        struct
        {
            uint32_t gain_ctrl6_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl6_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl6_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl6_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl6_g_rbb2       : 3; /* [26:24],        r/w,        0x3 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl6_g_rbb1       : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl6;

    /* 0x31C : rbb_gain_ctrl7 */
    union {
        struct
        {
            uint32_t gain_ctrl7_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl7_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl7_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl7_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl7_g_rbb2       : 3; /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl7_g_rbb1       : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl7;

    /* 0x320 : rbb_gain_ctrl8 */
    union {
        struct
        {
            uint32_t gain_ctrl8_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl8_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl8_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl8_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl8_g_rbb2       : 3; /* [26:24],        r/w,        0x5 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl8_g_rbb1       : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl8;

    /* 0x324 : rbb_gain_ctrl9 */
    union {
        struct
        {
            uint32_t gain_ctrl9_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl9_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl9_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl9_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl9_g_rbb2       : 3; /* [26:24],        r/w,        0x3 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl9_g_rbb1       : 2; /* [29:28],        r/w,        0x2 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl9;

    /* 0x328 : rbb_gain_ctrl10 */
    union {
        struct
        {
            uint32_t gain_ctrl10_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl10_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl10_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl10_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl10_g_rbb2       : 3; /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl10_g_rbb1       : 2; /* [29:28],        r/w,        0x2 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl10;

    /* 0x32C : rbb_gain_ctrl11 */
    union {
        struct
        {
            uint32_t gain_ctrl11_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl11_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl11_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl11_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl11_g_rbb2       : 3; /* [26:24],        r/w,        0x5 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl11_g_rbb1       : 2; /* [29:28],        r/w,        0x2 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl11;

    /* 0x330 : rbb_gain_ctrl12 */
    union {
        struct
        {
            uint32_t gain_ctrl12_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl12_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl12_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl12_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl12_g_rbb2       : 3; /* [26:24],        r/w,        0x6 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl12_g_rbb1       : 2; /* [29:28],        r/w,        0x2 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl12;

    /* 0x334 : rbb_gain_ctrl13 */
    union {
        struct
        {
            uint32_t gain_ctrl13_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl13_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl13_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl13_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl13_g_rbb2       : 3; /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl13_g_rbb1       : 2; /* [29:28],        r/w,        0x3 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl13;

    /* 0x338 : rbb_gain_ctrl14 */
    union {
        struct
        {
            uint32_t gain_ctrl14_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl14_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl14_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl14_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl14_g_rbb2       : 3; /* [26:24],        r/w,        0x5 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl14_g_rbb1       : 2; /* [29:28],        r/w,        0x3 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl14;

    /* 0x33C : rbb_gain_ctrl15 */
    union {
        struct
        {
            uint32_t gain_ctrl15_rosdac_q_bw0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t gain_ctrl15_rosdac_i_bw0 : 6; /* [11: 6],        r/w,       0x20 */
            uint32_t gain_ctrl15_rosdac_q_bw1 : 6; /* [17:12],        r/w,       0x20 */
            uint32_t gain_ctrl15_rosdac_i_bw1 : 6; /* [23:18],        r/w,       0x20 */
            uint32_t gain_ctrl15_g_rbb2       : 3; /* [26:24],        r/w,        0x6 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl15_g_rbb1       : 2; /* [29:28],        r/w,        0x3 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_ctrl15;

