bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x340  reserved */
    uint8_t RESERVED0x340[192];

    /* 0x400 : acal_config */
    union {
        struct
        {
            uint32_t vco_idac_ll    : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t vco_idac_lh    : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t vco_idac_hl    : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t vco_idac_hh    : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } acal_config;

    /* 0x404 : lo_config_2402 */
    union {
        struct
        {
            uint32_t kcal_ratio_2402          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2402 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2402;

    /* 0x408 : lo_config_2404 */
    union {
        struct
        {
            uint32_t kcal_ratio_2404          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2404 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2404;

    /* 0x40C : lo_config_2406 */
    union {
        struct
        {
            uint32_t kcal_ratio_2406          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2406 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2406;

    /* 0x410 : lo_config_2408 */
    union {
        struct
        {
            uint32_t kcal_ratio_2408          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2408 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2408;

    /* 0x414 : lo_config_2410 */
    union {
        struct
        {
            uint32_t kcal_ratio_2410          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2410 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2410;

    /* 0x418 : lo_config_2412 */
    union {
        struct
        {
            uint32_t kcal_ratio_2412          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2412 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2412;

    /* 0x41C : lo_config_2414 */
    union {
        struct
        {
            uint32_t kcal_ratio_2414          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2414 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2414;

    /* 0x420 : lo_config_2416 */
    union {
        struct
        {
            uint32_t kcal_ratio_2416          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2416 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2416;

    /* 0x424 : lo_config_2418 */
    union {
        struct
        {
            uint32_t kcal_ratio_2418          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2418 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2418;

    /* 0x428 : lo_config_2420 */
    union {
        struct
        {
            uint32_t kcal_ratio_2420          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2420 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2420;

    /* 0x42C : lo_config_2422 */
    union {
        struct
        {
            uint32_t kcal_ratio_2422          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2422 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2422;

    /* 0x430 : lo_config_2424 */
    union {
        struct
        {
            uint32_t kcal_ratio_2424          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2424 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2424;

    /* 0x434 : lo_config_2426 */
    union {
        struct
        {
            uint32_t kcal_ratio_2426          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2426 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2426;

