bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x438 : lo_config_2428 */
    union {
        struct
        {
            uint32_t kcal_ratio_2428          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2428 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2428;

    /* 0x43C : lo_config_2430 */
    union {
        struct
        {
            uint32_t kcal_ratio_2430          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2430 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2430;

    /* 0x440 : lo_config_2432 */
    union {
        struct
        {
            uint32_t kcal_ratio_2432          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2432 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2432;

    /* 0x444 : lo_config_2434 */
    union {
        struct
        {
            uint32_t kcal_ratio_2434          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2434 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2434;

    /* 0x448 : lo_config_2436 */
    union {
        struct
        {
            uint32_t kcal_ratio_2436          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2436 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2436;

    /* 0x44C : lo_config_2438 */
    union {
        struct
        {
            uint32_t kcal_ratio_2438          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2438 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2438;

    /* 0x450 : lo_config_2440 */
    union {
        struct
        {
            uint32_t kcal_ratio_2440          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2440 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2440;

    /* 0x454 : lo_config_2442 */
    union {
        struct
        {
            uint32_t kcal_ratio_2442          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2442 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2442;

    /* 0x458 : lo_config_2444 */
    union {
        struct
        {
            uint32_t kcal_ratio_2444          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2444 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2444;

    /* 0x45C : lo_config_2446 */
    union {
        struct
        {
            uint32_t kcal_ratio_2446          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2446 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2446;

    /* 0x460 : lo_config_2448 */
    union {
        struct
        {
            uint32_t kcal_ratio_2448          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2448 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2448;

    /* 0x464 : lo_config_2450 */
    union {
        struct
        {
            uint32_t kcal_ratio_2450          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2450 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2450;

    /* 0x468 : lo_config_2452 */
    union {
        struct
        {
            uint32_t kcal_ratio_2452          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2452 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2452;

