bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x46C : lo_config_2454 */
    union {
        struct
        {
            uint32_t kcal_ratio_2454          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2454 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2454;

    /* 0x470 : lo_config_2456 */
    union {
        struct
        {
            uint32_t kcal_ratio_2456          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2456 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2456;

    /* 0x474 : lo_config_2458 */
    union {
        struct
        {
            uint32_t kcal_ratio_2458          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2458 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2458;

    /* 0x478 : lo_config_2460 */
    union {
        struct
        {
            uint32_t kcal_ratio_2460          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2460 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2460;

    /* 0x47C : lo_config_2462 */
    union {
        struct
        {
            uint32_t kcal_ratio_2462          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2462 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2462;

    /* 0x480 : lo_config_2464 */
    union {
        struct
        {
            uint32_t kcal_ratio_2464          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2464 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2464;

    /* 0x484 : lo_config_2466 */
    union {
        struct
        {
            uint32_t kcal_ratio_2466          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2466 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2466;

    /* 0x488 : lo_config_2468 */
    union {
        struct
        {
            uint32_t kcal_ratio_2468          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2468 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2468;

    /* 0x48C : lo_config_2470 */
    union {
        struct
        {
            uint32_t kcal_ratio_2470          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2470 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2470;

    /* 0x490 : lo_config_2472 */
    union {
        struct
        {
            uint32_t kcal_ratio_2472          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2472 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2472;

    /* 0x494 : lo_config_2474 */
    union {
        struct
        {
            uint32_t kcal_ratio_2474          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2474 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2474;

    /* 0x498 : lo_config_2476 */
    union {
        struct
        {
            uint32_t kcal_ratio_2476          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2476 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2476;

    /* 0x49C : lo_config_2478 */
    union {
        struct
        {
            uint32_t kcal_ratio_2478          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2478 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2478;

    /* 0x4A0 : lo_config_2480 */
    union {
        struct
        {
            uint32_t kcal_ratio_2480          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2480 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2480;

    /* 0x4A4 : lo_config_2405 */
    union {
        struct
        {
            uint32_t kcal_ratio_2405          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2405 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2405;

