bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x4A8 : lo_config_2415 */
    union {
        struct
        {
            uint32_t kcal_ratio_2415          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2415 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2415;

    /* 0x4AC : lo_config_2425 */
    union {
        struct
        {
            uint32_t kcal_ratio_2425          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2425 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2425;

    /* 0x4B0 : lo_config_2435 */
    union {
        struct
        {
            uint32_t kcal_ratio_2435          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2435 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2435;

    /* 0x4B4 : lo_config_2445 */
    union {
        struct
        {
            uint32_t kcal_ratio_2445          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2445 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2445;

    /* 0x4B8 : lo_config_2455 */
    union {
        struct
        {
            uint32_t kcal_ratio_2455          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2455 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2455;

    /* 0x4BC : lo_config_2465 */
    union {
        struct
        {
            uint32_t kcal_ratio_2465          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2465 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2465;

    /* 0x4C0 : lo_config_2475 */
    union {
        struct
        {
            uint32_t kcal_ratio_2475          : 10; /* [ 9: 0],        r/w,      0x26c */
            uint32_t reserved_10_11           : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t adpll_sdm_dither_en_2475 : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_config_2475;

    /* 0x4c4  reserved */
    uint8_t RESERVED0x4c4[60];

    /* 0x500 : dg_testbus_0 */
    union {
        struct
        {
            uint32_t rf_testbus_read : 32; /* [31: 0],          r,    0xbf707 */
        } BF;
        uint32_t WORD;
    } dg_testbus_0;

    /* 0x504 : dg_testbus_1 */
    union {
        struct
        {
            uint32_t rf_testbus_sel : 4;  /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_31  : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dg_testbus_1;

    /* 0x508 : dg_ppud_0 */
    union {
        struct
        {
            uint32_t reserved_0_15   : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t ppud_cnt2       : 9;  /* [24:16],        r/w,       0x9a */
            uint32_t ppud_cnt1       : 5;  /* [29:25],        r/w,        0xf */
            uint32_t ppud_manaual_en : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31     : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dg_ppud_0;

    /* 0x50C : rf_top */
    union {
        struct
        {
            uint32_t rfckg_afifo_adpll_inv : 1;  /* [    0],        r/w,        0x0 */
            uint32_t rfckg_afifo_rxadc_inv : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rfckg_afifo_tx_inv    : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_15         : 13; /* [15: 3],       rsvd,        0x0 */
            uint32_t rf_mac_lo_time_offset : 6;  /* [21:16],        r/w,        0x4 */
            uint32_t rf_rx_mode_hw         : 2;  /* [23:22],          r,        0x0 */
            uint32_t rf_rx_mode_4s         : 2;  /* [25:24],        r/w,        0x0 */
            uint32_t rf_rx_mode_4s_en      : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27           : 1;  /* [   27],       rsvd,        0x0 */
            uint32_t rf_rx_en_4s           : 1;  /* [   28],        r/w,        0x0 */
            uint32_t rf_rx_en_src          : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rf_tx_en_4s           : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rf_tx_en_src          : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_top;

    /* 0x510 : rf_fsm */
    union {
        struct
        {
            uint32_t rf_fsm_lo_time        : 12; /* [11: 0],        r/w,      0x640 */
            uint32_t rf_fsm_state          : 3;  /* [14:12],          r,        0x0 */
            uint32_t reserved_15           : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t rf_fsm_st_4s          : 3;  /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19           : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t rf_fsm_st_4s_en       : 1;  /* [   20],        r/w,        0x0 */
            uint32_t rf_fsm_en             : 1;  /* [   21],        r/w,        0x1 */
            uint32_t rf_fsm_rx_afifo_4s    : 1;  /* [   22],        r/w,        0x0 */
            uint32_t rf_fsm_rx_afifo_4s_en : 1;  /* [   23],        r/w,        0x0 */
            uint32_t rf_fsm_tx_afifo_4s    : 1;  /* [   24],        r/w,        0x0 */
            uint32_t rf_fsm_tx_afifo_4s_en : 1;  /* [   25],        r/w,        0x0 */
            uint32_t rf_fsm_afifo_dly_time : 6;  /* [31:26],        r/w,       0x17 */
        } BF;
        uint32_t WORD;
    } rf_fsm;

