bouffalolab/bouffalo_sdk/drivers/bl702_driver/regs/rf_reg.h
    /* 0x514 : rf_singen_0 */
    union {
        struct
        {
            uint32_t singen_inc_step1 : 10; /* [ 9: 0],        r/w,        0x1 */
            uint32_t reserved_10_15   : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t singen_inc_step0 : 10; /* [25:16],        r/w,        0x1 */
            uint32_t reserved_26_27   : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t singen_unsign_en : 1;  /* [   28],        r/w,        0x0 */
            uint32_t singen_clkdiv_n  : 2;  /* [30:29],        r/w,        0x0 */
            uint32_t singen_en        : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_singen_0;

    /* 0x518 : rf_singen_1 */
    union {
        struct
        {
            uint32_t singen_clkdiv_q : 10; /* [ 9: 0],        r/w,        0x1 */
            uint32_t reserved_10_11  : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t singen_mode_q   : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t singen_clkdiv_i : 10; /* [25:16],        r/w,        0x1 */
            uint32_t reserved_26_27  : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t singen_mode_i   : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_singen_1;

    /* 0x51C : rf_singen_2 */
    union {
        struct
        {
            uint32_t singen_gain_i        : 11; /* [10: 0],        r/w,      0x3ff */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t singen_start_addr1_i : 10; /* [21:12],        r/w,        0x0 */
            uint32_t singen_start_addr0_i : 10; /* [31:22],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_singen_2;

    /* 0x520 : rf_singen_3 */
    union {
        struct
        {
            uint32_t singen_gain_q        : 11; /* [10: 0],        r/w,      0x3ff */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t singen_start_addr1_q : 10; /* [21:12],        r/w,        0x0 */
            uint32_t singen_start_addr0_q : 10; /* [31:22],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_singen_3;

    /* 0x524 : rf_singen_4 */
    union {
        struct
        {
            uint32_t singen_fix_q    : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t singen_fix_en_q : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15  : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t singen_fix_i    : 12; /* [27:16],        r/w,        0x0 */
            uint32_t singen_fix_en_i : 1;  /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_singen_4;

    /* 0x528 : rf_sram_ctrl0 */
    union {
        struct
        {
            uint32_t rf_sram_done     : 1;  /* [    0],          r,        0x0 */
            uint32_t rf_sram_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rf_sram_loop_en  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rf_sram_sts_clr  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rf_sram_mode     : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_15    : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t rf_sram_done_cnt : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl0;

    /* 0x52C : rf_sram_ctrl1 */
    union {
        struct
        {
            uint32_t rf_sram_addr_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t rf_sram_addr_start : 16; /* [31:16],        r/w,     0x6000 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl1;

    /* 0x530 : rf_sram_ctrl2 */
    union {
        struct
        {
            uint32_t rf_sram_sts : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl2;

    /* 0x534 : rf_test_mode */
    union {
        struct
        {
            uint32_t dacout_hw         : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t dacout_4s         : 12; /* [27:16],        r/w,        0x0 */
            uint32_t dacout_4s_en      : 1;  /* [   28],        r/w,        0x0 */
            uint32_t dacout_4s_sram_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rf_test_mode_en   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31       : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_test_mode;

    /* 0x538 : rf_rx_pulse_filter */
    union {
        struct
        {
            uint32_t pf_th2         : 9;  /* [ 8: 0],        r/w,        0xf */
            uint32_t reserved_9     : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t pf_th1         : 9;  /* [18:10],        r/w,       0x7f */
            uint32_t reserved_19    : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t pf_en_q        : 1;  /* [   20],        r/w,        0x0 */
            uint32_t pf_en_i        : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_rx_pulse_filter;
};

typedef volatile struct rf_reg rf_reg_t;

#endif /* __RF_REG_H__ */
